; ModuleID = 'pping_kern.c'
source_filename = "pping_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.5 = type { [4 x i32]*, [4 x i32]*, [4 x i32]* }
%struct.anon.6 = type { [1 x i32]*, %struct.network_tuple*, %struct.dual_flow_state*, [131072 x i32]* }
%struct.network_tuple = type { %struct.flow_address, %struct.flow_address, i16, i8, i8 }
%struct.flow_address = type { %struct.in6_addr, i16, i16 }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.dual_flow_state = type { %struct.flow_state, %struct.flow_state }
%struct.flow_state = type { i64, i64, i64, i64, i64, i64, i64, i32, i32, i8, i8, i8, [5 x i8] }
%struct.anon.7 = type { [1 x i32]*, %struct.packet_id*, i64*, [131072 x i32]* }
%struct.packet_id = type { %struct.network_tuple, i32 }
%struct.anon.8 = type { [5 x i32]*, i32*, %struct.aggregated_stats*, [16384 x i32]* }
%struct.aggregated_stats = type { i64, %struct.traffic_counters, %struct.traffic_counters, i64, i64, [250 x i32] }
%struct.traffic_counters = type { i64, i64, i64, i64, i64, i64 }
%struct.anon.9 = type { [5 x i32]*, i32*, %struct.aggregated_stats*, [16384 x i32]* }
%struct.anon.10 = type { [5 x i32]*, i64*, %struct.aggregated_stats*, [16384 x i32]* }
%struct.anon.11 = type { [5 x i32]*, i64*, %struct.aggregated_stats*, [16384 x i32]* }
%struct.anon.12 = type { [2 x i32]*, i32*, i32*, [1 x i32]* }

!59 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!60 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!61 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!62 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!63 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!64 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!65 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!66 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!67 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!68 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!69 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!70 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!71 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 397, baseType: !24, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "BPF_ANY", value: 0)
!75 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!76 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!77 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pping_error", file: !6, line: 86, baseType: !24, size: 32, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIEnumerator(name: "PPING_ERR_PKTTS_STORE", value: 0)
!81 = !DIEnumerator(name: "PPING_ERR_FLOW_CREATE", value: 1)
!82 = !DIEnumerator(name: "PPING_ERR_AGGSUBNET_CREATE", value: 2)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 4063, baseType: !84, size: 64, elements: !85)
!84 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "BPF_F_INDEX_MASK", value: 4294967295, isUnsigned: true)
!87 = !DIEnumerator(name: "BPF_F_CURRENT_CPU", value: 4294967295, isUnsigned: true)
!88 = !DIEnumerator(name: "BPF_F_CTXLEN_MASK", value: 4503595332403200, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 4955, baseType: !24, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99}
!91 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0)
!92 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1)
!93 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2)
!94 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3)
!95 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4)
!96 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5)
!97 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6)
!98 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7)
!99 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "flow_event_source", file: !6, line: 68, baseType: !7, size: 8, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "EVENT_SOURCE_PKT_SRC", value: 0)
!103 = !DIEnumerator(name: "EVENT_SOURCE_PKT_DEST", value: 1)
!104 = !DIEnumerator(name: "EVENT_SOURCE_GC", value: 2)
!105 = !{!106, !107, !108, !131, !147, !137, !138, !148, !150, !151, !152, !155}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !6, line: 132, size: 352, elements: !110)
!110 = !{!111, !143, !144, !145, !146}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !109, file: !6, line: 133, baseType: !112, size: 160)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !6, line: 119, size: 160, elements: !113)
!113 = !{!114, !141, !142}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !112, file: !6, line: 120, baseType: !115, size: 128)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !116, line: 33, size: 128, elements: !117)
!116 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !115, file: !116, line: 40, baseType: !119, size: 128)
!119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !116, line: 34, size: 128, elements: !120)
!120 = !{!121, !127, !135}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !119, file: !116, line: 35, baseType: !122, size: 128)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !125)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !124, line: 21, baseType: !7)
!124 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!125 = !{!126}
!126 = !DISubrange(count: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !119, file: !116, line: 37, baseType: !128, size: 128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, elements: !133)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !130, line: 25, baseType: !131)
!130 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !124, line: 24, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !{!134}
!134 = !DISubrange(count: 8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !119, file: !116, line: 38, baseType: !136, size: 128)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !139)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !130, line: 27, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !124, line: 27, baseType: !24)
!139 = !{!140}
!140 = !DISubrange(count: 4)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !112, file: !6, line: 121, baseType: !131, size: 16, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !112, file: !6, line: 122, baseType: !131, size: 16, offset: 144)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !109, file: !6, line: 134, baseType: !112, size: 160, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !109, file: !6, line: 135, baseType: !131, size: 16, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !109, file: !6, line: 136, baseType: !123, size: 8, offset: 336)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !109, file: !6, line: 137, baseType: !123, size: 8, offset: 344)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !124, line: 31, baseType: !154)
!154 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!156 = !{!0, !157, !179, !211, !220, !254, !262, !270, !278, !290, !332, !363, !382, !390, !392, !396, !401, !437, !442, !447}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "packet_ts", scope: !2, file: !3, line: 143, type: !159, isLocal: false, isDefinition: true)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 138, size: 256, elements: !160)
!160 = !{!161, !167, !173, !174}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !3, line: 139, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 32, elements: !165)
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !{!166}
!166 = !DISubrange(count: 1)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !159, file: !3, line: 140, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id", file: !6, line: 167, size: 384, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !169, file: !6, line: 168, baseType: !109, size: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !169, file: !6, line: 169, baseType: !138, size: 32, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !159, file: !3, line: 141, baseType: !152, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !159, file: !3, line: 142, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 4194304, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 131072)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "flow_state", scope: !2, file: !3, line: 150, type: !181, isLocal: false, isDefinition: true)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 145, size: 256, elements: !182)
!182 = !{!183, !184, !185, !210}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !181, file: !3, line: 146, baseType: !162, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !181, file: !3, line: 147, baseType: !108, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !181, file: !3, line: 148, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dual_flow_state", file: !6, line: 162, size: 1152, elements: !188)
!188 = !{!189, !209}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dir1", scope: !187, file: !6, line: 163, baseType: !190, size: 576)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_state", file: !6, line: 140, size: 576, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !205}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !190, file: !6, line: 141, baseType: !153, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "srtt", scope: !190, file: !6, line: 142, baseType: !153, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !190, file: !6, line: 143, baseType: !153, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !190, file: !6, line: 144, baseType: !153, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !190, file: !6, line: 145, baseType: !153, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !190, file: !6, line: 146, baseType: !153, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !190, file: !6, line: 147, baseType: !153, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !190, file: !6, line: 148, baseType: !138, size: 32, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "outstanding_timestamps", scope: !190, file: !6, line: 149, baseType: !138, size: 32, offset: 480)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "conn_state", scope: !190, file: !6, line: 150, baseType: !31, size: 8, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "opening_reason", scope: !190, file: !6, line: 151, baseType: !13, size: 8, offset: 520)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "has_been_timestamped", scope: !190, file: !6, line: 152, baseType: !204, size: 8, offset: 528)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !190, file: !6, line: 153, baseType: !206, size: 40, offset: 536)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 40, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 5)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dir2", scope: !187, file: !6, line: 164, baseType: !190, size: 576, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !181, file: !3, line: 149, baseType: !175, size: 64, offset: 192)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "events", scope: !2, file: !3, line: 156, type: !213, isLocal: false, isDefinition: true)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 152, size: 192, elements: !214)
!214 = !{!215, !218, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !3, line: 153, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !139)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !213, file: !3, line: 154, baseType: !216, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !213, file: !3, line: 155, baseType: !216, size: 64, offset: 128)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "map_v4_agg1", scope: !2, file: !3, line: 163, type: !222, isLocal: false, isDefinition: true)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 158, size: 256, elements: !223)
!223 = !{!224, !227, !228, !249}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !3, line: 159, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 160, elements: !207)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !222, file: !3, line: 160, baseType: !151, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !222, file: !3, line: 161, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aggregated_stats", file: !6, line: 265, size: 8960, elements: !231)
!231 = !{!232, !233, !242, !243, !244, !245}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last_updated", scope: !230, file: !6, line: 266, baseType: !153, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rx_stats", scope: !230, file: !6, line: 267, baseType: !234, size: 384, offset: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_counters", file: !6, line: 256, size: 384, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_ts_pkts", scope: !234, file: !6, line: 257, baseType: !153, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_ts_bytes", scope: !234, file: !6, line: 258, baseType: !153, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nots_pkts", scope: !234, file: !6, line: 259, baseType: !153, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nots_bytes", scope: !234, file: !6, line: 260, baseType: !153, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "other_pkts", scope: !234, file: !6, line: 261, baseType: !153, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "other_bytes", scope: !234, file: !6, line: 262, baseType: !153, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tx_stats", scope: !230, file: !6, line: 268, baseType: !234, size: 384, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_min", scope: !230, file: !6, line: 269, baseType: !153, size: 64, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_max", scope: !230, file: !6, line: 270, baseType: !153, size: 64, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_bins", scope: !230, file: !6, line: 271, baseType: !246, size: 8000, offset: 960)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8000, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 250)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !222, file: !3, line: 162, baseType: !250, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 524288, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 16384)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "map_v4_agg2", scope: !2, file: !3, line: 170, type: !256, isLocal: false, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 165, size: 256, elements: !257)
!257 = !{!258, !259, !260, !261}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !3, line: 166, baseType: !225, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !256, file: !3, line: 167, baseType: !151, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !3, line: 168, baseType: !229, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !256, file: !3, line: 169, baseType: !250, size: 64, offset: 192)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "map_v6_agg1", scope: !2, file: !3, line: 177, type: !264, isLocal: false, isDefinition: true)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 172, size: 256, elements: !265)
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !3, line: 173, baseType: !225, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !264, file: !3, line: 174, baseType: !152, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !264, file: !3, line: 175, baseType: !229, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !264, file: !3, line: 176, baseType: !250, size: 64, offset: 192)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "map_v6_agg2", scope: !2, file: !3, line: 184, type: !272, isLocal: false, isDefinition: true)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 179, size: 256, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !3, line: 180, baseType: !225, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !272, file: !3, line: 181, baseType: !152, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !3, line: 182, baseType: !229, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !272, file: !3, line: 183, baseType: !250, size: 64, offset: 192)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "map_active_agg_instance", scope: !2, file: !3, line: 191, type: !280, isLocal: false, isDefinition: true)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 186, size: 256, elements: !281)
!281 = !{!282, !287, !288, !289}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !3, line: 187, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 2)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !280, file: !3, line: 188, baseType: !151, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !280, file: !3, line: 189, baseType: !151, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !280, file: !3, line: 190, baseType: !162, size: 64, offset: 192)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "map_global_counters", scope: !2, file: !3, line: 198, type: !292, isLocal: false, isDefinition: true)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 193, size: 256, elements: !293)
!293 = !{!294, !299, !300, !331}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !3, line: 194, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 192, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 6)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !292, file: !3, line: 195, baseType: !151, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !292, file: !3, line: 196, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "global_counters", file: !6, line: 287, size: 9280, elements: !303)
!303 = !{!304, !311, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ecn", scope: !302, file: !6, line: 288, baseType: !305, size: 256)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ecn_counters", file: !6, line: 274, size: 256, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "no_ect", scope: !305, file: !6, line: 275, baseType: !153, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ect1", scope: !305, file: !6, line: 276, baseType: !153, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ect0", scope: !305, file: !6, line: 277, baseType: !153, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ce", scope: !305, file: !6, line: 278, baseType: !153, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !302, file: !6, line: 289, baseType: !312, size: 192, offset: 256)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pping_error_counters", file: !6, line: 281, size: 192, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pktts_store", scope: !312, file: !6, line: 282, baseType: !153, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flow_create", scope: !312, file: !6, line: 283, baseType: !153, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "agg_subnet_create", scope: !312, file: !6, line: 284, baseType: !153, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nonip_pkts", scope: !302, file: !6, line: 290, baseType: !153, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nonip_bytes", scope: !302, file: !6, line: 291, baseType: !153, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_pkts", scope: !302, file: !6, line: 292, baseType: !153, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_bytes", scope: !302, file: !6, line: 293, baseType: !153, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "udp_pkts", scope: !302, file: !6, line: 294, baseType: !153, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "udp_bytes", scope: !302, file: !6, line: 295, baseType: !153, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_pkts", scope: !302, file: !6, line: 296, baseType: !153, size: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_bytes", scope: !302, file: !6, line: 297, baseType: !153, size: 64, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_pkts", scope: !302, file: !6, line: 298, baseType: !153, size: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_bytes", scope: !302, file: !6, line: 299, baseType: !153, size: 64, offset: 1024)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "other_ipprotos", scope: !302, file: !6, line: 300, baseType: !328, size: 8192, offset: 1088)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8192, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !292, file: !3, line: 197, baseType: !162, size: 64, offset: 192)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "map_packet_info", scope: !2, file: !3, line: 205, type: !334, isLocal: false, isDefinition: true)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 200, size: 256, elements: !335)
!335 = !{!336, !337, !338, !362}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !3, line: 201, baseType: !295, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !334, file: !3, line: 202, baseType: !151, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !334, file: !3, line: 203, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_info", file: !3, line: 91, size: 1088, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !340, file: !3, line: 92, baseType: !153, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_len", scope: !340, file: !3, line: 93, baseType: !138, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !340, file: !3, line: 94, baseType: !138, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !340, file: !3, line: 95, baseType: !169, size: 384, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid", scope: !340, file: !3, line: 96, baseType: !169, size: 384, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !340, file: !3, line: 97, baseType: !138, size: 32, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !340, file: !3, line: 101, baseType: !349, size: 32, offset: 928)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !340, file: !3, line: 98, size: 32, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_tos", scope: !349, file: !3, line: 99, baseType: !123, size: 8)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_tos", scope: !349, file: !3, line: 100, baseType: !137, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !340, file: !3, line: 102, baseType: !131, size: 16, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "is_ingress", scope: !340, file: !3, line: 103, baseType: !204, size: 8, offset: 976)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pid_flow_is_dfkey", scope: !340, file: !3, line: 104, baseType: !204, size: 8, offset: 984)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pid_valid", scope: !340, file: !3, line: 105, baseType: !204, size: 8, offset: 992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid_valid", scope: !340, file: !3, line: 106, baseType: !204, size: 8, offset: 1000)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !340, file: !3, line: 107, baseType: !5, size: 8, offset: 1008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "event_reason", scope: !340, file: !3, line: 108, baseType: !13, size: 8, offset: 1016)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wait_first_edge", scope: !340, file: !3, line: 109, baseType: !204, size: 8, offset: 1024)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_trackable", scope: !340, file: !3, line: 110, baseType: !204, size: 8, offset: 1032)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !334, file: !3, line: 204, baseType: !162, size: 64, offset: 192)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 128, type: !365, isLocal: true, isDefinition: true)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !6, line: 92, size: 320, elements: !368)
!368 = !{!369, !370, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !367, file: !6, line: 93, baseType: !153, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !367, file: !6, line: 94, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixpoint64", file: !6, line: 19, baseType: !153)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_prefix_mask", scope: !367, file: !6, line: 95, baseType: !153, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_prefix_mask", scope: !367, file: !6, line: 96, baseType: !138, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !367, file: !6, line: 97, baseType: !204, size: 8, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !367, file: !6, line: 98, baseType: !204, size: 8, offset: 232)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !367, file: !6, line: 99, baseType: !204, size: 8, offset: 240)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !367, file: !6, line: 100, baseType: !204, size: 8, offset: 248)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "skip_syn", scope: !367, file: !6, line: 101, baseType: !204, size: 8, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "push_individual_events", scope: !367, file: !6, line: 102, baseType: !204, size: 8, offset: 264)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "agg_rtts", scope: !367, file: !6, line: 103, baseType: !204, size: 8, offset: 272)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "agg_by_dst", scope: !367, file: !6, line: 104, baseType: !204, size: 8, offset: 280)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !384, line: 77, type: !385, isLocal: true, isDefinition: true)
!384 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/nir_ophir/code/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!107, !106, !388, !388, !153}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "empty_stats", scope: !2, file: !3, line: 134, type: !230, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "last_warn_time", scope: !2, file: !3, line: 129, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 128, elements: !285)
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !153)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "bpf_perf_event_output", scope: !2, file: !384, line: 692, type: !398, isLocal: true, isDefinition: true)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!107, !106, !106, !153, !106, !153}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !384, line: 1839, type: !403, isLocal: true, isDefinition: true)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!107, !106, !406, !164, !138}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !23, line: 4967, size: 512, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !421, !427, !432, !433, !434, !436}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !407, file: !23, line: 4971, baseType: !123, size: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !407, file: !23, line: 4974, baseType: !123, size: 8, offset: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !407, file: !23, line: 4975, baseType: !129, size: 16, offset: 16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !407, file: !23, line: 4976, baseType: !129, size: 16, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !407, file: !23, line: 4979, baseType: !131, size: 16, offset: 48)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !407, file: !23, line: 4984, baseType: !138, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !23, line: 4986, baseType: !416, size: 32, offset: 96)
!416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !407, file: !23, line: 4986, size: 32, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !416, file: !23, line: 4988, baseType: !123, size: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !416, file: !23, line: 4989, baseType: !137, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !416, file: !23, line: 4992, baseType: !138, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !23, line: 4995, baseType: !422, size: 128, offset: 128)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !407, file: !23, line: 4995, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !422, file: !23, line: 4996, baseType: !137, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !422, file: !23, line: 4997, baseType: !426, size: 128)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !139)
!427 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !23, line: 5004, baseType: !428, size: 128, offset: 256)
!428 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !407, file: !23, line: 5004, size: 128, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !428, file: !23, line: 5005, baseType: !137, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !428, file: !23, line: 5006, baseType: !426, size: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !407, file: !23, line: 5010, baseType: !129, size: 16, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !407, file: !23, line: 5011, baseType: !129, size: 16, offset: 400)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !407, file: !23, line: 5012, baseType: !435, size: 48, offset: 416)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !297)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !407, file: !23, line: 5013, baseType: !435, size: 48, offset: 464)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !384, line: 113, type: !439, isLocal: true, isDefinition: true)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!153}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !384, line: 55, type: !444, isLocal: true, isDefinition: true)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!106, !106, !388}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !384, line: 87, type: !449, isLocal: true, isDefinition: true)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!107, !106, !388}
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 32, elements: !139)
!453 = !{i32 7, !"Dwarf Version", i32 5}
!454 = !{i32 2, !"Debug Info Version", i32 3}
!455 = !{i32 1, !"wchar_size", i32 4}
!456 = !{i32 7, !"frame-pointer", i32 2}
!457 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!458 = distinct !DISubprogram(name: "parse_packet_identifer_tc", scope: !3, file: !3, line: 743, type: !459, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!459 = !DISubroutineType(types: !460)
!460 = !{!164, !461, !339}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !23, line: 4183, size: 1472, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !523, !524, !525, !526, !548}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !462, file: !23, line: 4184, baseType: !138, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !462, file: !23, line: 4185, baseType: !138, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !462, file: !23, line: 4186, baseType: !138, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !462, file: !23, line: 4187, baseType: !138, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !462, file: !23, line: 4188, baseType: !138, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !462, file: !23, line: 4189, baseType: !138, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !462, file: !23, line: 4190, baseType: !138, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !462, file: !23, line: 4191, baseType: !138, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !462, file: !23, line: 4192, baseType: !138, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !462, file: !23, line: 4193, baseType: !138, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !462, file: !23, line: 4194, baseType: !138, size: 32, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !462, file: !23, line: 4195, baseType: !138, size: 32, offset: 352)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !462, file: !23, line: 4196, baseType: !477, size: 160, offset: 384)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 160, elements: !207)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !462, file: !23, line: 4197, baseType: !138, size: 32, offset: 544)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !462, file: !23, line: 4198, baseType: !138, size: 32, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !462, file: !23, line: 4199, baseType: !138, size: 32, offset: 608)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !462, file: !23, line: 4200, baseType: !138, size: 32, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !462, file: !23, line: 4201, baseType: !138, size: 32, offset: 672)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !462, file: !23, line: 4204, baseType: !138, size: 32, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !462, file: !23, line: 4205, baseType: !138, size: 32, offset: 736)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !462, file: !23, line: 4206, baseType: !138, size: 32, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !462, file: !23, line: 4207, baseType: !426, size: 128, offset: 800)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !462, file: !23, line: 4208, baseType: !426, size: 128, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !462, file: !23, line: 4209, baseType: !138, size: 32, offset: 1056)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !462, file: !23, line: 4210, baseType: !138, size: 32, offset: 1088)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !462, file: !23, line: 4213, baseType: !138, size: 32, offset: 1120)
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !23, line: 4214, baseType: !492, size: 64, align: 64, offset: 1152)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !23, line: 4214, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !492, file: !23, line: 4214, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !23, line: 5041, size: 448, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !521, !522}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !496, file: !23, line: 5042, baseType: !131, size: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !496, file: !23, line: 5043, baseType: !131, size: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !496, file: !23, line: 5044, baseType: !131, size: 16, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !496, file: !23, line: 5045, baseType: !123, size: 8, offset: 48)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !496, file: !23, line: 5046, baseType: !123, size: 8, offset: 56)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !496, file: !23, line: 5047, baseType: !123, size: 8, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !496, file: !23, line: 5048, baseType: !123, size: 8, offset: 72)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !496, file: !23, line: 5049, baseType: !129, size: 16, offset: 80)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !496, file: !23, line: 5050, baseType: !129, size: 16, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !496, file: !23, line: 5051, baseType: !129, size: 16, offset: 112)
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !496, file: !23, line: 5052, baseType: !509, size: 256, offset: 128)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !23, line: 5052, size: 256, elements: !510)
!510 = !{!511, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, scope: !509, file: !23, line: 5053, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !23, line: 5053, size: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !512, file: !23, line: 5054, baseType: !137, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !512, file: !23, line: 5055, baseType: !137, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, scope: !509, file: !23, line: 5057, baseType: !517, size: 256)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !23, line: 5057, size: 256, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !517, file: !23, line: 5058, baseType: !426, size: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !517, file: !23, line: 5059, baseType: !426, size: 128, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !23, line: 5062, baseType: !138, size: 32, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !496, file: !23, line: 5063, baseType: !137, size: 32, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !462, file: !23, line: 4215, baseType: !153, size: 64, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !462, file: !23, line: 4216, baseType: !138, size: 32, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !462, file: !23, line: 4217, baseType: !138, size: 32, offset: 1312)
!526 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !23, line: 4218, baseType: !527, size: 64, align: 64, offset: 1344)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !23, line: 4218, size: 64, align: 64, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !527, file: !23, line: 4218, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !23, line: 4272, size: 640, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !531, file: !23, line: 4273, baseType: !138, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !531, file: !23, line: 4274, baseType: !138, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !23, line: 4275, baseType: !138, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !531, file: !23, line: 4276, baseType: !138, size: 32, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !531, file: !23, line: 4277, baseType: !138, size: 32, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !531, file: !23, line: 4278, baseType: !138, size: 32, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !531, file: !23, line: 4280, baseType: !138, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !531, file: !23, line: 4281, baseType: !426, size: 128, offset: 224)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !531, file: !23, line: 4282, baseType: !138, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !531, file: !23, line: 4283, baseType: !138, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !531, file: !23, line: 4284, baseType: !138, size: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !531, file: !23, line: 4285, baseType: !426, size: 128, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !531, file: !23, line: 4286, baseType: !138, size: 32, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !531, file: !23, line: 4287, baseType: !547, size: 32, offset: 608)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !124, line: 26, baseType: !164)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !462, file: !23, line: 4219, baseType: !138, size: 32, offset: 1408)
!549 = !{!550, !551, !552}
!550 = !DILocalVariable(name: "ctx", arg: 1, scope: !458, file: !3, line: 743, type: !461)
!551 = !DILocalVariable(name: "p_info", arg: 2, scope: !458, file: !3, line: 744, type: !339)
!552 = !DILocalVariable(name: "pctx", scope: !458, file: !3, line: 749, type: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsing_context", file: !3, line: 73, size: 256, elements: !554)
!554 = !{!555, !556, !557, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !553, file: !3, line: 74, baseType: !106, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !553, file: !3, line: 75, baseType: !106, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !553, file: !3, line: 76, baseType: !558, size: 64, offset: 128)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !559, line: 35, size: 64, elements: !560)
!559 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/nir_ophir/code/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !558, file: !559, line: 36, baseType: !106, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_len", scope: !553, file: !3, line: 77, baseType: !138, size: 32, offset: 192)
!563 = !DILocation(line: 0, scope: !458)
!564 = !DILocation(line: 746, column: 7, scope: !565)
!565 = distinct !DILexicalBlock(scope: !458, file: !3, line: 746, column: 6)
!566 = !DILocation(line: 746, column: 6, scope: !458)
!567 = !DILocation(line: 749, column: 2, scope: !458)
!568 = !DILocation(line: 749, column: 25, scope: !458)
!569 = !DILocation(line: 749, column: 32, scope: !458)
!570 = !DILocation(line: 750, column: 30, scope: !458)
!571 = !{!572, !573, i64 76}
!572 = !{!"__sk_buff", !573, i64 0, !573, i64 4, !573, i64 8, !573, i64 12, !573, i64 16, !573, i64 20, !573, i64 24, !573, i64 28, !573, i64 32, !573, i64 36, !573, i64 40, !573, i64 44, !574, i64 48, !573, i64 68, !573, i64 72, !573, i64 76, !573, i64 80, !573, i64 84, !573, i64 88, !573, i64 92, !573, i64 96, !574, i64 100, !574, i64 116, !573, i64 132, !573, i64 136, !573, i64 140, !574, i64 144, !576, i64 152, !573, i64 160, !573, i64 164, !574, i64 168, !573, i64 176}
!573 = !{!"int", !574, i64 0}
!574 = !{!"omnipotent char", !575, i64 0}
!575 = !{!"Simple C/C++ TBAA"}
!576 = !{!"long long", !574, i64 0}
!577 = !DILocation(line: 750, column: 19, scope: !458)
!578 = !DILocation(line: 750, column: 11, scope: !458)
!579 = !{!580, !581, i64 0}
!580 = !{!"parsing_context", !581, i64 0, !581, i64 8, !582, i64 16, !573, i64 24}
!581 = !{!"any pointer", !574, i64 0}
!582 = !{!"hdr_cursor", !581, i64 0}
!583 = !DILocation(line: 751, column: 34, scope: !458)
!584 = !{!572, !573, i64 80}
!585 = !DILocation(line: 751, column: 23, scope: !458)
!586 = !DILocation(line: 751, column: 15, scope: !458)
!587 = !{!580, !581, i64 8}
!588 = !DILocation(line: 752, column: 9, scope: !458)
!589 = !{!582, !581, i64 0}
!590 = !DILocation(line: 753, column: 19, scope: !458)
!591 = !{!572, !573, i64 0}
!592 = !{!580, !573, i64 24}
!593 = !DILocation(line: 756, column: 9, scope: !458)
!594 = !DILocation(line: 757, column: 1, scope: !458)
!595 = distinct !DISubprogram(name: "parse_packet_identifier", scope: !3, file: !3, line: 631, type: !596, scopeLine: 633, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !599)
!596 = !DISubroutineType(types: !597)
!597 = !{!164, !598, !339}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!599 = !{!600, !601, !602, !603, !604, !613, !623, !681, !769, !770}
!600 = !DILocalVariable(name: "pctx", arg: 1, scope: !595, file: !3, line: 631, type: !598)
!601 = !DILocalVariable(name: "p_info", arg: 2, scope: !595, file: !3, line: 632, type: !339)
!602 = !DILocalVariable(name: "proto", scope: !595, file: !3, line: 634, type: !164)
!603 = !DILocalVariable(name: "err", scope: !595, file: !3, line: 634, type: !164)
!604 = !DILocalVariable(name: "eth", scope: !595, file: !3, line: 635, type: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !607, line: 168, size: 112, elements: !608)
!607 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!608 = !{!609, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !606, file: !607, line: 169, baseType: !610, size: 48)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !297)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !606, file: !607, line: 170, baseType: !610, size: 48, offset: 48)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !606, file: !607, line: 171, baseType: !129, size: 16, offset: 96)
!613 = !DILocalVariable(name: "proto_info", scope: !595, file: !3, line: 636, type: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "protocol_info", file: !3, line: 116, size: 128, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !614, file: !3, line: 117, baseType: !138, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid", scope: !614, file: !3, line: 118, baseType: !138, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pid_valid", scope: !614, file: !3, line: 119, baseType: !204, size: 8, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid_valid", scope: !614, file: !3, line: 120, baseType: !204, size: 8, offset: 72)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !614, file: !3, line: 121, baseType: !5, size: 8, offset: 80)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "event_reason", scope: !614, file: !3, line: 122, baseType: !13, size: 8, offset: 88)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "wait_first_edge", scope: !614, file: !3, line: 123, baseType: !204, size: 8, offset: 96)
!623 = !DILocalVariable(name: "iph_ptr", scope: !595, file: !3, line: 640, type: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !595, file: !3, line: 637, size: 64, elements: !625)
!625 = !{!626, !654}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "iph", scope: !624, file: !3, line: 638, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !629, line: 87, size: 160, elements: !630)
!629 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !641}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !628, file: !629, line: 89, baseType: !123, size: 4, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !628, file: !629, line: 90, baseType: !123, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !628, file: !629, line: 97, baseType: !123, size: 8, offset: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !628, file: !629, line: 98, baseType: !129, size: 16, offset: 16)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !628, file: !629, line: 99, baseType: !129, size: 16, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !628, file: !629, line: 100, baseType: !129, size: 16, offset: 48)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !628, file: !629, line: 101, baseType: !123, size: 8, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !628, file: !629, line: 102, baseType: !123, size: 8, offset: 72)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !628, file: !629, line: 103, baseType: !640, size: 16, offset: 80)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !130, line: 31, baseType: !131)
!641 = !DIDerivedType(tag: DW_TAG_member, scope: !628, file: !629, line: 104, baseType: !642, size: 64, offset: 96)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !629, line: 104, size: 64, elements: !643)
!643 = !{!644, !649}
!644 = !DIDerivedType(tag: DW_TAG_member, scope: !642, file: !629, line: 104, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !629, line: 104, size: 64, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !645, file: !629, line: 104, baseType: !137, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !645, file: !629, line: 104, baseType: !137, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !642, file: !629, line: 104, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !629, line: 104, size: 64, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !650, file: !629, line: 104, baseType: !137, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !650, file: !629, line: 104, baseType: !137, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ip6h", scope: !624, file: !3, line: 639, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !657, line: 118, size: 320, elements: !658)
!657 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "4f074a871dc410c98906d34687654389")
!658 = !{!659, !660, !661, !665, !666, !667, !668}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !656, file: !657, line: 120, baseType: !123, size: 4, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !656, file: !657, line: 121, baseType: !123, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !656, file: !657, line: 128, baseType: !662, size: 24, offset: 8)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 24, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 3)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !656, file: !657, line: 130, baseType: !129, size: 16, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !656, file: !657, line: 131, baseType: !123, size: 8, offset: 48)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !656, file: !657, line: 132, baseType: !123, size: 8, offset: 56)
!668 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !657, line: 134, baseType: !669, size: 256, offset: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !656, file: !657, line: 134, size: 256, elements: !670)
!670 = !{!671, !676}
!671 = !DIDerivedType(tag: DW_TAG_member, scope: !669, file: !657, line: 134, baseType: !672, size: 256)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !669, file: !657, line: 134, size: 256, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !672, file: !657, line: 134, baseType: !115, size: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !672, file: !657, line: 134, baseType: !115, size: 128, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !669, file: !657, line: 134, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !669, file: !657, line: 134, size: 256, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !677, file: !657, line: 134, baseType: !115, size: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !677, file: !657, line: 134, baseType: !115, size: 128, offset: 128)
!681 = !DILocalVariable(name: "transporth_ptr", scope: !595, file: !3, line: 645, type: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !595, file: !3, line: 641, size: 64, elements: !683)
!683 = !{!684, !706, !730}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tcph", scope: !682, file: !3, line: 642, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !687, line: 25, size: 160, elements: !688)
!687 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !686, file: !687, line: 26, baseType: !129, size: 16)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !686, file: !687, line: 27, baseType: !129, size: 16, offset: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !686, file: !687, line: 28, baseType: !137, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !686, file: !687, line: 29, baseType: !137, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !686, file: !687, line: 31, baseType: !131, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !686, file: !687, line: 32, baseType: !131, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !686, file: !687, line: 33, baseType: !131, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !686, file: !687, line: 34, baseType: !131, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !686, file: !687, line: 35, baseType: !131, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !686, file: !687, line: 36, baseType: !131, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !686, file: !687, line: 37, baseType: !131, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !686, file: !687, line: 38, baseType: !131, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !686, file: !687, line: 39, baseType: !131, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !686, file: !687, line: 40, baseType: !131, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !686, file: !687, line: 55, baseType: !129, size: 16, offset: 112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !686, file: !687, line: 56, baseType: !640, size: 16, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !686, file: !687, line: 57, baseType: !129, size: 16, offset: 144)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "icmph", scope: !682, file: !3, line: 643, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !709, line: 89, size: 64, elements: !710)
!709 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!710 = !{!711, !712, !713, !714}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !708, file: !709, line: 90, baseType: !123, size: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !708, file: !709, line: 91, baseType: !123, size: 8, offset: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !708, file: !709, line: 92, baseType: !640, size: 16, offset: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !708, file: !709, line: 104, baseType: !715, size: 32, offset: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !708, file: !709, line: 93, size: 32, elements: !716)
!716 = !{!717, !722, !723, !728}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !715, file: !709, line: 97, baseType: !718, size: 32)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !709, line: 94, size: 32, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !718, file: !709, line: 95, baseType: !129, size: 16)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !718, file: !709, line: 96, baseType: !129, size: 16, offset: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !715, file: !709, line: 98, baseType: !137, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !715, file: !709, line: 102, baseType: !724, size: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !709, line: 99, size: 32, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !724, file: !709, line: 100, baseType: !129, size: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !724, file: !709, line: 101, baseType: !129, size: 16, offset: 16)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !715, file: !709, line: 103, baseType: !729, size: 32)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 32, elements: !139)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6h", scope: !682, file: !3, line: 644, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !733, line: 8, size: 64, elements: !734)
!733 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!734 = !{!735, !736, !737, !738}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !732, file: !733, line: 10, baseType: !123, size: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !732, file: !733, line: 11, baseType: !123, size: 8, offset: 8)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !732, file: !733, line: 12, baseType: !640, size: 16, offset: 16)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !732, file: !733, line: 63, baseType: !739, size: 32, offset: 32)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !733, line: 15, size: 32, elements: !740)
!740 = !{!741, !743, !745, !746, !751, !759}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !739, file: !733, line: 16, baseType: !742, size: 32)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !165)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !739, file: !733, line: 17, baseType: !744, size: 32)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 32, elements: !285)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !739, file: !733, line: 18, baseType: !729, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !739, file: !733, line: 23, baseType: !747, size: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !733, line: 20, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !747, file: !733, line: 21, baseType: !129, size: 16)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !747, file: !733, line: 22, baseType: !129, size: 16, offset: 16)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !739, file: !733, line: 40, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !733, line: 25, size: 32, elements: !753)
!753 = !{!754, !755, !756, !757, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !752, file: !733, line: 27, baseType: !138, size: 5, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !752, file: !733, line: 28, baseType: !138, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !752, file: !733, line: 29, baseType: !138, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !752, file: !733, line: 30, baseType: !138, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !752, file: !733, line: 31, baseType: !138, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !739, file: !733, line: 61, baseType: !760, size: 32)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !733, line: 42, size: 32, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !760, file: !733, line: 43, baseType: !123, size: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !760, file: !733, line: 45, baseType: !123, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !760, file: !733, line: 46, baseType: !123, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !760, file: !733, line: 47, baseType: !123, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !760, file: !733, line: 48, baseType: !123, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !760, file: !733, line: 49, baseType: !123, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !760, file: !733, line: 60, baseType: !129, size: 16, offset: 16)
!769 = !DILocalVariable(name: "ecn", scope: !595, file: !3, line: 646, type: !123)
!770 = !DILabel(scope: !595, name: "err_not_ip", file: !3, line: 731)
!771 = !DILocation(line: 636, column: 23, scope: !595)
!772 = !DILocation(line: 0, scope: !595)
!773 = !DILocation(line: 649, column: 2, scope: !595)
!774 = !DILocation(line: 650, column: 17, scope: !595)
!775 = !DILocation(line: 650, column: 10, scope: !595)
!776 = !DILocation(line: 650, column: 15, scope: !595)
!777 = !{!778, !576, i64 0}
!778 = !{!"packet_info", !576, i64 0, !573, i64 8, !573, i64 12, !779, i64 16, !779, i64 64, !573, i64 112, !574, i64 116, !783, i64 120, !784, i64 122, !784, i64 123, !784, i64 124, !784, i64 125, !574, i64 126, !574, i64 127, !784, i64 128, !784, i64 129}
!779 = !{!"packet_id", !780, i64 0, !573, i64 44}
!780 = !{!"network_tuple", !781, i64 0, !781, i64 20, !783, i64 40, !574, i64 42, !574, i64 43}
!781 = !{!"flow_address", !782, i64 0, !783, i64 16, !783, i64 18}
!782 = !{!"in6_addr", !574, i64 0}
!783 = !{!"short", !574, i64 0}
!784 = !{!"_Bool", !574, i64 0}
!785 = !DILocation(line: 651, column: 26, scope: !595)
!786 = !DILocation(line: 651, column: 10, scope: !595)
!787 = !DILocation(line: 651, column: 18, scope: !595)
!788 = !{!778, !573, i64 8}
!789 = !DILocation(line: 652, column: 30, scope: !595)
!790 = !DILocation(line: 652, column: 40, scope: !595)
!791 = !DILocalVariable(name: "nh", arg: 1, scope: !792, file: !559, line: 131, type: !795)
!792 = distinct !DISubprogram(name: "parse_ethhdr", scope: !559, file: !559, line: 131, type: !793, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !797)
!793 = !DISubroutineType(types: !794)
!794 = !{!164, !795, !106, !796}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!797 = !{!791, !798, !799}
!798 = !DILocalVariable(name: "data_end", arg: 2, scope: !792, file: !559, line: 132, type: !106)
!799 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !792, file: !559, line: 133, type: !796)
!800 = !DILocation(line: 0, scope: !792, inlinedAt: !801)
!801 = distinct !DILocation(line: 652, column: 10, scope: !595)
!802 = !DILocalVariable(name: "nh", arg: 1, scope: !803, file: !559, line: 86, type: !795)
!803 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !559, file: !559, line: 86, type: !804, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !811)
!804 = !DISubroutineType(types: !805)
!805 = !{!164, !795, !106, !796, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !559, line: 71, size: 32, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !559, line: 72, baseType: !810, size: 32)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !285)
!811 = !{!802, !812, !813, !814, !815, !816, !817, !823, !824}
!812 = !DILocalVariable(name: "data_end", arg: 2, scope: !803, file: !559, line: 87, type: !106)
!813 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !803, file: !559, line: 88, type: !796)
!814 = !DILocalVariable(name: "vlans", arg: 4, scope: !803, file: !559, line: 89, type: !806)
!815 = !DILocalVariable(name: "eth", scope: !803, file: !559, line: 91, type: !605)
!816 = !DILocalVariable(name: "hdrsize", scope: !803, file: !559, line: 92, type: !164)
!817 = !DILocalVariable(name: "vlh", scope: !803, file: !559, line: 93, type: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !559, line: 44, size: 32, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !819, file: !559, line: 45, baseType: !129, size: 16)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !819, file: !559, line: 46, baseType: !129, size: 16, offset: 16)
!823 = !DILocalVariable(name: "h_proto", scope: !803, file: !559, line: 94, type: !131)
!824 = !DILocalVariable(name: "i", scope: !803, file: !559, line: 95, type: !164)
!825 = !DILocation(line: 0, scope: !803, inlinedAt: !826)
!826 = distinct !DILocation(line: 136, column: 9, scope: !792, inlinedAt: !801)
!827 = !DILocation(line: 91, column: 27, scope: !803, inlinedAt: !826)
!828 = !DILocation(line: 100, column: 14, scope: !829, inlinedAt: !826)
!829 = distinct !DILexicalBlock(scope: !803, file: !559, line: 100, column: 6)
!830 = !DILocation(line: 100, column: 24, scope: !829, inlinedAt: !826)
!831 = !DILocation(line: 100, column: 6, scope: !803, inlinedAt: !826)
!832 = !DILocation(line: 106, column: 17, scope: !803, inlinedAt: !826)
!833 = !{!783, !783, i64 0}
!834 = !DILocalVariable(name: "h_proto", arg: 1, scope: !835, file: !559, line: 75, type: !131)
!835 = distinct !DISubprogram(name: "proto_is_vlan", scope: !559, file: !559, line: 75, type: !836, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!164, !131}
!838 = !{!834}
!839 = !DILocation(line: 0, scope: !835, inlinedAt: !840)
!840 = distinct !DILocation(line: 113, column: 8, scope: !841, inlinedAt: !826)
!841 = distinct !DILexicalBlock(scope: !842, file: !559, line: 113, column: 7)
!842 = distinct !DILexicalBlock(scope: !843, file: !559, line: 112, column: 39)
!843 = distinct !DILexicalBlock(scope: !844, file: !559, line: 112, column: 2)
!844 = distinct !DILexicalBlock(scope: !803, file: !559, line: 112, column: 2)
!845 = !DILocation(line: 77, column: 20, scope: !835, inlinedAt: !840)
!846 = !DILocation(line: 77, column: 46, scope: !835, inlinedAt: !840)
!847 = !DILocation(line: 113, column: 8, scope: !841, inlinedAt: !826)
!848 = !DILocation(line: 113, column: 7, scope: !842, inlinedAt: !826)
!849 = !DILocation(line: 119, column: 18, scope: !842, inlinedAt: !826)
!850 = !DILocation(line: 127, column: 10, scope: !803, inlinedAt: !826)
!851 = !DILocation(line: 655, column: 6, scope: !595)
!852 = !DILocation(line: 656, column: 20, scope: !853)
!853 = distinct !DILexicalBlock(scope: !854, file: !3, line: 655, column: 36)
!854 = distinct !DILexicalBlock(scope: !595, file: !3, line: 655, column: 6)
!855 = !DILocation(line: 656, column: 24, scope: !853)
!856 = !{!778, !574, i64 58}
!857 = !DILocalVariable(name: "nh", arg: 1, scope: !858, file: !559, line: 196, type: !795)
!858 = distinct !DISubprogram(name: "parse_iphdr", scope: !559, file: !559, line: 196, type: !859, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !862)
!859 = !DISubroutineType(types: !860)
!860 = !{!164, !795, !106, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!862 = !{!857, !863, !864, !865, !866}
!863 = !DILocalVariable(name: "data_end", arg: 2, scope: !858, file: !559, line: 197, type: !106)
!864 = !DILocalVariable(name: "iphdr", arg: 3, scope: !858, file: !559, line: 198, type: !861)
!865 = !DILocalVariable(name: "iph", scope: !858, file: !559, line: 200, type: !627)
!866 = !DILocalVariable(name: "hdrsize", scope: !858, file: !559, line: 201, type: !164)
!867 = !DILocation(line: 0, scope: !858, inlinedAt: !868)
!868 = distinct !DILocation(line: 657, column: 11, scope: !853)
!869 = !DILocation(line: 203, column: 10, scope: !870, inlinedAt: !868)
!870 = distinct !DILexicalBlock(scope: !858, file: !559, line: 203, column: 6)
!871 = !DILocation(line: 203, column: 14, scope: !870, inlinedAt: !868)
!872 = !DILocation(line: 203, column: 6, scope: !858, inlinedAt: !868)
!873 = !DILocation(line: 206, column: 11, scope: !874, inlinedAt: !868)
!874 = distinct !DILexicalBlock(scope: !858, file: !559, line: 206, column: 6)
!875 = !DILocation(line: 206, column: 19, scope: !874, inlinedAt: !868)
!876 = !DILocation(line: 206, column: 6, scope: !858, inlinedAt: !868)
!877 = !DILocation(line: 209, column: 21, scope: !858, inlinedAt: !868)
!878 = !DILocation(line: 211, column: 13, scope: !879, inlinedAt: !868)
!879 = distinct !DILexicalBlock(scope: !858, file: !559, line: 211, column: 5)
!880 = !DILocation(line: 211, column: 5, scope: !858, inlinedAt: !868)
!881 = !DILocation(line: 215, column: 14, scope: !882, inlinedAt: !868)
!882 = distinct !DILexicalBlock(scope: !858, file: !559, line: 215, column: 6)
!883 = !DILocation(line: 215, column: 24, scope: !882, inlinedAt: !868)
!884 = !DILocation(line: 215, column: 6, scope: !858, inlinedAt: !868)
!885 = !DILocation(line: 659, column: 20, scope: !886)
!886 = distinct !DILexicalBlock(scope: !887, file: !3, line: 658, column: 45)
!887 = distinct !DILexicalBlock(scope: !854, file: !3, line: 658, column: 13)
!888 = !DILocation(line: 659, column: 24, scope: !886)
!889 = !DILocalVariable(name: "nh", arg: 1, scope: !890, file: !559, line: 174, type: !795)
!890 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !559, file: !559, line: 174, type: !891, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !894)
!891 = !DISubroutineType(types: !892)
!892 = !{!164, !795, !106, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!894 = !{!889, !895, !896, !897}
!895 = !DILocalVariable(name: "data_end", arg: 2, scope: !890, file: !559, line: 175, type: !106)
!896 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !890, file: !559, line: 176, type: !893)
!897 = !DILocalVariable(name: "ip6h", scope: !890, file: !559, line: 178, type: !655)
!898 = !DILocation(line: 0, scope: !890, inlinedAt: !899)
!899 = distinct !DILocation(line: 660, column: 11, scope: !886)
!900 = !DILocation(line: 184, column: 11, scope: !901, inlinedAt: !899)
!901 = distinct !DILexicalBlock(scope: !890, file: !559, line: 184, column: 6)
!902 = !DILocation(line: 184, column: 15, scope: !901, inlinedAt: !899)
!903 = !DILocation(line: 184, column: 6, scope: !890, inlinedAt: !899)
!904 = !DILocation(line: 187, column: 12, scope: !905, inlinedAt: !899)
!905 = distinct !DILexicalBlock(scope: !890, file: !559, line: 187, column: 6)
!906 = !DILocation(line: 187, column: 20, scope: !905, inlinedAt: !899)
!907 = !DILocation(line: 187, column: 6, scope: !890, inlinedAt: !899)
!908 = !DILocation(line: 190, column: 10, scope: !890, inlinedAt: !899)
!909 = !DILocation(line: 193, column: 44, scope: !890, inlinedAt: !899)
!910 = !{!911, !574, i64 6}
!911 = !{!"ipv6hdr", !574, i64 0, !574, i64 0, !574, i64 1, !783, i64 4, !574, i64 6, !574, i64 7, !574, i64 8}
!912 = !DILocalVariable(name: "nh", arg: 1, scope: !913, file: !559, line: 139, type: !795)
!913 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !559, file: !559, line: 139, type: !914, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{!164, !795, !106, !123}
!916 = !{!912, !917, !918, !919, !921}
!917 = !DILocalVariable(name: "data_end", arg: 2, scope: !913, file: !559, line: 140, type: !106)
!918 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !913, file: !559, line: 141, type: !123)
!919 = !DILocalVariable(name: "i", scope: !920, file: !559, line: 143, type: !164)
!920 = distinct !DILexicalBlock(scope: !913, file: !559, line: 143, column: 2)
!921 = !DILocalVariable(name: "hdr", scope: !922, file: !559, line: 144, type: !924)
!922 = distinct !DILexicalBlock(scope: !923, file: !559, line: 143, column: 47)
!923 = distinct !DILexicalBlock(scope: !920, file: !559, line: 143, column: 2)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !657, line: 63, size: 16, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !925, file: !657, line: 64, baseType: !123, size: 8)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !925, file: !657, line: 65, baseType: !123, size: 8, offset: 8)
!929 = !DILocation(line: 0, scope: !913, inlinedAt: !930)
!930 = distinct !DILocation(line: 193, column: 9, scope: !890, inlinedAt: !899)
!931 = !DILocation(line: 0, scope: !920, inlinedAt: !930)
!932 = !DILocation(line: 0, scope: !922, inlinedAt: !930)
!933 = !DILocation(line: 146, column: 11, scope: !934, inlinedAt: !930)
!934 = distinct !DILexicalBlock(scope: !922, file: !559, line: 146, column: 7)
!935 = !DILocation(line: 146, column: 15, scope: !934, inlinedAt: !930)
!936 = !DILocation(line: 146, column: 7, scope: !922, inlinedAt: !930)
!937 = !DILocation(line: 149, column: 3, scope: !922, inlinedAt: !930)
!938 = !DILocation(line: 160, column: 4, scope: !939, inlinedAt: !930)
!939 = distinct !DILexicalBlock(scope: !922, file: !559, line: 149, column: 26)
!940 = !DILocation(line: 0, scope: !939, inlinedAt: !930)
!941 = !{!942, !574, i64 1}
!942 = !{!"ipv6_opt_hdr", !574, i64 0, !574, i64 1}
!943 = !{!942, !574, i64 0}
!944 = !DILocation(line: 156, column: 4, scope: !939, inlinedAt: !930)
!945 = !DILocation(line: 218, column: 10, scope: !858, inlinedAt: !868)
!946 = !DILocation(line: 221, column: 14, scope: !858, inlinedAt: !868)
!947 = !{!948, !574, i64 9}
!948 = !{!"iphdr", !574, i64 0, !574, i64 0, !574, i64 1, !783, i64 2, !783, i64 4, !783, i64 6, !574, i64 8, !574, i64 9, !783, i64 10, !574, i64 12}
!949 = !DILocation(line: 668, column: 27, scope: !595)
!950 = !DILocation(line: 668, column: 10, scope: !595)
!951 = !DILocation(line: 668, column: 19, scope: !595)
!952 = !DILocation(line: 668, column: 25, scope: !595)
!953 = !{!778, !783, i64 56}
!954 = !DILocation(line: 671, column: 19, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 669, column: 39)
!956 = distinct !DILexicalBlock(scope: !595, file: !3, line: 669, column: 6)
!957 = !{!574, !574, i64 0}
!958 = !DILocalVariable(name: "ipv6", arg: 1, scope: !959, file: !3, line: 212, type: !155)
!959 = distinct !DISubprogram(name: "map_ipv4_to_ipv6", scope: !3, file: !3, line: 212, type: !960, scopeLine: 213, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !962)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !155, !137}
!962 = !{!958, !963}
!963 = !DILocalVariable(name: "ipv4", arg: 2, scope: !959, file: !3, line: 212, type: !137)
!964 = !DILocation(line: 0, scope: !959, inlinedAt: !965)
!965 = distinct !DILocation(line: 670, column: 3, scope: !955)
!966 = !DILocation(line: 214, column: 32, scope: !959, inlinedAt: !965)
!967 = !DILocation(line: 214, column: 20, scope: !959, inlinedAt: !965)
!968 = !DILocation(line: 214, column: 2, scope: !959, inlinedAt: !965)
!969 = !DILocation(line: 215, column: 20, scope: !959, inlinedAt: !965)
!970 = !DILocation(line: 215, column: 2, scope: !959, inlinedAt: !965)
!971 = !DILocation(line: 216, column: 2, scope: !959, inlinedAt: !965)
!972 = !DILocation(line: 216, column: 27, scope: !959, inlinedAt: !965)
!973 = !DILocation(line: 672, column: 44, scope: !955)
!974 = !DILocation(line: 673, column: 19, scope: !955)
!975 = !DILocation(line: 0, scope: !959, inlinedAt: !976)
!976 = distinct !DILocation(line: 672, column: 3, scope: !955)
!977 = !DILocation(line: 214, column: 32, scope: !959, inlinedAt: !976)
!978 = !DILocation(line: 214, column: 20, scope: !959, inlinedAt: !976)
!979 = !DILocation(line: 214, column: 2, scope: !959, inlinedAt: !976)
!980 = !DILocation(line: 215, column: 20, scope: !959, inlinedAt: !976)
!981 = !DILocation(line: 215, column: 2, scope: !959, inlinedAt: !976)
!982 = !DILocation(line: 216, column: 2, scope: !959, inlinedAt: !976)
!983 = !DILocation(line: 216, column: 27, scope: !959, inlinedAt: !976)
!984 = !DILocation(line: 674, column: 20, scope: !955)
!985 = !{!948, !783, i64 2}
!986 = !DILocation(line: 674, column: 11, scope: !955)
!987 = !DILocation(line: 674, column: 18, scope: !955)
!988 = !{!778, !783, i64 120}
!989 = !DILocation(line: 675, column: 42, scope: !955)
!990 = !{!948, !574, i64 1}
!991 = !DILocation(line: 675, column: 11, scope: !955)
!992 = !DILocation(line: 675, column: 18, scope: !955)
!993 = !DILocation(line: 675, column: 27, scope: !955)
!994 = !DILocalVariable(name: "iph", arg: 1, scope: !995, file: !3, line: 408, type: !627)
!995 = distinct !DISubprogram(name: "parse_ip_ecn", scope: !3, file: !3, line: 408, type: !996, scopeLine: 409, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{!123, !627}
!998 = !{!994}
!999 = !DILocation(line: 0, scope: !995, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 676, column: 9, scope: !955)
!1001 = !DILocation(line: 410, column: 14, scope: !995, inlinedAt: !1000)
!1002 = !DILocation(line: 677, column: 2, scope: !955)
!1003 = !DILocation(line: 678, column: 45, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !956, file: !3, line: 677, column: 9)
!1005 = !{i64 0, i64 16, !957, i64 0, i64 16, !957, i64 0, i64 16, !957}
!1006 = !DILocation(line: 679, column: 26, scope: !1004)
!1007 = !DILocation(line: 679, column: 45, scope: !1004)
!1008 = !DILocation(line: 680, column: 20, scope: !1004)
!1009 = !{!911, !783, i64 4}
!1010 = !DILocation(line: 680, column: 11, scope: !1004)
!1011 = !DILocation(line: 680, column: 18, scope: !1004)
!1012 = !DILocation(line: 682, column: 23, scope: !1004)
!1013 = !DILocation(line: 682, column: 4, scope: !1004)
!1014 = !{!573, !573, i64 0}
!1015 = !DILocation(line: 682, column: 28, scope: !1004)
!1016 = !DILocation(line: 681, column: 18, scope: !1004)
!1017 = !DILocation(line: 681, column: 27, scope: !1004)
!1018 = !DILocalVariable(name: "iph6", arg: 1, scope: !1019, file: !3, line: 413, type: !655)
!1019 = distinct !DISubprogram(name: "parse_ipv6_ecn", scope: !3, file: !3, line: 413, type: !1020, scopeLine: 414, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1022)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!123, !655}
!1022 = !{!1018}
!1023 = !DILocation(line: 0, scope: !1019, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 683, column: 9, scope: !1004)
!1025 = !DILocation(line: 415, column: 10, scope: !1019, inlinedAt: !1024)
!1026 = !DILocation(line: 415, column: 28, scope: !1019, inlinedAt: !1024)
!1027 = !DILocation(line: 668, column: 14, scope: !595)
!1028 = !DILocation(line: 669, column: 23, scope: !956)
!1029 = !DILocation(line: 0, scope: !956)
!1030 = !DILocation(line: 685, column: 2, scope: !595)
!1031 = !DILocation(line: 689, column: 13, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !595, file: !3, line: 689, column: 6)
!1033 = !{!1034, !784, i64 29}
!1034 = !{!"bpf_config", !576, i64 0, !576, i64 8, !576, i64 16, !573, i64 24, !784, i64 28, !784, i64 29, !784, i64 30, !784, i64 31, !784, i64 32, !784, i64 33, !784, i64 34, !784, i64 35}
!1035 = !{i8 0, i8 2}
!1036 = !DILocation(line: 689, column: 23, scope: !1032)
!1037 = !DILocation(line: 691, column: 33, scope: !1032)
!1038 = !DILocation(line: 692, column: 33, scope: !1032)
!1039 = !DILocalVariable(name: "pctx", arg: 1, scope: !1040, file: !3, line: 483, type: !598)
!1040 = distinct !DISubprogram(name: "parse_tcp_identifier", scope: !3, file: !3, line: 483, type: !1041, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1046)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!164, !598, !1043, !1044, !1044, !1045}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!1046 = !{!1039, !1047, !1048, !1049, !1050, !1051}
!1047 = !DILocalVariable(name: "tcph", arg: 2, scope: !1040, file: !3, line: 484, type: !1043)
!1048 = !DILocalVariable(name: "sport", arg: 3, scope: !1040, file: !3, line: 484, type: !1044)
!1049 = !DILocalVariable(name: "dport", arg: 4, scope: !1040, file: !3, line: 485, type: !1044)
!1050 = !DILocalVariable(name: "proto_info", arg: 5, scope: !1040, file: !3, line: 485, type: !1045)
!1051 = !DILocalVariable(name: "hdr", scope: !1040, file: !3, line: 487, type: !685)
!1052 = !DILocation(line: 0, scope: !1040, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 690, column: 9, scope: !1032)
!1054 = !DILocation(line: 488, column: 36, scope: !1055, inlinedAt: !1053)
!1055 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 488, column: 6)
!1056 = !DILocalVariable(name: "nh", arg: 1, scope: !1057, file: !559, line: 295, type: !795)
!1057 = distinct !DISubprogram(name: "parse_tcphdr", scope: !559, file: !559, line: 295, type: !1058, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!164, !795, !106, !1043}
!1060 = !{!1056, !1061, !1062, !1063, !1064}
!1061 = !DILocalVariable(name: "data_end", arg: 2, scope: !1057, file: !559, line: 296, type: !106)
!1062 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !1057, file: !559, line: 297, type: !1043)
!1063 = !DILocalVariable(name: "len", scope: !1057, file: !559, line: 299, type: !164)
!1064 = !DILocalVariable(name: "h", scope: !1057, file: !559, line: 300, type: !685)
!1065 = !DILocation(line: 0, scope: !1057, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 488, column: 6, scope: !1055, inlinedAt: !1053)
!1067 = !DILocation(line: 300, column: 25, scope: !1057, inlinedAt: !1066)
!1068 = !DILocation(line: 302, column: 8, scope: !1069, inlinedAt: !1066)
!1069 = distinct !DILexicalBlock(scope: !1057, file: !559, line: 302, column: 6)
!1070 = !DILocation(line: 302, column: 12, scope: !1069, inlinedAt: !1066)
!1071 = !DILocation(line: 302, column: 6, scope: !1057, inlinedAt: !1066)
!1072 = !DILocation(line: 305, column: 11, scope: !1057, inlinedAt: !1066)
!1073 = !DILocation(line: 305, column: 16, scope: !1057, inlinedAt: !1066)
!1074 = !DILocation(line: 307, column: 9, scope: !1075, inlinedAt: !1066)
!1075 = distinct !DILexicalBlock(scope: !1057, file: !559, line: 307, column: 5)
!1076 = !DILocation(line: 307, column: 5, scope: !1057, inlinedAt: !1066)
!1077 = !DILocation(line: 311, column: 14, scope: !1078, inlinedAt: !1066)
!1078 = distinct !DILexicalBlock(scope: !1057, file: !559, line: 311, column: 6)
!1079 = !DILocation(line: 311, column: 20, scope: !1078, inlinedAt: !1066)
!1080 = !DILocation(line: 311, column: 6, scope: !1057, inlinedAt: !1066)
!1081 = !DILocation(line: 314, column: 10, scope: !1057, inlinedAt: !1066)
!1082 = !DILocation(line: 491, column: 13, scope: !1083, inlinedAt: !1053)
!1083 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 491, column: 6)
!1084 = !{!1034, !784, i64 32}
!1085 = !DILocation(line: 491, column: 22, scope: !1083, inlinedAt: !1053)
!1086 = !DILocalVariable(name: "tcph", arg: 1, scope: !1087, file: !3, line: 424, type: !685)
!1087 = distinct !DISubprogram(name: "parse_tcp_ts", scope: !3, file: !3, line: 424, type: !1088, scopeLine: 426, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1090)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!164, !685, !106, !151, !151}
!1090 = !{!1086, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1091 = !DILocalVariable(name: "data_end", arg: 2, scope: !1087, file: !3, line: 424, type: !106)
!1092 = !DILocalVariable(name: "tsval", arg: 3, scope: !1087, file: !3, line: 424, type: !151)
!1093 = !DILocalVariable(name: "tsecr", arg: 4, scope: !1087, file: !3, line: 425, type: !151)
!1094 = !DILocalVariable(name: "len", scope: !1087, file: !3, line: 427, type: !164)
!1095 = !DILocalVariable(name: "opt_end", scope: !1087, file: !3, line: 428, type: !106)
!1096 = !DILocalVariable(name: "pos", scope: !1087, file: !3, line: 429, type: !150)
!1097 = !DILocalVariable(name: "i", scope: !1087, file: !3, line: 430, type: !123)
!1098 = !DILocalVariable(name: "opt", scope: !1087, file: !3, line: 430, type: !123)
!1099 = !DILocalVariable(name: "opt_size", scope: !1087, file: !3, line: 432, type: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !123)
!1101 = !DILocation(line: 0, scope: !1087, inlinedAt: !1102)
!1102 = distinct !DILocation(line: 494, column: 6, scope: !1103, inlinedAt: !1053)
!1103 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 494, column: 6)
!1104 = !DILocation(line: 427, column: 23, scope: !1087, inlinedAt: !1102)
!1105 = !DILocation(line: 428, column: 31, scope: !1087, inlinedAt: !1102)
!1106 = !DILocation(line: 431, column: 2, scope: !1087, inlinedAt: !1102)
!1107 = !DILocation(line: 432, column: 3, scope: !1087, inlinedAt: !1102)
!1108 = !DILocation(line: 434, column: 26, scope: !1109, inlinedAt: !1102)
!1109 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 434, column: 6)
!1110 = !DILocation(line: 438, column: 11, scope: !1111, inlinedAt: !1102)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 438, column: 7)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 437, column: 40)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 437, column: 2)
!1114 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 437, column: 2)
!1115 = !DILocation(line: 438, column: 15, scope: !1111, inlinedAt: !1102)
!1116 = !DILocation(line: 438, column: 25, scope: !1111, inlinedAt: !1102)
!1117 = !DILocation(line: 441, column: 9, scope: !1112, inlinedAt: !1102)
