; ModuleID = 'nat64_kern.c'
source_filename = "nat64_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.nat64_config = type { %struct.in6_addr, i64, i64, i32, i32 }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.anon.4 = type { [1 x i32]*, %struct.in6_addr*, %struct.v6_addr_state*, [1 x i32]*, [1 x i32]* }
%struct.v6_addr_state = type { i64, i32, i32 }
%struct.anon.5 = type { [1 x i32]*, i32*, %struct.in6_addr*, [1 x i32]*, [1 x i32]* }
%struct.anon.6 = type { [11 x i32]*, [16 x i32]*, [4 x i32]*, [1 x i32]*, [1 x i32]* }
%struct.anon.7 = type { [22 x i32]*, [0 x i32]*, [4 x i32]*, [1 x i32]* }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon.11 }
%union.anon.11 = type { %struct.anon.12 }
%struct.anon.12 = type { i32, i32 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32, i32 }

!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 397, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "BPF_ANY", value: 0)
!15 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!16 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!17 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 28, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!21 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!22 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!23 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!24 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!25 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!26 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!27 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!28 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!29 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!30 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!31 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!32 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!33 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!34 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!35 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!36 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!37 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!38 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!39 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!40 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!41 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!42 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!43 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!44 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!45 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!46 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!47 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!48 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4033, baseType: !7, size: 32, elements: !50)
!50 = !{!51}
!51 = !DIEnumerator(name: "BPF_F_INGRESS", value: 1)
!52 = !{!53, !54, !55, !58, !59, !62, !63, !64, !66}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !56, line: 24, baseType: !57)
!56 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !56, line: 27, baseType: !7)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !61, line: 27, baseType: !58)
!61 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !56, line: 31, baseType: !54)
!68 = !{!0, !69, !100, !121, !130, !147, !163, !171, !179, !276, !281, !295, !300, !305, !310, !315, !320, !325}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 16, type: !71, isLocal: false, isDefinition: true)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nat64_config", file: !72, line: 6, size: 320, elements: !73)
!72 = !DIFile(filename: "./nat64.h", directory: "/home/nir_ophir/code/bpf-examples/nat64-bpf", checksumkind: CSK_MD5, checksum: "2017d4b75cfd9fec767e31bfa7ae6bde")
!73 = !{!74, !96, !97, !98, !99}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "v6_prefix", scope: !71, file: !72, line: 7, baseType: !75, size: 128)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !76, line: 33, size: 128, elements: !77)
!76 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !75, file: !76, line: 40, baseType: !79, size: 128)
!79 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !75, file: !76, line: 34, size: 128, elements: !80)
!80 = !{!81, !87, !92}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !79, file: !76, line: 35, baseType: !82, size: 128)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !85)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !56, line: 21, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !79, file: !76, line: 37, baseType: !88, size: 128)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !90)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !61, line: 25, baseType: !55)
!90 = !{!91}
!91 = !DISubrange(count: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !79, file: !76, line: 38, baseType: !93, size: 128)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_ns", scope: !71, file: !72, line: 8, baseType: !67, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !71, file: !72, line: 9, baseType: !67, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "v4_prefix", scope: !71, file: !72, line: 10, baseType: !58, size: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "v4_mask", scope: !71, file: !72, line: 11, baseType: !58, size: 32, offset: 288)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "v6_state_map", scope: !2, file: !3, line: 24, type: !102, isLocal: false, isDefinition: true)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 18, size: 320, elements: !103)
!103 = !{!104, !110, !112, !119, !120}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !3, line: 19, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 32, elements: !108)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109}
!109 = !DISubrange(count: 1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !102, file: !3, line: 20, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !102, file: !3, line: 21, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v6_addr_state", file: !72, line: 14, size: 128, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "last_seen", scope: !114, file: !72, line: 15, baseType: !67, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "v4_addr", scope: !114, file: !72, line: 16, baseType: !58, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "static_conf", scope: !114, file: !72, line: 17, baseType: !58, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !102, file: !3, line: 22, baseType: !105, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !102, file: !3, line: 23, baseType: !105, size: 64, offset: 256)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "v4_reversemap", scope: !2, file: !3, line: 32, type: !123, isLocal: false, isDefinition: true)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 320, elements: !124)
!124 = !{!125, !126, !127, !128, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !3, line: 27, baseType: !105, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !123, file: !3, line: 28, baseType: !63, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !123, file: !3, line: 29, baseType: !111, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !123, file: !3, line: 30, baseType: !105, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !123, file: !3, line: 31, baseType: !105, size: 64, offset: 256)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "allowed_v6_src", scope: !2, file: !3, line: 40, type: !132, isLocal: false, isDefinition: true)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 34, size: 320, elements: !133)
!133 = !{!134, !139, !142, !145, !146}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !3, line: 35, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 352, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 11)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !132, file: !3, line: 36, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 512, elements: !85)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !132, file: !3, line: 37, baseType: !143, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !94)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !132, file: !3, line: 38, baseType: !105, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !132, file: !3, line: 39, baseType: !105, size: 64, offset: 256)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "reclaimed_addrs", scope: !2, file: !3, line: 47, type: !149, isLocal: false, isDefinition: true)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 256, elements: !150)
!150 = !{!151, !156, !161, !162}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !3, line: 43, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 704, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 22)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !149, file: !3, line: 44, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !149, file: !3, line: 45, baseType: !143, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !149, file: !3, line: 46, baseType: !105, size: 64, offset: 192)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !165, line: 55, type: !166, isLocal: true, isDefinition: true)
!165 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/nir_ophir/code/bpf-examples/nat64-bpf", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!53, !53, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !165, line: 790, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !59, !58, !59, !58, !178}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !56, line: 30, baseType: !177)
!177 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !61, line: 32, baseType: !58)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "bpf_l4_csum_replace", scope: !2, file: !165, line: 291, type: !181, isLocal: true, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !185, !58, !67, !67, !67}
!184 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 4183, size: 1472, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !217, !218, !250, !251, !252, !253, !275}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !186, file: !6, line: 4184, baseType: !58, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !186, file: !6, line: 4185, baseType: !58, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !186, file: !6, line: 4186, baseType: !58, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !186, file: !6, line: 4187, baseType: !58, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !186, file: !6, line: 4188, baseType: !58, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !186, file: !6, line: 4189, baseType: !58, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !186, file: !6, line: 4190, baseType: !58, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !186, file: !6, line: 4191, baseType: !58, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !186, file: !6, line: 4192, baseType: !58, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !186, file: !6, line: 4193, baseType: !58, size: 32, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !186, file: !6, line: 4194, baseType: !58, size: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !186, file: !6, line: 4195, baseType: !58, size: 32, offset: 352)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !186, file: !6, line: 4196, baseType: !201, size: 160, offset: 384)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 5)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !186, file: !6, line: 4197, baseType: !58, size: 32, offset: 544)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !186, file: !6, line: 4198, baseType: !58, size: 32, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !6, line: 4199, baseType: !58, size: 32, offset: 608)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !186, file: !6, line: 4200, baseType: !58, size: 32, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !186, file: !6, line: 4201, baseType: !58, size: 32, offset: 672)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !186, file: !6, line: 4204, baseType: !58, size: 32, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !186, file: !6, line: 4205, baseType: !58, size: 32, offset: 736)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !186, file: !6, line: 4206, baseType: !58, size: 32, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !186, file: !6, line: 4207, baseType: !213, size: 128, offset: 800)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !94)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !186, file: !6, line: 4208, baseType: !213, size: 128, offset: 928)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !186, file: !6, line: 4209, baseType: !58, size: 32, offset: 1056)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !186, file: !6, line: 4210, baseType: !58, size: 32, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !186, file: !6, line: 4213, baseType: !58, size: 32, offset: 1120)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !186, file: !6, line: 4214, baseType: !219, size: 64, align: 64, offset: 1152)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !6, line: 4214, size: 64, align: 64, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !219, file: !6, line: 4214, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !6, line: 5041, size: 448, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !248, !249}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !223, file: !6, line: 5042, baseType: !55, size: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !223, file: !6, line: 5043, baseType: !55, size: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !223, file: !6, line: 5044, baseType: !55, size: 16, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !223, file: !6, line: 5045, baseType: !83, size: 8, offset: 48)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !223, file: !6, line: 5046, baseType: !83, size: 8, offset: 56)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !223, file: !6, line: 5047, baseType: !83, size: 8, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !223, file: !6, line: 5048, baseType: !83, size: 8, offset: 72)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !223, file: !6, line: 5049, baseType: !89, size: 16, offset: 80)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !223, file: !6, line: 5050, baseType: !89, size: 16, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !223, file: !6, line: 5051, baseType: !89, size: 16, offset: 112)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !6, line: 5052, baseType: !236, size: 256, offset: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !6, line: 5052, size: 256, elements: !237)
!237 = !{!238, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !6, line: 5053, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !236, file: !6, line: 5053, size: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !239, file: !6, line: 5054, baseType: !60, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !239, file: !6, line: 5055, baseType: !60, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !6, line: 5057, baseType: !244, size: 256)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !236, file: !6, line: 5057, size: 256, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !244, file: !6, line: 5058, baseType: !213, size: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !244, file: !6, line: 5059, baseType: !213, size: 128, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !6, line: 5062, baseType: !58, size: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !223, file: !6, line: 5063, baseType: !60, size: 32, offset: 416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !186, file: !6, line: 4215, baseType: !67, size: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !186, file: !6, line: 4216, baseType: !58, size: 32, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !186, file: !6, line: 4217, baseType: !58, size: 32, offset: 1312)
!253 = !DIDerivedType(tag: DW_TAG_member, scope: !186, file: !6, line: 4218, baseType: !254, size: 64, align: 64, offset: 1344)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !6, line: 4218, size: 64, align: 64, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !254, file: !6, line: 4218, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 4272, size: 640, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !258, file: !6, line: 4273, baseType: !58, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !258, file: !6, line: 4274, baseType: !58, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !6, line: 4275, baseType: !58, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !258, file: !6, line: 4276, baseType: !58, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !258, file: !6, line: 4277, baseType: !58, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !258, file: !6, line: 4278, baseType: !58, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !258, file: !6, line: 4280, baseType: !58, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !258, file: !6, line: 4281, baseType: !213, size: 128, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !258, file: !6, line: 4282, baseType: !58, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !258, file: !6, line: 4283, baseType: !58, size: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !258, file: !6, line: 4284, baseType: !58, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !258, file: !6, line: 4285, baseType: !213, size: 128, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !258, file: !6, line: 4286, baseType: !58, size: 32, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !258, file: !6, line: 4287, baseType: !274, size: 32, offset: 608)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !56, line: 26, baseType: !107)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !186, file: !6, line: 4219, baseType: !58, size: 32, offset: 1408)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "bpf_skb_change_proto", scope: !2, file: !165, line: 857, type: !278, isLocal: true, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!184, !185, !89, !67}
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "bpf_redirect_neigh", scope: !2, file: !165, line: 3621, type: !283, isLocal: true, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!184, !58, !286, !107, !67}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_redir_neigh", file: !6, line: 5016, size: 160, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nh_family", scope: !287, file: !6, line: 5018, baseType: !58, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !6, line: 5020, baseType: !291, size: 128, offset: 32)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !6, line: 5020, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_nh", scope: !291, file: !6, line: 5021, baseType: !60, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_nh", scope: !291, file: !6, line: 5022, baseType: !213, size: 128)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "bpf_map_pop_elem", scope: !2, file: !165, line: 2271, type: !297, isLocal: true, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!184, !53, !53}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "bpf_for_each_map_elem", scope: !2, file: !165, line: 3892, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!184, !53, !53, !53, !67}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !165, line: 87, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!184, !53, !169}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "bpf_map_push_elem", scope: !2, file: !165, line: 2261, type: !312, isLocal: true, isDefinition: true)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!184, !53, !169, !67}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !165, line: 113, type: !317, isLocal: true, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!67}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !165, line: 77, type: !322, isLocal: true, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!184, !53, !169, !169, !67}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !165, line: 615, type: !327, isLocal: true, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!184, !58, !67}
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32, elements: !94)
!331 = !{i32 7, !"Dwarf Version", i32 5}
!332 = !{i32 2, !"Debug Info Version", i32 3}
!333 = !{i32 1, !"wchar_size", i32 4}
!334 = !{i32 7, !"frame-pointer", i32 2}
!335 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!336 = distinct !DISubprogram(name: "nat64_egress", scope: !3, file: !3, line: 713, type: !337, scopeLine: 714, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{!107, !185}
!339 = !{!340}
!340 = !DILocalVariable(name: "skb", arg: 1, scope: !336, file: !3, line: 713, type: !185)
!341 = !DILocation(line: 0, scope: !336)
!342 = !DILocation(line: 715, column: 16, scope: !336)
!343 = !DILocation(line: 715, column: 9, scope: !336)
!344 = distinct !DISubprogram(name: "nat64_handler", scope: !3, file: !3, line: 695, type: !345, scopeLine: 696, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!345 = !DISubroutineType(types: !346)
!346 = !{!107, !185, !347}
!347 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!348 = !{!349, !350, !351, !352, !353, !358, !369}
!349 = !DILocalVariable(name: "skb", arg: 1, scope: !344, file: !3, line: 695, type: !185)
!350 = !DILocalVariable(name: "egress", arg: 2, scope: !344, file: !3, line: 695, type: !347)
!351 = !DILocalVariable(name: "data_end", scope: !344, file: !3, line: 697, type: !53)
!352 = !DILocalVariable(name: "data", scope: !344, file: !3, line: 698, type: !53)
!353 = !DILocalVariable(name: "nh", scope: !344, file: !3, line: 699, type: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !355, line: 35, size: 64, elements: !356)
!355 = !DIFile(filename: "./../include/xdp/parsing_helpers.h", directory: "/home/nir_ophir/code/bpf-examples/nat64-bpf", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !354, file: !355, line: 36, baseType: !53, size: 64)
!358 = !DILocalVariable(name: "eth", scope: !344, file: !3, line: 700, type: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !361, line: 168, size: 112, elements: !362)
!361 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!362 = !{!363, !367, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !360, file: !361, line: 169, baseType: !364, size: 48)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 6)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !360, file: !361, line: 170, baseType: !364, size: 48, offset: 48)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !360, file: !361, line: 171, baseType: !89, size: 16, offset: 96)
!369 = !DILocalVariable(name: "eth_type", scope: !344, file: !3, line: 701, type: !107)
!370 = !DILocation(line: 0, scope: !344)
!371 = !DILocation(line: 697, column: 52, scope: !344)
!372 = !{!373, !374, i64 80}
!373 = !{!"__sk_buff", !374, i64 0, !374, i64 4, !374, i64 8, !374, i64 12, !374, i64 16, !374, i64 20, !374, i64 24, !374, i64 28, !374, i64 32, !374, i64 36, !374, i64 40, !374, i64 44, !375, i64 48, !374, i64 68, !374, i64 72, !374, i64 76, !374, i64 80, !374, i64 84, !374, i64 88, !374, i64 92, !374, i64 96, !375, i64 100, !375, i64 116, !374, i64 132, !374, i64 136, !374, i64 140, !375, i64 144, !377, i64 152, !374, i64 160, !374, i64 164, !375, i64 168, !374, i64 176}
!374 = !{!"int", !375, i64 0}
!375 = !{!"omnipotent char", !376, i64 0}
!376 = !{!"Simple C/C++ TBAA"}
!377 = !{!"long long", !375, i64 0}
!378 = !DILocation(line: 697, column: 27, scope: !344)
!379 = !DILocation(line: 697, column: 19, scope: !344)
!380 = !DILocation(line: 698, column: 48, scope: !344)
!381 = !{!373, !374, i64 76}
!382 = !DILocation(line: 698, column: 23, scope: !344)
!383 = !DILocation(line: 698, column: 15, scope: !344)
!384 = !DILocalVariable(name: "nh", arg: 1, scope: !385, file: !355, line: 131, type: !388)
!385 = distinct !DISubprogram(name: "parse_ethhdr", scope: !355, file: !355, line: 131, type: !386, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !390)
!386 = !DISubroutineType(types: !387)
!387 = !{!107, !388, !53, !389}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!390 = !{!384, !391, !392}
!391 = !DILocalVariable(name: "data_end", arg: 2, scope: !385, file: !355, line: 132, type: !53)
!392 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !385, file: !355, line: 133, type: !389)
!393 = !DILocation(line: 0, scope: !385, inlinedAt: !394)
!394 = distinct !DILocation(line: 704, column: 13, scope: !344)
!395 = !DILocalVariable(name: "nh", arg: 1, scope: !396, file: !355, line: 86, type: !388)
!396 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !355, file: !355, line: 86, type: !397, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !406)
!397 = !DISubroutineType(types: !398)
!398 = !{!107, !388, !53, !389, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !355, line: 71, size: 32, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !400, file: !355, line: 72, baseType: !403, size: 32)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 2)
!406 = !{!395, !407, !408, !409, !410, !411, !412, !418, !419}
!407 = !DILocalVariable(name: "data_end", arg: 2, scope: !396, file: !355, line: 87, type: !53)
!408 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !396, file: !355, line: 88, type: !389)
!409 = !DILocalVariable(name: "vlans", arg: 4, scope: !396, file: !355, line: 89, type: !399)
!410 = !DILocalVariable(name: "eth", scope: !396, file: !355, line: 91, type: !359)
!411 = !DILocalVariable(name: "hdrsize", scope: !396, file: !355, line: 92, type: !107)
!412 = !DILocalVariable(name: "vlh", scope: !396, file: !355, line: 93, type: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !355, line: 44, size: 32, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !414, file: !355, line: 45, baseType: !89, size: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !414, file: !355, line: 46, baseType: !89, size: 16, offset: 16)
!418 = !DILocalVariable(name: "h_proto", scope: !396, file: !355, line: 94, type: !55)
!419 = !DILocalVariable(name: "i", scope: !396, file: !355, line: 95, type: !107)
!420 = !DILocation(line: 0, scope: !396, inlinedAt: !421)
!421 = distinct !DILocation(line: 136, column: 9, scope: !385, inlinedAt: !394)
!422 = !DILocation(line: 100, column: 14, scope: !423, inlinedAt: !421)
!423 = distinct !DILexicalBlock(scope: !396, file: !355, line: 100, column: 6)
!424 = !DILocation(line: 100, column: 24, scope: !423, inlinedAt: !421)
!425 = !DILocation(line: 100, column: 6, scope: !396, inlinedAt: !421)
!426 = !DILocation(line: 106, column: 17, scope: !396, inlinedAt: !421)
!427 = !{!428, !428, i64 0}
!428 = !{!"short", !375, i64 0}
!429 = !DILocalVariable(name: "h_proto", arg: 1, scope: !430, file: !355, line: 75, type: !55)
!430 = distinct !DISubprogram(name: "proto_is_vlan", scope: !355, file: !355, line: 75, type: !431, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!107, !55}
!433 = !{!429}
!434 = !DILocation(line: 0, scope: !430, inlinedAt: !435)
!435 = distinct !DILocation(line: 113, column: 8, scope: !436, inlinedAt: !421)
!436 = distinct !DILexicalBlock(scope: !437, file: !355, line: 113, column: 7)
!437 = distinct !DILexicalBlock(scope: !438, file: !355, line: 112, column: 39)
!438 = distinct !DILexicalBlock(scope: !439, file: !355, line: 112, column: 2)
!439 = distinct !DILexicalBlock(scope: !396, file: !355, line: 112, column: 2)
!440 = !DILocation(line: 77, column: 20, scope: !430, inlinedAt: !435)
!441 = !DILocation(line: 77, column: 46, scope: !430, inlinedAt: !435)
!442 = !DILocation(line: 113, column: 8, scope: !436, inlinedAt: !421)
!443 = !DILocation(line: 113, column: 7, scope: !437, inlinedAt: !421)
!444 = !DILocation(line: 119, column: 18, scope: !437, inlinedAt: !421)
!445 = !DILocation(line: 705, column: 15, scope: !446)
!446 = distinct !DILexicalBlock(scope: !344, file: !3, line: 705, column: 6)
!447 = !DILocation(line: 705, column: 38, scope: !446)
!448 = !DILocalVariable(name: "skb", arg: 1, scope: !449, file: !3, line: 263, type: !185)
!449 = distinct !DISubprogram(name: "nat64_handle_v4", scope: !3, file: !3, line: 263, type: !450, scopeLine: 264, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !452)
!450 = !DISubroutineType(types: !451)
!451 = !{!107, !185, !388}
!452 = !{!448, !453, !454, !455, !456, !457, !458, !459, !460, !487, !488, !516, !517, !518, !519}
!453 = !DILocalVariable(name: "nh", arg: 2, scope: !449, file: !3, line: 263, type: !388)
!454 = !DILocalVariable(name: "data_end", scope: !449, file: !3, line: 265, type: !53)
!455 = !DILocalVariable(name: "data", scope: !449, file: !3, line: 266, type: !53)
!456 = !DILocalVariable(name: "ip_type", scope: !449, file: !3, line: 268, type: !107)
!457 = !DILocalVariable(name: "iphdr_len", scope: !449, file: !3, line: 268, type: !107)
!458 = !DILocalVariable(name: "ip_offset", scope: !449, file: !3, line: 268, type: !107)
!459 = !DILocalVariable(name: "dst_v6", scope: !449, file: !3, line: 269, type: !111)
!460 = !DILocalVariable(name: "ip6h", scope: !449, file: !3, line: 270, type: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !463, line: 118, size: 320, elements: !464)
!463 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "4f074a871dc410c98906d34687654389")
!464 = !{!465, !466, !467, !471, !472, !473, !474}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !462, file: !463, line: 120, baseType: !83, size: 4, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !462, file: !463, line: 121, baseType: !83, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !462, file: !463, line: 128, baseType: !468, size: 24, offset: 8)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 24, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 3)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !462, file: !463, line: 130, baseType: !89, size: 16, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !462, file: !463, line: 131, baseType: !83, size: 8, offset: 48)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !462, file: !463, line: 132, baseType: !83, size: 8, offset: 56)
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 134, baseType: !475, size: 256, offset: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 134, size: 256, elements: !476)
!476 = !{!477, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !463, line: 134, baseType: !478, size: 256)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !463, line: 134, size: 256, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !478, file: !463, line: 134, baseType: !75, size: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !478, file: !463, line: 134, baseType: !75, size: 128, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !475, file: !463, line: 134, baseType: !483, size: 256)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !463, line: 134, size: 256, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !483, file: !463, line: 134, baseType: !75, size: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !483, file: !463, line: 134, baseType: !75, size: 128, offset: 128)
!487 = !DILocalVariable(name: "ret", scope: !449, file: !3, line: 271, type: !107)
!488 = !DILocalVariable(name: "iph", scope: !449, file: !3, line: 272, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !491, line: 87, size: 160, elements: !492)
!491 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !503}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !490, file: !491, line: 89, baseType: !83, size: 4, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !490, file: !491, line: 90, baseType: !83, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !490, file: !491, line: 97, baseType: !83, size: 8, offset: 8)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !490, file: !491, line: 98, baseType: !89, size: 16, offset: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !491, line: 99, baseType: !89, size: 16, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !490, file: !491, line: 100, baseType: !89, size: 16, offset: 48)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !490, file: !491, line: 101, baseType: !83, size: 8, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !490, file: !491, line: 102, baseType: !83, size: 8, offset: 72)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !490, file: !491, line: 103, baseType: !502, size: 16, offset: 80)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !61, line: 31, baseType: !55)
!503 = !DIDerivedType(tag: DW_TAG_member, scope: !490, file: !491, line: 104, baseType: !504, size: 64, offset: 96)
!504 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !491, line: 104, size: 64, elements: !505)
!505 = !{!506, !511}
!506 = !DIDerivedType(tag: DW_TAG_member, scope: !504, file: !491, line: 104, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !504, file: !491, line: 104, size: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !507, file: !491, line: 104, baseType: !60, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !507, file: !491, line: 104, baseType: !60, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !504, file: !491, line: 104, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !504, file: !491, line: 104, size: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !512, file: !491, line: 104, baseType: !60, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !512, file: !491, line: 104, baseType: !60, size: 32, offset: 32)
!516 = !DILocalVariable(name: "eth", scope: !449, file: !3, line: 273, type: !359)
!517 = !DILocalVariable(name: "dst_v4", scope: !449, file: !3, line: 274, type: !58)
!518 = !DILocalVariable(name: "dst_hdr", scope: !449, file: !3, line: 276, type: !462)
!519 = !DILabel(scope: !449, name: "out", file: !3, line: 360)
!520 = !DILocation(line: 0, scope: !449, inlinedAt: !521)
!521 = distinct !DILocation(line: 706, column: 10, scope: !446)
!522 = !DILocation(line: 274, column: 9, scope: !449, inlinedAt: !521)
!523 = !DILocation(line: 276, column: 2, scope: !449, inlinedAt: !521)
!524 = !DILocation(line: 276, column: 17, scope: !449, inlinedAt: !521)
!525 = !DILocation(line: 276, column: 27, scope: !449, inlinedAt: !521)
!526 = !DILocation(line: 278, column: 3, scope: !449, inlinedAt: !521)
!527 = !DILocation(line: 278, column: 19, scope: !449, inlinedAt: !521)
!528 = !{i64 0, i64 16, !529, i64 0, i64 16, !529, i64 0, i64 16, !529}
!529 = !{!375, !375, i64 0}
!530 = !DILocation(line: 281, column: 30, scope: !449, inlinedAt: !521)
!531 = !DILocation(line: 281, column: 21, scope: !449, inlinedAt: !521)
!532 = !DILocalVariable(name: "nh", arg: 1, scope: !533, file: !355, line: 196, type: !388)
!533 = distinct !DISubprogram(name: "parse_iphdr", scope: !355, file: !355, line: 196, type: !534, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !537)
!534 = !DISubroutineType(types: !535)
!535 = !{!107, !388, !53, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!537 = !{!532, !538, !539, !540, !541}
!538 = !DILocalVariable(name: "data_end", arg: 2, scope: !533, file: !355, line: 197, type: !53)
!539 = !DILocalVariable(name: "iphdr", arg: 3, scope: !533, file: !355, line: 198, type: !536)
!540 = !DILocalVariable(name: "iph", scope: !533, file: !355, line: 200, type: !489)
!541 = !DILocalVariable(name: "hdrsize", scope: !533, file: !355, line: 201, type: !107)
!542 = !DILocation(line: 0, scope: !533, inlinedAt: !543)
!543 = distinct !DILocation(line: 283, column: 19, scope: !449, inlinedAt: !521)
!544 = !DILocation(line: 203, column: 10, scope: !545, inlinedAt: !543)
!545 = distinct !DILexicalBlock(scope: !533, file: !355, line: 203, column: 6)
!546 = !DILocation(line: 203, column: 14, scope: !545, inlinedAt: !543)
!547 = !DILocation(line: 203, column: 6, scope: !533, inlinedAt: !543)
!548 = !DILocation(line: 206, column: 11, scope: !549, inlinedAt: !543)
!549 = distinct !DILexicalBlock(scope: !533, file: !355, line: 206, column: 6)
!550 = !DILocation(line: 206, column: 19, scope: !549, inlinedAt: !543)
!551 = !DILocation(line: 206, column: 6, scope: !533, inlinedAt: !543)
!552 = !DILocation(line: 209, column: 21, scope: !533, inlinedAt: !543)
!553 = !DILocation(line: 211, column: 13, scope: !554, inlinedAt: !543)
!554 = distinct !DILexicalBlock(scope: !533, file: !355, line: 211, column: 5)
!555 = !DILocation(line: 211, column: 5, scope: !533, inlinedAt: !543)
!556 = !DILocation(line: 215, column: 14, scope: !557, inlinedAt: !543)
!557 = distinct !DILexicalBlock(scope: !533, file: !355, line: 215, column: 6)
!558 = !DILocation(line: 215, column: 24, scope: !557, inlinedAt: !543)
!559 = !DILocation(line: 215, column: 6, scope: !533, inlinedAt: !543)
!560 = !DILocation(line: 219, column: 9, scope: !533, inlinedAt: !543)
!561 = !DILocation(line: 287, column: 18, scope: !449, inlinedAt: !521)
!562 = !DILocation(line: 287, column: 16, scope: !449, inlinedAt: !521)
!563 = !{!374, !374, i64 0}
!564 = !DILocation(line: 288, column: 30, scope: !565, inlinedAt: !521)
!565 = distinct !DILexicalBlock(scope: !449, file: !3, line: 288, column: 13)
!566 = !{!567, !374, i64 36}
!567 = !{!"nat64_config", !568, i64 0, !377, i64 16, !377, i64 24, !374, i64 32, !374, i64 36}
!568 = !{!"in6_addr", !375, i64 0}
!569 = !DILocation(line: 288, column: 21, scope: !565, inlinedAt: !521)
!570 = !DILocation(line: 288, column: 49, scope: !565, inlinedAt: !521)
!571 = !{!567, !374, i64 32}
!572 = !DILocation(line: 288, column: 39, scope: !565, inlinedAt: !521)
!573 = !DILocation(line: 288, column: 13, scope: !449, inlinedAt: !521)
!574 = !DILocation(line: 304, column: 26, scope: !449, inlinedAt: !521)
!575 = !DILocation(line: 305, column: 23, scope: !576, inlinedAt: !521)
!576 = distinct !DILexicalBlock(scope: !449, file: !3, line: 305, column: 13)
!577 = !DILocation(line: 305, column: 47, scope: !576, inlinedAt: !521)
!578 = !DILocation(line: 306, column: 19, scope: !576, inlinedAt: !521)
!579 = !{!580, !428, i64 6}
!580 = !{!"iphdr", !375, i64 0, !375, i64 0, !375, i64 1, !428, i64 2, !428, i64 4, !428, i64 6, !375, i64 8, !375, i64 9, !428, i64 10, !375, i64 12}
!581 = !DILocation(line: 306, column: 28, scope: !576, inlinedAt: !521)
!582 = !DILocation(line: 305, column: 13, scope: !449, inlinedAt: !521)
!583 = !DILocation(line: 313, column: 18, scope: !449, inlinedAt: !521)
!584 = !DILocation(line: 314, column: 14, scope: !585, inlinedAt: !521)
!585 = distinct !DILexicalBlock(scope: !449, file: !3, line: 314, column: 13)
!586 = !DILocation(line: 314, column: 13, scope: !449, inlinedAt: !521)
!587 = !DILocation(line: 322, column: 43, scope: !449, inlinedAt: !521)
!588 = !DILocation(line: 322, column: 9, scope: !449, inlinedAt: !521)
!589 = !DILocation(line: 322, column: 36, scope: !449, inlinedAt: !521)
!590 = !DILocation(line: 323, column: 25, scope: !449, inlinedAt: !521)
!591 = !DILocation(line: 324, column: 32, scope: !449, inlinedAt: !521)
!592 = !{!580, !375, i64 9}
!593 = !DILocation(line: 324, column: 25, scope: !449, inlinedAt: !521)
!594 = !{!595, !375, i64 6}
!595 = !{!"ipv6hdr", !375, i64 0, !375, i64 0, !375, i64 1, !428, i64 4, !375, i64 6, !375, i64 7, !375, i64 8}
!596 = !DILocation(line: 325, column: 34, scope: !449, inlinedAt: !521)
!597 = !{!580, !375, i64 8}
!598 = !DILocation(line: 325, column: 27, scope: !449, inlinedAt: !521)
!599 = !{!595, !375, i64 7}
!600 = !DILocation(line: 327, column: 34, scope: !449, inlinedAt: !521)
!601 = !{!580, !375, i64 1}
!602 = !DILocation(line: 327, column: 46, scope: !449, inlinedAt: !521)
!603 = !DILocation(line: 327, column: 26, scope: !449, inlinedAt: !521)
!604 = !DILocation(line: 328, column: 40, scope: !449, inlinedAt: !521)
!605 = !DILocation(line: 328, column: 29, scope: !449, inlinedAt: !521)
!606 = !DILocation(line: 329, column: 31, scope: !449, inlinedAt: !521)
!607 = !{!580, !428, i64 2}
!608 = !DILocation(line: 329, column: 29, scope: !449, inlinedAt: !521)
!609 = !{!595, !428, i64 4}
!610 = !DILocation(line: 331, column: 2, scope: !449, inlinedAt: !521)
!611 = !DILocation(line: 333, column: 7, scope: !612, inlinedAt: !521)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 333, column: 7)
!613 = distinct !DILexicalBlock(scope: !449, file: !3, line: 331, column: 27)
!614 = !DILocation(line: 333, column: 7, scope: !613, inlinedAt: !521)
!615 = !DILocation(line: 335, column: 19, scope: !613, inlinedAt: !521)
!616 = !DILocation(line: 336, column: 3, scope: !613, inlinedAt: !521)
!617 = !DILocalVariable(name: "skb", arg: 1, scope: !618, file: !3, line: 69, type: !185)
!618 = distinct !DISubprogram(name: "update_l4_checksum", scope: !3, file: !3, line: 69, type: !619, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !185, !461, !489, !107, !347}
!621 = !{!617, !622, !623, !624, !625, !626, !627, !628, !629}
!622 = !DILocalVariable(name: "ip6h", arg: 2, scope: !618, file: !3, line: 69, type: !461)
!623 = !DILocalVariable(name: "iph", arg: 3, scope: !618, file: !3, line: 70, type: !489)
!624 = !DILocalVariable(name: "ip_type", arg: 4, scope: !618, file: !3, line: 70, type: !107)
!625 = !DILocalVariable(name: "v4to6", arg: 5, scope: !618, file: !3, line: 70, type: !347)
!626 = !DILocalVariable(name: "data", scope: !618, file: !3, line: 72, type: !53)
!627 = !DILocalVariable(name: "flags", scope: !618, file: !3, line: 73, type: !107)
!628 = !DILocalVariable(name: "offset", scope: !618, file: !3, line: 74, type: !55)
!629 = !DILocalVariable(name: "csum", scope: !618, file: !3, line: 75, type: !58)
!630 = !DILocation(line: 0, scope: !618, inlinedAt: !631)
!631 = distinct !DILocation(line: 339, column: 3, scope: !613, inlinedAt: !521)
!632 = !DILocation(line: 72, column: 48, scope: !618, inlinedAt: !631)
!633 = !DILocation(line: 72, column: 23, scope: !618, inlinedAt: !631)
!634 = !DILocation(line: 79, column: 10, scope: !635, inlinedAt: !631)
!635 = distinct !DILexicalBlock(scope: !636, file: !3, line: 77, column: 13)
!636 = distinct !DILexicalBlock(scope: !618, file: !3, line: 77, column: 6)
!637 = !DILocation(line: 78, column: 10, scope: !635, inlinedAt: !631)
!638 = !DILocation(line: 0, scope: !636, inlinedAt: !631)
!639 = !DILocation(line: 90, column: 2, scope: !618, inlinedAt: !631)
!640 = !DILocation(line: 92, column: 10, scope: !641, inlinedAt: !631)
!641 = distinct !DILexicalBlock(scope: !618, file: !3, line: 90, column: 19)
!642 = !DILocation(line: 93, column: 3, scope: !641, inlinedAt: !631)
!643 = !DILocation(line: 95, column: 10, scope: !641, inlinedAt: !631)
!644 = !DILocation(line: 97, column: 3, scope: !641, inlinedAt: !631)
!645 = !DILocation(line: 0, scope: !641, inlinedAt: !631)
!646 = !DILocation(line: 102, column: 34, scope: !618, inlinedAt: !631)
!647 = !DILocation(line: 102, column: 45, scope: !618, inlinedAt: !631)
!648 = !DILocation(line: 102, column: 9, scope: !618, inlinedAt: !631)
!649 = !DILocation(line: 103, column: 1, scope: !618, inlinedAt: !631)
!650 = !DILocation(line: 345, column: 6, scope: !651, inlinedAt: !521)
!651 = distinct !DILexicalBlock(scope: !449, file: !3, line: 345, column: 6)
!652 = !DILocation(line: 345, column: 6, scope: !449, inlinedAt: !521)
!653 = !DILocation(line: 348, column: 42, scope: !449, inlinedAt: !521)
!654 = !DILocation(line: 348, column: 17, scope: !449, inlinedAt: !521)
!655 = !DILocation(line: 348, column: 9, scope: !449, inlinedAt: !521)
!656 = !DILocation(line: 349, column: 46, scope: !449, inlinedAt: !521)
!657 = !DILocation(line: 349, column: 21, scope: !449, inlinedAt: !521)
!658 = !DILocation(line: 351, column: 15, scope: !449, inlinedAt: !521)
!659 = !DILocation(line: 352, column: 21, scope: !449, inlinedAt: !521)
!660 = !DILocation(line: 353, column: 17, scope: !661, inlinedAt: !521)
!661 = distinct !DILexicalBlock(scope: !449, file: !3, line: 353, column: 13)
!662 = !DILocation(line: 353, column: 23, scope: !661, inlinedAt: !521)
!663 = !DILocation(line: 353, column: 21, scope: !661, inlinedAt: !521)
!664 = !DILocation(line: 353, column: 32, scope: !661, inlinedAt: !521)
!665 = !DILocation(line: 356, column: 14, scope: !449, inlinedAt: !521)
!666 = !DILocation(line: 356, column: 22, scope: !449, inlinedAt: !521)
!667 = !{!668, !428, i64 12}
!668 = !{!"ethhdr", !375, i64 0, !375, i64 6, !428, i64 12}
!669 = !DILocation(line: 357, column: 17, scope: !449, inlinedAt: !521)
!670 = !{i64 0, i64 1, !529, i64 0, i64 1, !529, i64 1, i64 3, !529, i64 4, i64 2, !427, i64 6, i64 1, !529, i64 7, i64 1, !529, i64 8, i64 16, !529, i64 8, i64 16, !529, i64 8, i64 16, !529, i64 24, i64 16, !529, i64 24, i64 16, !529, i64 24, i64 16, !529, i64 8, i64 16, !529, i64 8, i64 16, !529, i64 8, i64 16, !529, i64 24, i64 16, !529, i64 24, i64 16, !529, i64 24, i64 16, !529}
!671 = !DILocation(line: 359, column: 39, scope: !449, inlinedAt: !521)
!672 = !{!373, !374, i64 40}
!673 = !DILocation(line: 359, column: 15, scope: !449, inlinedAt: !521)
!674 = !DILocation(line: 359, column: 9, scope: !449, inlinedAt: !521)
!675 = !DILocation(line: 360, column: 1, scope: !449, inlinedAt: !521)
!676 = !DILocation(line: 362, column: 1, scope: !449, inlinedAt: !521)
!677 = !DILocation(line: 706, column: 3, scope: !446)
!678 = !DILocation(line: 707, column: 20, scope: !679)
!679 = distinct !DILexicalBlock(scope: !446, file: !3, line: 707, column: 11)
!680 = !DILocation(line: 707, column: 45, scope: !679)
!681 = !DILocalVariable(name: "skb", arg: 1, scope: !682, file: !3, line: 563, type: !185)
!682 = distinct !DISubprogram(name: "nat64_handle_v6", scope: !3, file: !3, line: 563, type: !450, scopeLine: 564, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !683)
!683 = !{!681, !684, !685, !686, !687, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!684 = !DILocalVariable(name: "nh", arg: 2, scope: !682, file: !3, line: 563, type: !388)
!685 = !DILocalVariable(name: "data_end", scope: !682, file: !3, line: 565, type: !53)
!686 = !DILocalVariable(name: "data", scope: !682, file: !3, line: 566, type: !53)
!687 = !DILocalVariable(name: "saddr_key", scope: !682, file: !3, line: 568, type: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v6_trie_key", file: !72, line: 20, size: 160, elements: !689)
!689 = !{!690, !696}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !688, file: !72, line: 21, baseType: !691, size: 32)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_lpm_trie_key", file: !6, line: 74, size: 32, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !691, file: !6, line: 75, baseType: !58, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !691, file: !6, line: 76, baseType: !695, offset: 32)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, elements: !159)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !688, file: !72, line: 22, baseType: !75, size: 128, offset: 32)
!697 = !DILocalVariable(name: "dst_v6", scope: !682, file: !3, line: 569, type: !111)
!698 = !DILocalVariable(name: "subnet_v6", scope: !682, file: !3, line: 569, type: !75)
!699 = !DILocalVariable(name: "allowval", scope: !682, file: !3, line: 570, type: !63)
!700 = !DILocalVariable(name: "src_v4", scope: !682, file: !3, line: 570, type: !58)
!701 = !DILocalVariable(name: "dst_v4", scope: !682, file: !3, line: 570, type: !58)
!702 = !DILocalVariable(name: "ip_type", scope: !682, file: !3, line: 571, type: !107)
!703 = !DILocalVariable(name: "ip_offset", scope: !682, file: !3, line: 571, type: !107)
!704 = !DILocalVariable(name: "ip6h", scope: !682, file: !3, line: 572, type: !461)
!705 = !DILocalVariable(name: "ret", scope: !682, file: !3, line: 573, type: !107)
!706 = !DILocalVariable(name: "eth", scope: !682, file: !3, line: 574, type: !359)
!707 = !DILocalVariable(name: "iph", scope: !682, file: !3, line: 575, type: !489)
!708 = !DILocalVariable(name: "v6_state", scope: !682, file: !3, line: 577, type: !113)
!709 = !DILocalVariable(name: "dst_hdr", scope: !682, file: !3, line: 579, type: !490)
!710 = !DILabel(scope: !682, name: "out", file: !3, line: 691)
!711 = !DILocation(line: 0, scope: !682, inlinedAt: !712)
!712 = distinct !DILocation(line: 708, column: 10, scope: !679)
!713 = !DILocation(line: 568, column: 2, scope: !682, inlinedAt: !712)
!714 = !DILocation(line: 568, column: 21, scope: !682, inlinedAt: !712)
!715 = !DILocation(line: 579, column: 2, scope: !682, inlinedAt: !712)
!716 = !DILocation(line: 579, column: 15, scope: !682, inlinedAt: !712)
!717 = !DILocation(line: 585, column: 30, scope: !682, inlinedAt: !712)
!718 = !DILocation(line: 585, column: 21, scope: !682, inlinedAt: !712)
!719 = !DILocalVariable(name: "nh", arg: 1, scope: !720, file: !355, line: 174, type: !388)
!720 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !355, file: !355, line: 174, type: !721, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !724)
!721 = !DISubroutineType(types: !722)
!722 = !{!107, !388, !53, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!724 = !{!719, !725, !726, !727}
!725 = !DILocalVariable(name: "data_end", arg: 2, scope: !720, file: !355, line: 175, type: !53)
!726 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !720, file: !355, line: 176, type: !723)
!727 = !DILocalVariable(name: "ip6h", scope: !720, file: !355, line: 178, type: !461)
!728 = !DILocation(line: 0, scope: !720, inlinedAt: !729)
!729 = distinct !DILocation(line: 587, column: 19, scope: !682, inlinedAt: !712)
!730 = !DILocation(line: 184, column: 11, scope: !731, inlinedAt: !729)
!731 = distinct !DILexicalBlock(scope: !720, file: !355, line: 184, column: 6)
!732 = !DILocation(line: 184, column: 15, scope: !731, inlinedAt: !729)
!733 = !DILocation(line: 184, column: 6, scope: !720, inlinedAt: !729)
!734 = !DILocation(line: 187, column: 12, scope: !735, inlinedAt: !729)
!735 = distinct !DILexicalBlock(scope: !720, file: !355, line: 187, column: 6)
!736 = !DILocation(line: 187, column: 20, scope: !735, inlinedAt: !729)
!737 = !DILocation(line: 187, column: 6, scope: !720, inlinedAt: !729)
!738 = !DILocation(line: 191, column: 10, scope: !720, inlinedAt: !729)
!739 = !DILocation(line: 193, column: 44, scope: !720, inlinedAt: !729)
!740 = !DILocalVariable(name: "nh", arg: 1, scope: !741, file: !355, line: 139, type: !388)
!741 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !355, file: !355, line: 139, type: !742, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{!107, !388, !53, !83}
!744 = !{!740, !745, !746, !747, !749}
!745 = !DILocalVariable(name: "data_end", arg: 2, scope: !741, file: !355, line: 140, type: !53)
!746 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !741, file: !355, line: 141, type: !83)
!747 = !DILocalVariable(name: "i", scope: !748, file: !355, line: 143, type: !107)
!748 = distinct !DILexicalBlock(scope: !741, file: !355, line: 143, column: 2)
!749 = !DILocalVariable(name: "hdr", scope: !750, file: !355, line: 144, type: !752)
!750 = distinct !DILexicalBlock(scope: !751, file: !355, line: 143, column: 47)
!751 = distinct !DILexicalBlock(scope: !748, file: !355, line: 143, column: 2)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !463, line: 63, size: 16, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !753, file: !463, line: 64, baseType: !83, size: 8)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !753, file: !463, line: 65, baseType: !83, size: 8, offset: 8)
!757 = !DILocation(line: 0, scope: !741, inlinedAt: !758)
!758 = distinct !DILocation(line: 193, column: 9, scope: !720, inlinedAt: !729)
!759 = !DILocation(line: 0, scope: !748, inlinedAt: !758)
!760 = !DILocation(line: 0, scope: !750, inlinedAt: !758)
!761 = !DILocation(line: 146, column: 11, scope: !762, inlinedAt: !758)
!762 = distinct !DILexicalBlock(scope: !750, file: !355, line: 146, column: 7)
!763 = !DILocation(line: 146, column: 15, scope: !762, inlinedAt: !758)
!764 = !DILocation(line: 146, column: 7, scope: !750, inlinedAt: !758)
!765 = !DILocation(line: 149, column: 3, scope: !750, inlinedAt: !758)
!766 = !DILocation(line: 160, column: 4, scope: !767, inlinedAt: !758)
!767 = distinct !DILexicalBlock(scope: !750, file: !355, line: 149, column: 26)
!768 = !DILocation(line: 0, scope: !767, inlinedAt: !758)
!769 = !{!770, !375, i64 1}
!770 = !{!"ipv6_opt_hdr", !375, i64 0, !375, i64 1}
!771 = !{!770, !375, i64 0}
!772 = !DILocation(line: 156, column: 4, scope: !767, inlinedAt: !758)
!773 = !DILocation(line: 592, column: 21, scope: !682, inlinedAt: !712)
!774 = !{i64 0, i64 8, !529, i64 0, i64 8, !529, i64 0, i64 8, !529}
!775 = !DILocalVariable(name: "a", arg: 1, scope: !776, file: !3, line: 445, type: !111)
!776 = distinct !DISubprogram(name: "cmp_v6addr", scope: !3, file: !3, line: 445, type: !777, scopeLine: 446, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!107, !111, !111}
!779 = !{!775, !780, !781}
!780 = !DILocalVariable(name: "b", arg: 2, scope: !776, file: !3, line: 445, type: !111)
!781 = !DILocalVariable(name: "i", scope: !776, file: !3, line: 447, type: !107)
!782 = !DILocation(line: 0, scope: !776, inlinedAt: !783)
!783 = distinct !DILocation(line: 595, column: 13, scope: !784, inlinedAt: !712)
!784 = distinct !DILexicalBlock(scope: !682, file: !3, line: 595, column: 13)
!785 = !DILocation(line: 449, column: 39, scope: !786, inlinedAt: !783)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 449, column: 21)
!787 = distinct !DILexicalBlock(scope: !788, file: !3, line: 448, column: 33)
!788 = distinct !DILexicalBlock(scope: !789, file: !3, line: 448, column: 9)
!789 = distinct !DILexicalBlock(scope: !776, file: !3, line: 448, column: 9)
!790 = !DILocation(line: 449, column: 21, scope: !787, inlinedAt: !783)
!791 = !{i64 0, i64 12, !529, i64 0, i64 12, !529, i64 0, i64 12, !529}
!792 = !DILocation(line: 608, column: 21, scope: !793, inlinedAt: !712)
!793 = distinct !DILexicalBlock(scope: !682, file: !3, line: 608, column: 13)
!794 = !DILocation(line: 608, column: 13, scope: !682, inlinedAt: !712)
!795 = !DILocation(line: 615, column: 18, scope: !682, inlinedAt: !712)
!796 = !DILocation(line: 616, column: 14, scope: !797, inlinedAt: !712)
!797 = distinct !DILexicalBlock(scope: !682, file: !3, line: 616, column: 13)
!798 = !DILocation(line: 616, column: 21, scope: !797, inlinedAt: !712)
!799 = !DILocation(line: 624, column: 19, scope: !682, inlinedAt: !712)
!800 = !DILocation(line: 624, column: 32, scope: !682, inlinedAt: !712)
!801 = !DILocation(line: 625, column: 20, scope: !682, inlinedAt: !712)
!802 = !DILocation(line: 626, column: 14, scope: !803, inlinedAt: !712)
!803 = distinct !DILexicalBlock(scope: !682, file: !3, line: 626, column: 13)
!804 = !DILocation(line: 626, column: 13, scope: !682, inlinedAt: !712)
!805 = !DILocation(line: 631, column: 20, scope: !682, inlinedAt: !712)
!806 = !DILocation(line: 632, column: 14, scope: !807, inlinedAt: !712)
!807 = distinct !DILexicalBlock(scope: !682, file: !3, line: 632, column: 13)
!808 = !DILocation(line: 632, column: 13, scope: !682, inlinedAt: !712)
!809 = !DILocation(line: 633, column: 28, scope: !810, inlinedAt: !712)
!810 = distinct !DILexicalBlock(scope: !807, file: !3, line: 632, column: 24)
!811 = !DILocation(line: 634, column: 22, scope: !812, inlinedAt: !712)
!812 = distinct !DILexicalBlock(scope: !810, file: !3, line: 634, column: 21)
!813 = !DILocation(line: 634, column: 21, scope: !810, inlinedAt: !712)
!814 = !DILocation(line: 643, column: 39, scope: !815, inlinedAt: !712)
!815 = distinct !DILexicalBlock(scope: !807, file: !3, line: 642, column: 16)
!816 = !DILocation(line: 643, column: 27, scope: !815, inlinedAt: !712)
!817 = !DILocation(line: 643, column: 37, scope: !815, inlinedAt: !712)
!818 = !{!819, !377, i64 0}
!819 = !{!"v6_addr_state", !377, i64 0, !374, i64 8, !374, i64 12}
!820 = !DILocation(line: 644, column: 17, scope: !815, inlinedAt: !712)
!821 = !DILocation(line: 651, column: 17, scope: !682, inlinedAt: !712)
!822 = !DILocation(line: 651, column: 23, scope: !682, inlinedAt: !712)
!823 = !DILocation(line: 652, column: 25, scope: !682, inlinedAt: !712)
!824 = !{!819, !374, i64 8}
!825 = !DILocation(line: 652, column: 17, scope: !682, inlinedAt: !712)
!826 = !DILocation(line: 652, column: 23, scope: !682, inlinedAt: !712)
!827 = !DILocation(line: 653, column: 34, scope: !682, inlinedAt: !712)
!828 = !DILocation(line: 653, column: 17, scope: !682, inlinedAt: !712)
!829 = !DILocation(line: 653, column: 26, scope: !682, inlinedAt: !712)
!830 = !DILocation(line: 654, column: 29, scope: !682, inlinedAt: !712)
!831 = !DILocation(line: 654, column: 17, scope: !682, inlinedAt: !712)
!832 = !DILocation(line: 654, column: 21, scope: !682, inlinedAt: !712)
!833 = !DILocation(line: 655, column: 29, scope: !682, inlinedAt: !712)
!834 = !DILocation(line: 655, column: 46, scope: !682, inlinedAt: !712)
!835 = !DILocation(line: 655, column: 43, scope: !682, inlinedAt: !712)
!836 = !DILocation(line: 655, column: 17, scope: !682, inlinedAt: !712)
!837 = !DILocation(line: 655, column: 21, scope: !682, inlinedAt: !712)
!838 = !DILocation(line: 656, column: 27, scope: !682, inlinedAt: !712)
!839 = !DILocation(line: 656, column: 17, scope: !682, inlinedAt: !712)
!840 = !DILocation(line: 656, column: 25, scope: !682, inlinedAt: !712)
!841 = !DILocation(line: 658, column: 2, scope: !682, inlinedAt: !712)
!842 = !DILocation(line: 660, column: 7, scope: !843, inlinedAt: !712)
!843 = distinct !DILexicalBlock(scope: !844, file: !3, line: 660, column: 7)
!844 = distinct !DILexicalBlock(scope: !682, file: !3, line: 658, column: 28)
!845 = !DILocation(line: 660, column: 7, scope: !844, inlinedAt: !712)
!846 = !DILocation(line: 662, column: 20, scope: !844, inlinedAt: !712)
!847 = !DILocation(line: 663, column: 3, scope: !844, inlinedAt: !712)
!848 = !DILocation(line: 0, scope: !618, inlinedAt: !849)
!849 = distinct !DILocation(line: 666, column: 3, scope: !844, inlinedAt: !712)
!850 = !DILocation(line: 72, column: 48, scope: !618, inlinedAt: !849)
!851 = !DILocation(line: 72, column: 23, scope: !618, inlinedAt: !849)
!852 = !DILocation(line: 83, column: 24, scope: !853, inlinedAt: !849)
!853 = distinct !DILexicalBlock(scope: !636, file: !3, line: 82, column: 9)
!854 = !DILocation(line: 83, column: 10, scope: !853, inlinedAt: !849)
!855 = !DILocation(line: 0, scope: !636, inlinedAt: !849)
!856 = !DILocation(line: 90, column: 2, scope: !618, inlinedAt: !849)
!857 = !DILocation(line: 92, column: 10, scope: !641, inlinedAt: !849)
!858 = !DILocation(line: 93, column: 3, scope: !641, inlinedAt: !849)
!859 = !DILocation(line: 95, column: 10, scope: !641, inlinedAt: !849)
!860 = !DILocation(line: 97, column: 3, scope: !641, inlinedAt: !849)
!861 = !DILocation(line: 0, scope: !641, inlinedAt: !849)
!862 = !DILocation(line: 102, column: 34, scope: !618, inlinedAt: !849)
!863 = !DILocation(line: 102, column: 45, scope: !618, inlinedAt: !849)
!864 = !DILocation(line: 102, column: 9, scope: !618, inlinedAt: !849)
!865 = !DILocation(line: 103, column: 1, scope: !618, inlinedAt: !849)
!866 = !DILocation(line: 672, column: 56, scope: !682, inlinedAt: !712)
!867 = !DILocation(line: 672, column: 42, scope: !682, inlinedAt: !712)
!868 = !DILocalVariable(name: "csum", arg: 1, scope: !869, file: !3, line: 457, type: !58)
!869 = distinct !DISubprogram(name: "csum_fold_helper", scope: !3, file: !3, line: 457, type: !870, scopeLine: 458, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !872)
!870 = !DISubroutineType(types: !871)
!871 = !{!55, !58}
!872 = !{!868, !873}
!873 = !DILocalVariable(name: "sum", scope: !869, file: !3, line: 459, type: !58)
!874 = !DILocation(line: 0, scope: !869, inlinedAt: !875)
!875 = distinct !DILocation(line: 672, column: 25, scope: !682, inlinedAt: !712)
!876 = !DILocation(line: 460, column: 14, scope: !869, inlinedAt: !875)
!877 = !DILocation(line: 460, column: 29, scope: !869, inlinedAt: !875)
!878 = !DILocation(line: 460, column: 21, scope: !869, inlinedAt: !875)
!879 = !DILocation(line: 461, column: 14, scope: !869, inlinedAt: !875)
!880 = !DILocation(line: 461, column: 6, scope: !869, inlinedAt: !875)
!881 = !DILocation(line: 462, column: 9, scope: !869, inlinedAt: !875)
!882 = !DILocation(line: 672, column: 17, scope: !682, inlinedAt: !712)
!883 = !DILocation(line: 672, column: 23, scope: !682, inlinedAt: !712)
!884 = !{!580, !428, i64 10}
!885 = !DILocation(line: 676, column: 13, scope: !886, inlinedAt: !712)
!886 = distinct !DILexicalBlock(scope: !682, file: !3, line: 676, column: 13)
!887 = !DILocation(line: 676, column: 13, scope: !682, inlinedAt: !712)
!888 = !DILocation(line: 679, column: 42, scope: !682, inlinedAt: !712)
!889 = !DILocation(line: 679, column: 17, scope: !682, inlinedAt: !712)
!890 = !DILocation(line: 679, column: 9, scope: !682, inlinedAt: !712)
!891 = !DILocation(line: 680, column: 46, scope: !682, inlinedAt: !712)
!892 = !DILocation(line: 680, column: 21, scope: !682, inlinedAt: !712)
!893 = !DILocation(line: 682, column: 15, scope: !682, inlinedAt: !712)
!894 = !DILocation(line: 683, column: 20, scope: !682, inlinedAt: !712)
!895 = !DILocation(line: 684, column: 17, scope: !896, inlinedAt: !712)
!896 = distinct !DILexicalBlock(scope: !682, file: !3, line: 684, column: 13)
!897 = !DILocation(line: 684, column: 23, scope: !896, inlinedAt: !712)
!898 = !DILocation(line: 684, column: 21, scope: !896, inlinedAt: !712)
!899 = !DILocation(line: 684, column: 32, scope: !896, inlinedAt: !712)
!900 = !DILocation(line: 687, column: 14, scope: !682, inlinedAt: !712)
!901 = !DILocation(line: 687, column: 22, scope: !682, inlinedAt: !712)
!902 = !DILocation(line: 688, column: 16, scope: !682, inlinedAt: !712)
!903 = !{i64 0, i64 1, !529, i64 0, i64 1, !529, i64 1, i64 1, !529, i64 2, i64 2, !427, i64 4, i64 2, !427, i64 6, i64 2, !427, i64 8, i64 1, !529, i64 9, i64 1, !529, i64 10, i64 2, !427, i64 12, i64 4, !563, i64 16, i64 4, !563, i64 12, i64 4, !563, i64 16, i64 4, !563}
!904 = !DILocation(line: 690, column: 33, scope: !682, inlinedAt: !712)
!905 = !DILocation(line: 690, column: 15, scope: !682, inlinedAt: !712)
!906 = !DILocation(line: 690, column: 9, scope: !682, inlinedAt: !712)
!907 = !DILocation(line: 691, column: 1, scope: !682, inlinedAt: !712)
!908 = !DILocation(line: 693, column: 1, scope: !682, inlinedAt: !712)
!909 = !DILocation(line: 708, column: 3, scope: !679)
!910 = !DILocation(line: 711, column: 1, scope: !344)
!911 = distinct !DISubprogram(name: "nat64_ingress", scope: !3, file: !3, line: 719, type: !337, scopeLine: 720, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !912)
!912 = !{!913}
!913 = !DILocalVariable(name: "skb", arg: 1, scope: !911, file: !3, line: 719, type: !185)
!914 = !DILocation(line: 0, scope: !911)
!915 = !DILocation(line: 721, column: 16, scope: !911)
!916 = !DILocation(line: 721, column: 9, scope: !911)
!917 = distinct !DISubprogram(name: "rewrite_icmp", scope: !3, file: !3, line: 149, type: !918, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !920)
!918 = !DISubroutineType(types: !919)
!919 = !{!107, !489, !461, !185}
!920 = !{!921, !922, !923, !924, !925, !948, !950, !988, !990}
!921 = !DILocalVariable(name: "iph", arg: 1, scope: !917, file: !3, line: 149, type: !489)
!922 = !DILocalVariable(name: "ip6h", arg: 2, scope: !917, file: !3, line: 149, type: !461)
!923 = !DILocalVariable(name: "skb", arg: 3, scope: !917, file: !3, line: 149, type: !185)
!924 = !DILocalVariable(name: "data_end", scope: !917, file: !3, line: 151, type: !53)
!925 = !DILocalVariable(name: "old_icmp", scope: !917, file: !3, line: 153, type: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !927, line: 89, size: 64, elements: !928)
!927 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!928 = !{!929, !930, !931, !932}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !926, file: !927, line: 90, baseType: !83, size: 8)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !926, file: !927, line: 91, baseType: !83, size: 8, offset: 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !926, file: !927, line: 92, baseType: !502, size: 16, offset: 16)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !926, file: !927, line: 104, baseType: !933, size: 32, offset: 32)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !926, file: !927, line: 93, size: 32, elements: !934)
!934 = !{!935, !940, !941, !946}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !933, file: !927, line: 97, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !927, line: 94, size: 32, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !936, file: !927, line: 95, baseType: !89, size: 16)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !936, file: !927, line: 96, baseType: !89, size: 16, offset: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !933, file: !927, line: 98, baseType: !60, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !933, file: !927, line: 102, baseType: !942, size: 32)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !927, line: 99, size: 32, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !942, file: !927, line: 100, baseType: !89, size: 16)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !942, file: !927, line: 101, baseType: !89, size: 16, offset: 16)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !933, file: !927, line: 103, baseType: !947, size: 32)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32, elements: !94)
!948 = !DILocalVariable(name: "icmp", scope: !917, file: !3, line: 153, type: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!950 = !DILocalVariable(name: "icmp6", scope: !917, file: !3, line: 154, type: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !952, line: 8, size: 64, elements: !953)
!952 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !951, file: !952, line: 10, baseType: !83, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !951, file: !952, line: 11, baseType: !83, size: 8, offset: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !951, file: !952, line: 12, baseType: !502, size: 16, offset: 16)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !951, file: !952, line: 63, baseType: !958, size: 32, offset: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !951, file: !952, line: 15, size: 32, elements: !959)
!959 = !{!960, !962, !964, !965, !970, !978}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !958, file: !952, line: 16, baseType: !961, size: 32)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !108)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !958, file: !952, line: 17, baseType: !963, size: 32)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32, elements: !404)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !958, file: !952, line: 18, baseType: !947, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !958, file: !952, line: 23, baseType: !966, size: 32)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !952, line: 20, size: 32, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !966, file: !952, line: 21, baseType: !89, size: 16)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !966, file: !952, line: 22, baseType: !89, size: 16, offset: 16)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !958, file: !952, line: 40, baseType: !971, size: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !952, line: 25, size: 32, elements: !972)
!972 = !{!973, !974, !975, !976, !977}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !971, file: !952, line: 27, baseType: !58, size: 5, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !971, file: !952, line: 28, baseType: !58, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !971, file: !952, line: 29, baseType: !58, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !971, file: !952, line: 30, baseType: !58, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !971, file: !952, line: 31, baseType: !58, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !958, file: !952, line: 61, baseType: !979, size: 32)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !952, line: 42, size: 32, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !979, file: !952, line: 43, baseType: !83, size: 8)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !979, file: !952, line: 45, baseType: !83, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !979, file: !952, line: 46, baseType: !83, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !979, file: !952, line: 47, baseType: !83, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !979, file: !952, line: 48, baseType: !83, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !979, file: !952, line: 49, baseType: !83, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !979, file: !952, line: 60, baseType: !89, size: 16, offset: 16)
!988 = !DILocalVariable(name: "new_icmp6", scope: !917, file: !3, line: 154, type: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!990 = !DILocalVariable(name: "mtu", scope: !917, file: !3, line: 155, type: !58)
!991 = !DILocation(line: 0, scope: !917)
!992 = !DILocation(line: 151, column: 52, scope: !917)
!993 = !DILocation(line: 151, column: 27, scope: !917)
!994 = !DILocation(line: 153, column: 35, scope: !917)
!995 = !DILocation(line: 157, column: 11, scope: !996)
!996 = distinct !DILexicalBlock(scope: !917, file: !3, line: 157, column: 6)
!997 = !DILocation(line: 157, column: 17, scope: !996)
!998 = !DILocation(line: 157, column: 15, scope: !996)
!999 = !DILocation(line: 157, column: 6, scope: !917)
!1000 = !DILocation(line: 160, column: 20, scope: !917)
!1001 = !DILocation(line: 162, column: 10, scope: !917)
!1002 = !DILocation(line: 165, column: 16, scope: !917)
!1003 = !DILocation(line: 165, column: 2, scope: !917)
!1004 = !DILocation(line: 171, column: 3, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !917, file: !3, line: 165, column: 22)
!1006 = !DILocation(line: 174, column: 3, scope: !1005)
!1007 = !DILocation(line: 188, column: 25, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 174, column: 22)
!1009 = !DILocation(line: 0, scope: !1005)
!1010 = !DILocation(line: 191, column: 4, scope: !1008)
!1011 = !DILocation(line: 255, column: 15, scope: !917)
!1012 = !{i64 0, i64 1, !529, i64 1, i64 1, !529, i64 2, i64 2, !427, i64 4, i64 4, !529, i64 4, i64 4, !529, i64 4, i64 4, !529, i64 4, i64 2, !427, i64 6, i64 2, !427, i64 4, i64 4, !563, i64 4, i64 4, !563, i64 4, i64 4, !563, i64 4, i64 4, !563, i64 5, i64 4, !563, i64 4, i64 1, !529, i64 5, i64 1, !529, i64 5, i64 1, !529, i64 5, i64 1, !529, i64 5, i64 1, !529, i64 5, i64 1, !529, i64 6, i64 2, !427}
!1013 = !{i64 0, i64 1, !529, i64 1, i64 2, !427, i64 3, i64 4, !529, i64 3, i64 4, !529, i64 3, i64 4, !529, i64 3, i64 2, !427, i64 5, i64 2, !427, i64 3, i64 4, !563, i64 3, i64 4, !563, i64 3, i64 4, !563, i64 3, i64 4, !563, i64 4, i64 4, !563, i64 3, i64 1, !529, i64 4, i64 1, !529, i64 4, i64 1, !529, i64 4, i64 1, !529, i64 4, i64 1, !529, i64 4, i64 1, !529, i64 5, i64 2, !427}
!1014 = !{i64 0, i64 4, !529, i64 0, i64 4, !529, i64 0, i64 4, !529, i64 0, i64 2, !427, i64 2, i64 2, !427, i64 0, i64 4, !563, i64 0, i64 4, !563, i64 0, i64 4, !563, i64 0, i64 4, !563, i64 1, i64 4, !563, i64 0, i64 1, !529, i64 1, i64 1, !529, i64 1, i64 1, !529, i64 1, i64 1, !529, i64 1, i64 1, !529, i64 1, i64 1, !529, i64 2, i64 2, !427}
!1015 = !DILocalVariable(name: "skb", arg: 1, scope: !1016, file: !3, line: 106, type: !185)
!1016 = distinct !DISubprogram(name: "update_icmp_checksum", scope: !3, file: !3, line: 106, type: !1017, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1019)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !185, !461, !53, !53, !347}
!1019 = !{!1015, !1020, !1021, !1022, !1023, !1024, !1025, !1033, !1034, !1035, !1036, !1037, !1038}
!1020 = !DILocalVariable(name: "ip6h", arg: 2, scope: !1016, file: !3, line: 106, type: !461)
!1021 = !DILocalVariable(name: "icmp_before", arg: 3, scope: !1016, file: !3, line: 107, type: !53)
!1022 = !DILocalVariable(name: "icmp_after", arg: 4, scope: !1016, file: !3, line: 107, type: !53)
!1023 = !DILocalVariable(name: "add", arg: 5, scope: !1016, file: !3, line: 107, type: !347)
!1024 = !DILocalVariable(name: "data", scope: !1016, file: !3, line: 109, type: !53)
!1025 = !DILocalVariable(name: "ph", scope: !1016, file: !3, line: 110, type: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_pseudo", file: !3, line: 60, size: 320, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !1026, file: !3, line: 61, baseType: !75, size: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !1026, file: !3, line: 62, baseType: !75, size: 128, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1026, file: !3, line: 63, baseType: !58, size: 32, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !1026, file: !3, line: 64, baseType: !468, size: 24, offset: 288)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !1026, file: !3, line: 65, baseType: !83, size: 8, offset: 312)
!1033 = !DILocalVariable(name: "h_before", scope: !1016, file: !3, line: 116, type: !55)
!1034 = !DILocalVariable(name: "h_after", scope: !1016, file: !3, line: 116, type: !55)
!1035 = !DILocalVariable(name: "offset", scope: !1016, file: !3, line: 116, type: !55)
!1036 = !DILocalVariable(name: "csum", scope: !1016, file: !3, line: 117, type: !58)
!1037 = !DILocalVariable(name: "u_before", scope: !1016, file: !3, line: 117, type: !58)
!1038 = !DILocalVariable(name: "u_after", scope: !1016, file: !3, line: 117, type: !58)
!1039 = !DILocation(line: 0, scope: !1016, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 256, column: 9, scope: !917)
!1041 = !DILocation(line: 109, column: 48, scope: !1016, inlinedAt: !1040)
!1042 = !DILocation(line: 110, column: 2, scope: !1016, inlinedAt: !1040)
!1043 = !DILocation(line: 110, column: 23, scope: !1016, inlinedAt: !1040)
!1044 = !DILocation(line: 112, column: 18, scope: !1016, inlinedAt: !1040)
!1045 = !DILocation(line: 110, column: 28, scope: !1016, inlinedAt: !1040)
!1046 = !DILocation(line: 113, column: 18, scope: !1016, inlinedAt: !1040)
!1047 = !DILocation(line: 114, column: 16, scope: !1016, inlinedAt: !1040)
!1048 = !DILocation(line: 114, column: 10, scope: !1016, inlinedAt: !1040)
!1049 = !{!1050, !374, i64 32}
!1050 = !{!"icmpv6_pseudo", !568, i64 0, !568, i64 16, !374, i64 32, !375, i64 36, !375, i64 39}
!1051 = !{!1050, !375, i64 39}
!1052 = !DILocation(line: 128, column: 23, scope: !1016, inlinedAt: !1040)
!1053 = !DILocation(line: 128, column: 9, scope: !1016, inlinedAt: !1040)
!1054 = !DILocation(line: 132, column: 38, scope: !1016, inlinedAt: !1040)
!1055 = !DILocation(line: 132, column: 18, scope: !1016, inlinedAt: !1040)
!1056 = !DILocation(line: 135, column: 20, scope: !1016, inlinedAt: !1040)
!1057 = !DILocation(line: 135, column: 19, scope: !1016, inlinedAt: !1040)
!1058 = !DILocation(line: 139, column: 19, scope: !1016, inlinedAt: !1040)
!1059 = !DILocation(line: 141, column: 34, scope: !1016, inlinedAt: !1040)
!1060 = !DILocation(line: 141, column: 45, scope: !1016, inlinedAt: !1040)
!1061 = !DILocation(line: 141, column: 9, scope: !1016, inlinedAt: !1040)
!1062 = !DILocation(line: 142, column: 42, scope: !1016, inlinedAt: !1040)
!1063 = !DILocation(line: 142, column: 52, scope: !1016, inlinedAt: !1040)
!1064 = !DILocation(line: 142, column: 9, scope: !1016, inlinedAt: !1040)
!1065 = !DILocation(line: 144, column: 22, scope: !1066, inlinedAt: !1040)
!1066 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 144, column: 13)
!1067 = !DILocation(line: 144, column: 13, scope: !1016, inlinedAt: !1040)
!1068 = !DILocation(line: 145, column: 60, scope: !1066, inlinedAt: !1040)
!1069 = !DILocation(line: 145, column: 17, scope: !1066, inlinedAt: !1040)
!1070 = !DILocation(line: 146, column: 1, scope: !1016, inlinedAt: !1040)
!1071 = !DILocation(line: 260, column: 2, scope: !917)
!1072 = !DILocation(line: 261, column: 1, scope: !917)
!1073 = distinct !DISubprogram(name: "alloc_new_state", scope: !3, file: !3, line: 397, type: !1074, scopeLine: 398, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1076)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!113, !111}
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1086, !1087, !1088}
!1077 = !DILocalVariable(name: "src_v6", arg: 1, scope: !1073, file: !3, line: 397, type: !111)
!1078 = !DILocalVariable(name: "new_v6_state", scope: !1073, file: !3, line: 399, type: !114)
!1079 = !DILocalVariable(name: "max_v4", scope: !1073, file: !3, line: 400, type: !58)
!1080 = !DILocalVariable(name: "src_v4", scope: !1073, file: !3, line: 401, type: !58)
!1081 = !DILocalVariable(name: "i", scope: !1073, file: !3, line: 402, type: !107)
!1082 = !DILocalVariable(name: "next_v4", scope: !1083, file: !3, line: 405, type: !58)
