; ModuleID = 'edt_pacer_vlan.c'
source_filename = "edt_pacer_vlan.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { [2 x i32]*, [4096 x i32]*, i32*, %struct.edt_val* }
%struct.edt_val = type { i64, i64, i64, i64, %struct.codel_state, [8 x i8] }
%struct.codel_state = type { i64, i64, i32, i32 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32, i32 }
%struct.collect_vlans = type { [2 x i16] }
%struct.hdr_cursor = type { i8* }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.vlan_hdr = type { i16, i16 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@time_delay_map = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !24

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 11, type: !174, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !23, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "edt_pacer_vlan.c", directory: "/home/nir_ophir/code/bpf-examples/traffic-pacing-edt", checksumkind: CSK_MD5, checksum: "7173192a7898e6f990c953e6d4ba5c8f")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_ret_code", file: !6, line: 4255, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/nir_ophir/code/bpf-examples/traffic-pacing-edt", checksumkind: CSK_MD5, checksum: "686704d11802f5f210143bc29244c61a")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "BPF_OK", value: 0)
!10 = !DIEnumerator(name: "BPF_DROP", value: 2)
!11 = !DIEnumerator(name: "BPF_REDIRECT", value: 7)
!12 = !DIEnumerator(name: "BPF_LWT_REROUTE", value: 128)
!13 = !{!14, !15, !16, !19, !21}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !18)
!17 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!18 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !22)
!22 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!23 = !{!0, !24, !58, !66, !71}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "time_delay_map", scope: !2, file: !3, line: 69, type: !26, isLocal: false, isDefinition: true)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 63, size: 256, elements: !27)
!27 = !{!28, !34, !39, !42}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !3, line: 64, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !{!33}
!33 = !DISubrange(count: 2)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !26, file: !3, line: 65, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 131072, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 4096)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !26, file: !3, line: 66, baseType: !40, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !7)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !26, file: !3, line: 67, baseType: !43, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edt_val", file: !3, line: 53, size: 512, align: 512, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !44, file: !3, line: 54, baseType: !21, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "t_last", scope: !44, file: !3, line: 55, baseType: !21, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "t_horizon_drop", scope: !44, file: !3, line: 56, baseType: !21, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "t_horizon_ecn", scope: !44, file: !3, line: 57, baseType: !21, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "codel", scope: !44, file: !3, line: 58, baseType: !51, size: 192, offset: 256)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "codel_state", file: !52, line: 17, size: 192, elements: !53)
!52 = !DIFile(filename: "./codel_impl.h", directory: "/home/nir_ophir/code/bpf-examples/traffic-pacing-edt", checksumkind: CSK_MD5, checksum: "8586c19d570218be89ad8dfbe04da526")
!53 = !{!54, !55, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "first_above_time", scope: !51, file: !52, line: 19, baseType: !21, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "drop_next", scope: !51, file: !52, line: 20, baseType: !21, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !51, file: !52, line: 21, baseType: !41, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dropping", scope: !51, file: !52, line: 22, baseType: !41, size: 32, offset: 160)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !60, line: 55, type: !61, isLocal: true, isDefinition: true)
!60 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/nir_ophir/code/bpf-examples/traffic-pacing-edt", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!14, !14, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "bpf_ktime_get_boot_ns", scope: !2, file: !60, line: 3031, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!21}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "bpf_skb_ecn_set_ce", scope: !2, file: !60, line: 2436, type: !73, isLocal: true, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!15, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 4183, size: 1472, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !95, !96, !97, !98, !99, !100, !101, !102, !103, !107, !108, !109, !110, !111, !148, !149, !150, !151, !173}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !77, file: !6, line: 4184, baseType: !41, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !77, file: !6, line: 4185, baseType: !41, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !77, file: !6, line: 4186, baseType: !41, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !77, file: !6, line: 4187, baseType: !41, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !77, file: !6, line: 4188, baseType: !41, size: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !77, file: !6, line: 4189, baseType: !41, size: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !77, file: !6, line: 4190, baseType: !41, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !77, file: !6, line: 4191, baseType: !41, size: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !77, file: !6, line: 4192, baseType: !41, size: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !77, file: !6, line: 4193, baseType: !41, size: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !77, file: !6, line: 4194, baseType: !41, size: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !77, file: !6, line: 4195, baseType: !41, size: 32, offset: 352)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !77, file: !6, line: 4196, baseType: !92, size: 160, offset: 384)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 5)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !77, file: !6, line: 4197, baseType: !41, size: 32, offset: 544)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !77, file: !6, line: 4198, baseType: !41, size: 32, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !6, line: 4199, baseType: !41, size: 32, offset: 608)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !77, file: !6, line: 4200, baseType: !41, size: 32, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !77, file: !6, line: 4201, baseType: !41, size: 32, offset: 672)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !77, file: !6, line: 4204, baseType: !41, size: 32, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !77, file: !6, line: 4205, baseType: !41, size: 32, offset: 736)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !77, file: !6, line: 4206, baseType: !41, size: 32, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !77, file: !6, line: 4207, baseType: !104, size: 128, offset: 800)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !77, file: !6, line: 4208, baseType: !104, size: 128, offset: 928)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !77, file: !6, line: 4209, baseType: !41, size: 32, offset: 1056)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !77, file: !6, line: 4210, baseType: !41, size: 32, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !77, file: !6, line: 4213, baseType: !41, size: 32, offset: 1120)
!111 = !DIDerivedType(tag: DW_TAG_member, scope: !77, file: !6, line: 4214, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !77, file: !6, line: 4214, size: 64, align: 64, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !112, file: !6, line: 4214, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !6, line: 5041, size: 448, elements: !117)
!117 = !{!118, !119, !120, !121, !124, !125, !126, !127, !130, !131, !132, !146, !147}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !116, file: !6, line: 5042, baseType: !16, size: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !116, file: !6, line: 5043, baseType: !16, size: 16, offset: 16)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !116, file: !6, line: 5044, baseType: !16, size: 16, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !116, file: !6, line: 5045, baseType: !122, size: 8, offset: 48)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !123)
!123 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !116, file: !6, line: 5046, baseType: !122, size: 8, offset: 56)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !116, file: !6, line: 5047, baseType: !122, size: 8, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !116, file: !6, line: 5048, baseType: !122, size: 8, offset: 72)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !116, file: !6, line: 5049, baseType: !128, size: 16, offset: 80)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !129, line: 25, baseType: !16)
!129 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !116, file: !6, line: 5050, baseType: !128, size: 16, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !116, file: !6, line: 5051, baseType: !128, size: 16, offset: 112)
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !6, line: 5052, baseType: !133, size: 256, offset: 128)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !6, line: 5052, size: 256, elements: !134)
!134 = !{!135, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !133, file: !6, line: 5053, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !133, file: !6, line: 5053, size: 64, elements: !137)
!137 = !{!138, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !136, file: !6, line: 5054, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !129, line: 27, baseType: !41)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !136, file: !6, line: 5055, baseType: !139, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !133, file: !6, line: 5057, baseType: !142, size: 256)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !133, file: !6, line: 5057, size: 256, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !142, file: !6, line: 5058, baseType: !104, size: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !142, file: !6, line: 5059, baseType: !104, size: 128, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !116, file: !6, line: 5062, baseType: !41, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !116, file: !6, line: 5063, baseType: !139, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !77, file: !6, line: 4215, baseType: !21, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !77, file: !6, line: 4216, baseType: !41, size: 32, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !77, file: !6, line: 4217, baseType: !41, size: 32, offset: 1312)
!151 = !DIDerivedType(tag: DW_TAG_member, scope: !77, file: !6, line: 4218, baseType: !152, size: 64, align: 64, offset: 1344)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !77, file: !6, line: 4218, size: 64, align: 64, elements: !153)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !152, file: !6, line: 4218, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 4272, size: 640, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !156, file: !6, line: 4273, baseType: !41, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !156, file: !6, line: 4274, baseType: !41, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !6, line: 4275, baseType: !41, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !156, file: !6, line: 4276, baseType: !41, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !156, file: !6, line: 4277, baseType: !41, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !156, file: !6, line: 4278, baseType: !41, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !156, file: !6, line: 4280, baseType: !41, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !156, file: !6, line: 4281, baseType: !104, size: 128, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !156, file: !6, line: 4282, baseType: !41, size: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !156, file: !6, line: 4283, baseType: !41, size: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !156, file: !6, line: 4284, baseType: !41, size: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !156, file: !6, line: 4285, baseType: !104, size: 128, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !6, line: 4286, baseType: !41, size: 32, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !156, file: !6, line: 4287, baseType: !172, size: 32, offset: 608)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !17, line: 26, baseType: !31)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !77, file: !6, line: 4219, baseType: !41, size: 32, offset: 1408)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 32, elements: !105)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!176 = !{i32 7, !"Dwarf Version", i32 5}
!177 = !{i32 2, !"Debug Info Version", i32 3}
!178 = !{i32 1, !"wchar_size", i32 4}
!179 = !{i32 7, !"frame-pointer", i32 2}
!180 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!181 = distinct !DISubprogram(name: "tc_edt_vlan", scope: !3, file: !3, line: 246, type: !182, scopeLine: 247, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !184)
!182 = !DISubroutineType(types: !183)
!183 = !{!31, !76}
!184 = !{!185, !186, !187, !188, !194, !205, !206, !207, !211, !212}
!185 = !DILocalVariable(name: "skb", arg: 1, scope: !181, file: !3, line: 246, type: !76)
!186 = !DILocalVariable(name: "data", scope: !181, file: !3, line: 248, type: !14)
!187 = !DILocalVariable(name: "data_end", scope: !181, file: !3, line: 249, type: !14)
!188 = !DILocalVariable(name: "vlans", scope: !181, file: !3, line: 250, type: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !190, line: 71, size: 32, elements: !191)
!190 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/nir_ophir/code/bpf-examples/traffic-pacing-edt", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !189, file: !190, line: 72, baseType: !193, size: 32)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !32)
!194 = !DILocalVariable(name: "eth", scope: !181, file: !3, line: 251, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !197, line: 168, size: 112, elements: !198)
!197 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!198 = !{!199, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !196, file: !197, line: 169, baseType: !200, size: 48)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 6)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !196, file: !197, line: 170, baseType: !200, size: 48, offset: 48)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !196, file: !197, line: 171, baseType: !128, size: 16, offset: 96)
!205 = !DILocalVariable(name: "ret", scope: !181, file: !3, line: 252, type: !31)
!206 = !DILocalVariable(name: "vlan_key", scope: !181, file: !3, line: 253, type: !16)
!207 = !DILocalVariable(name: "nh", scope: !181, file: !3, line: 256, type: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !190, line: 35, size: 64, elements: !209)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !208, file: !190, line: 36, baseType: !14, size: 64)
!211 = !DILocalVariable(name: "eth_type", scope: !181, file: !3, line: 257, type: !31)
!212 = !DILabel(scope: !181, name: "out", file: !3, line: 280)
!213 = !DILocation(line: 0, scope: !181)
!214 = !DILocation(line: 248, column: 38, scope: !181)
!215 = !{!216, !217, i64 76}
!216 = !{!"__sk_buff", !217, i64 0, !217, i64 4, !217, i64 8, !217, i64 12, !217, i64 16, !217, i64 20, !217, i64 24, !217, i64 28, !217, i64 32, !217, i64 36, !217, i64 40, !217, i64 44, !218, i64 48, !217, i64 68, !217, i64 72, !217, i64 76, !217, i64 80, !217, i64 84, !217, i64 88, !217, i64 92, !217, i64 96, !218, i64 100, !218, i64 116, !217, i64 132, !217, i64 136, !217, i64 140, !218, i64 144, !220, i64 152, !217, i64 160, !217, i64 164, !218, i64 168, !217, i64 176}
!217 = !{!"int", !218, i64 0}
!218 = !{!"omnipotent char", !219, i64 0}
!219 = !{!"Simple C/C++ TBAA"}
!220 = !{!"long long", !218, i64 0}
!221 = !DILocation(line: 248, column: 27, scope: !181)
!222 = !DILocation(line: 248, column: 19, scope: !181)
!223 = !DILocation(line: 249, column: 38, scope: !181)
!224 = !{!216, !217, i64 80}
!225 = !DILocation(line: 249, column: 27, scope: !181)
!226 = !DILocation(line: 249, column: 19, scope: !181)
!227 = !DILocation(line: 250, column: 23, scope: !181)
!228 = !DILocalVariable(name: "nh", arg: 1, scope: !229, file: !190, line: 86, type: !232)
!229 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !190, file: !190, line: 86, type: !230, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !235)
!230 = !DISubroutineType(types: !231)
!231 = !{!31, !232, !14, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!235 = !{!228, !236, !237, !238, !239, !240, !241, !247, !248}
!236 = !DILocalVariable(name: "data_end", arg: 2, scope: !229, file: !190, line: 87, type: !14)
!237 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !229, file: !190, line: 88, type: !233)
!238 = !DILocalVariable(name: "vlans", arg: 4, scope: !229, file: !190, line: 89, type: !234)
!239 = !DILocalVariable(name: "eth", scope: !229, file: !190, line: 91, type: !195)
!240 = !DILocalVariable(name: "hdrsize", scope: !229, file: !190, line: 92, type: !31)
!241 = !DILocalVariable(name: "vlh", scope: !229, file: !190, line: 93, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !190, line: 44, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !243, file: !190, line: 45, baseType: !128, size: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !243, file: !190, line: 46, baseType: !128, size: 16, offset: 16)
!247 = !DILocalVariable(name: "h_proto", scope: !229, file: !190, line: 94, type: !16)
!248 = !DILocalVariable(name: "i", scope: !229, file: !190, line: 95, type: !31)
!249 = !DILocation(line: 0, scope: !229, inlinedAt: !250)
!250 = distinct !DILocation(line: 260, column: 13, scope: !181)
!251 = !DILocation(line: 100, column: 14, scope: !252, inlinedAt: !250)
!252 = distinct !DILexicalBlock(scope: !229, file: !190, line: 100, column: 6)
!253 = !DILocation(line: 100, column: 24, scope: !252, inlinedAt: !250)
!254 = !DILocation(line: 100, column: 6, scope: !229, inlinedAt: !250)
!255 = !DILocation(line: 104, column: 10, scope: !229, inlinedAt: !250)
!256 = !DILocation(line: 106, column: 17, scope: !229, inlinedAt: !250)
!257 = !{!258, !259, i64 12}
!258 = !{!"ethhdr", !218, i64 0, !218, i64 6, !259, i64 12}
!259 = !{!"short", !218, i64 0}
!260 = !DILocalVariable(name: "h_proto", arg: 1, scope: !261, file: !190, line: 75, type: !16)
!261 = distinct !DISubprogram(name: "proto_is_vlan", scope: !190, file: !190, line: 75, type: !262, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{!31, !16}
!264 = !{!260}
!265 = !DILocation(line: 0, scope: !261, inlinedAt: !266)
!266 = distinct !DILocation(line: 113, column: 8, scope: !267, inlinedAt: !250)
!267 = distinct !DILexicalBlock(scope: !268, file: !190, line: 113, column: 7)
!268 = distinct !DILexicalBlock(scope: !269, file: !190, line: 112, column: 39)
!269 = distinct !DILexicalBlock(scope: !270, file: !190, line: 112, column: 2)
!270 = distinct !DILexicalBlock(scope: !229, file: !190, line: 112, column: 2)
!271 = !DILocation(line: 77, column: 20, scope: !261, inlinedAt: !266)
!272 = !DILocation(line: 77, column: 46, scope: !261, inlinedAt: !266)
!273 = !DILocation(line: 113, column: 8, scope: !267, inlinedAt: !250)
!274 = !DILocation(line: 113, column: 7, scope: !268, inlinedAt: !250)
!275 = !DILocation(line: 119, column: 18, scope: !268, inlinedAt: !250)
!276 = !{!277, !259, i64 2}
!277 = !{!"vlan_hdr", !259, i64 0, !259, i64 2}
!278 = !DILocation(line: 122, column: 6, scope: !279, inlinedAt: !250)
!279 = distinct !DILexicalBlock(scope: !268, file: !190, line: 120, column: 7)
!280 = !{!277, !259, i64 0}
!281 = !DILocation(line: 122, column: 33, scope: !279, inlinedAt: !250)
!282 = !DILocation(line: 121, column: 4, scope: !279, inlinedAt: !250)
!283 = !DILocation(line: 265, column: 15, scope: !284)
!284 = distinct !DILexicalBlock(scope: !181, file: !3, line: 265, column: 6)
!285 = !DILocation(line: 265, column: 6, scope: !181)
!286 = !DILocation(line: 270, column: 26, scope: !287)
!287 = distinct !DILexicalBlock(scope: !181, file: !3, line: 270, column: 6)
!288 = !DILocation(line: 0, scope: !261, inlinedAt: !289)
!289 = distinct !DILocation(line: 270, column: 7, scope: !287)
!290 = !DILocation(line: 77, column: 20, scope: !261, inlinedAt: !289)
!291 = !DILocation(line: 77, column: 46, scope: !261, inlinedAt: !289)
!292 = !{!216, !217, i64 20}
!293 = !DILocation(line: 270, column: 35, scope: !287)
!294 = !DILocalVariable(name: "skb", arg: 1, scope: !295, file: !3, line: 223, type: !76)
!295 = distinct !DISubprogram(name: "extract_vlan_key", scope: !3, file: !3, line: 223, type: !296, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{!16, !76, !234}
!298 = !{!294, !299, !300}
!299 = !DILocalVariable(name: "vlans", arg: 2, scope: !295, file: !3, line: 223, type: !234)
!300 = !DILocalVariable(name: "QinQ", scope: !295, file: !3, line: 225, type: !31)
!301 = !DILocation(line: 0, scope: !295, inlinedAt: !302)
