; ModuleID = 'xdp_synproxy_kern.c'
source_filename = "xdp_synproxy_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.5 = type { [2 x i32]*, i32*, i64*, [2 x i32]* }
%struct.anon.6 = type { [2 x i32]*, i32*, i16*, [8 x i32]* }
%struct.bpf_ct_opts___local = type { i32, i32, i8, i8, [2 x i8] }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.tcpopt_context = type { i8*, i8*, i8*, i32*, i8, i8, i8 }
%struct.bpf_sock_tuple = type { %union.anon.7 }
%union.anon.7 = type { %struct.anon.9 }
%struct.anon.9 = type { [4 x i32], [4 x i32], i16, i16 }
%struct.header_pointers = type { %struct.ethhdr*, %struct.iphdr*, %struct.ipv6hdr*, %struct.tcphdr*, i16 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.1 }
%union.anon.1 = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.anon.8 = type { i32, i32, i16, i16 }
%struct.nf_conn = type { i64 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@values = dso_local global %struct.anon.5 zeroinitializer, section ".maps", align 8, !dbg !141

!6 = !DIFile(filename: "../lib/../headers/vmlinux/vmlinux_common.h", directory: "/home/nir_ophir/code/bpf-examples/xdp-synproxy", checksumkind: CSK_MD5, checksum: "fe54e2fe2896290c2e19cb453f905c6e")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0)
!10 = !DIEnumerator(name: "true", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !12, line: 4363, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/nir_ophir/code/bpf-examples/xdp-synproxy", checksumkind: CSK_MD5, checksum: "686704d11802f5f210143bc29244c61a")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!15 = !DIEnumerator(name: "XDP_DROP", value: 1)
!16 = !DIEnumerator(name: "XDP_PASS", value: 2)
!17 = !DIEnumerator(name: "XDP_TX", value: 3)
!18 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 28, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!22 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!23 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!24 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!25 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!26 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!27 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!28 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!29 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!30 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!31 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!32 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!33 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!34 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!35 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!36 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!37 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!38 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!39 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!40 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!41 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!42 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!43 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!44 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!45 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!46 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!47 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!48 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!49 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ip_conntrack_status", file: !51, line: 142, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "../lib/../headers/vmlinux/vmlinux_net.h", directory: "/home/nir_ophir/code/bpf-examples/xdp-synproxy", checksumkind: CSK_MD5, checksum: "6dd6460408b99e70437a781d8b60ad8c")
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "IPS_CONFIRMED_BIT", value: 3)
!54 = !DIEnumerator(name: "IPS_CONFIRMED", value: 8)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 72, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!58 = !DIEnumerator(name: "TCP_FLAG_CWR", value: 32768)
!59 = !DIEnumerator(name: "TCP_FLAG_ECE", value: 16384)
!60 = !DIEnumerator(name: "TCP_FLAG_URG", value: 8192)
!61 = !DIEnumerator(name: "TCP_FLAG_ACK", value: 4096)
!62 = !DIEnumerator(name: "TCP_FLAG_PSH", value: 2048)
!63 = !DIEnumerator(name: "TCP_FLAG_RST", value: 1024)
!64 = !DIEnumerator(name: "TCP_FLAG_SYN", value: 512)
!65 = !DIEnumerator(name: "TCP_FLAG_FIN", value: 256)
!66 = !DIEnumerator(name: "TCP_RESERVED_BITS", value: 15)
!67 = !DIEnumerator(name: "TCP_DATA_OFFSET", value: 240)
!68 = !{!69, !70, !71, !74, !75, !78, !92, !111}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !72, line: 24, baseType: !73)
!72 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !72, line: 27, baseType: !7)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !72, line: 21, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !3, line: 235, size: 32, elements: !109)
!81 = distinct !DISubprogram(name: "tscookie_tcpopt_parse", scope: !3, file: !3, line: 197, type: !82, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !100)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !85}
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcpopt_context", file: !3, line: 187, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !95, !96, !99}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !86, file: !3, line: 188, baseType: !75, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !86, file: !3, line: 189, baseType: !75, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !86, file: !3, line: 190, baseType: !69, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tsecr", scope: !86, file: !3, line: 191, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !94, line: 27, baseType: !74)
!94 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "wscale", scope: !86, file: !3, line: 192, baseType: !76, size: 8, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "option_timestamp", scope: !86, file: !3, line: 193, baseType: !97, size: 8, offset: 264)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !6, line: 9, baseType: !98)
!98 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "option_sack", scope: !86, file: !3, line: 194, baseType: !97, size: 8, offset: 272)
!100 = !{!101, !102, !103, !104}
!101 = !DILocalVariable(name: "ctx", arg: 1, scope: !81, file: !3, line: 197, type: !85)
!102 = !DILocalVariable(name: "opcode", scope: !81, file: !3, line: 199, type: !76)
!103 = !DILocalVariable(name: "opsize", scope: !81, file: !3, line: 199, type: !76)
!104 = !DILocalVariable(name: "__pptr", scope: !105, file: !3, line: 235, type: !78)
!105 = distinct !DILexicalBlock(scope: !106, file: !3, line: 235, column: 18)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 232, column: 85)
!107 = distinct !DILexicalBlock(scope: !108, file: !3, line: 232, column: 7)
!108 = distinct !DILexicalBlock(scope: !81, file: !3, line: 226, column: 18)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !80, file: !3, line: 235, baseType: !93, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tcp_word_hdr", file: !56, line: 65, size: 160, elements: !113)
!113 = !{!114, !136}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !112, file: !56, line: 66, baseType: !115, size: 160)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !56, line: 25, size: 160, elements: !116)
!116 = !{!117, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !135}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !115, file: !56, line: 26, baseType: !118, size: 16)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !94, line: 25, baseType: !71)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !115, file: !56, line: 27, baseType: !118, size: 16, offset: 16)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !115, file: !56, line: 28, baseType: !93, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !115, file: !56, line: 29, baseType: !93, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !115, file: !56, line: 31, baseType: !71, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !115, file: !56, line: 32, baseType: !71, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !115, file: !56, line: 33, baseType: !71, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !115, file: !56, line: 34, baseType: !71, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !115, file: !56, line: 35, baseType: !71, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !115, file: !56, line: 36, baseType: !71, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !115, file: !56, line: 37, baseType: !71, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !115, file: !56, line: 38, baseType: !71, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !115, file: !56, line: 39, baseType: !71, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !115, file: !56, line: 40, baseType: !71, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !115, file: !56, line: 55, baseType: !118, size: 16, offset: 112)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !115, file: !56, line: 56, baseType: !134, size: 16, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !94, line: 31, baseType: !71)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !115, file: !56, line: 57, baseType: !118, size: 16, offset: 144)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !112, file: !56, line: 67, baseType: !137, size: 160)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 5)
!140 = !{!0, !141, !157, !170, !178, !192, !200, !232, !279, !284, !289, !294}
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "values", scope: !2, file: !3, line: 79, type: !143, isLocal: false, isDefinition: true)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 74, size: 256, elements: !144)
!144 = !{!145, !150, !152, !156}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !3, line: 75, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !143, file: !3, line: 76, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !143, file: !3, line: 77, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !72, line: 31, baseType: !155)
!155 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !143, file: !3, line: 78, baseType: !146, size: 64, offset: 192)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "allowed_ports", scope: !2, file: !3, line: 86, type: !159, isLocal: false, isDefinition: true)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 81, size: 256, elements: !160)
!160 = !{!161, !162, !163, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !3, line: 82, baseType: !146, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !159, file: !3, line: 83, baseType: !151, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !159, file: !3, line: 84, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !159, file: !3, line: 85, baseType: !166, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 8)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !172, line: 55, type: !173, isLocal: true, isDefinition: true)
!172 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/nir_ophir/code/bpf-examples/xdp-synproxy", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!69, !69, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_tail", scope: !2, file: !172, line: 1708, type: !180, isLocal: true, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!70, !183, !84}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !12, line: 4374, size: 192, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !12, line: 4375, baseType: !74, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !184, file: !12, line: 4376, baseType: !74, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !184, file: !12, line: 4377, baseType: !74, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !184, file: !12, line: 4379, baseType: !74, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !184, file: !12, line: 4380, baseType: !74, size: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !184, file: !12, line: 4382, baseType: !74, size: 32, offset: 160)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !172, line: 790, type: !194, isLocal: true, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !92, !74, !92, !74, !199}
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !72, line: 30, baseType: !198)
!198 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !51, line: 4, baseType: !74)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "bpf_tcp_raw_gen_syncookie_ipv4", scope: !2, file: !172, line: 4526, type: !202, isLocal: true, isDefinition: true)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!197, !205, !231, !74}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !207, line: 87, size: 160, elements: !208)
!207 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !206, file: !207, line: 89, baseType: !76, size: 4, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !206, file: !207, line: 90, baseType: !76, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !206, file: !207, line: 97, baseType: !76, size: 8, offset: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !206, file: !207, line: 98, baseType: !118, size: 16, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !206, file: !207, line: 99, baseType: !118, size: 16, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !206, file: !207, line: 100, baseType: !118, size: 16, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !206, file: !207, line: 101, baseType: !76, size: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !206, file: !207, line: 102, baseType: !76, size: 8, offset: 72)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !206, file: !207, line: 103, baseType: !134, size: 16, offset: 80)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !206, file: !207, line: 104, baseType: !219, size: 64, offset: 96)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !207, line: 104, size: 64, elements: !220)
!220 = !{!221, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !207, line: 104, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !207, line: 104, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !222, file: !207, line: 104, baseType: !93, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !222, file: !207, line: 104, baseType: !93, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !219, file: !207, line: 104, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !207, line: 104, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !227, file: !207, line: 104, baseType: !93, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !227, file: !207, line: 104, baseType: !93, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "bpf_tcp_raw_gen_syncookie_ipv6", scope: !2, file: !172, line: 4552, type: !234, isLocal: true, isDefinition: true)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!197, !237, !231, !74}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !239, line: 118, size: 320, elements: !240)
!239 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "4f074a871dc410c98906d34687654389")
!240 = !{!241, !242, !243, !247, !248, !249, !250}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !238, file: !239, line: 120, baseType: !76, size: 4, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !238, file: !239, line: 121, baseType: !76, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !238, file: !239, line: 128, baseType: !244, size: 24, offset: 8)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !238, file: !239, line: 130, baseType: !118, size: 16, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !238, file: !239, line: 131, baseType: !76, size: 8, offset: 48)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !238, file: !239, line: 132, baseType: !76, size: 8, offset: 56)
!250 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !239, line: 134, baseType: !251, size: 256, offset: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !239, line: 134, size: 256, elements: !252)
!252 = !{!253, !274}
!253 = !DIDerivedType(tag: DW_TAG_member, scope: !251, file: !239, line: 134, baseType: !254, size: 256)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !239, line: 134, size: 256, elements: !255)
!255 = !{!256, !273}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !254, file: !239, line: 134, baseType: !257, size: 128)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !258, line: 33, size: 128, elements: !259)
!258 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !257, file: !258, line: 40, baseType: !261, size: 128)
!261 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !258, line: 34, size: 128, elements: !262)
!262 = !{!263, !267, !269}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !261, file: !258, line: 35, baseType: !264, size: 128)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !261, file: !258, line: 37, baseType: !268, size: 128)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, elements: !168)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !261, file: !258, line: 38, baseType: !270, size: 128)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 4)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !254, file: !239, line: 134, baseType: !257, size: 128, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !251, file: !239, line: 134, baseType: !275, size: 256)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !239, line: 134, size: 256, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !275, file: !239, line: 134, baseType: !257, size: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !275, file: !239, line: 134, baseType: !257, size: 128, offset: 128)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "bpf_loop", scope: !2, file: !172, line: 4192, type: !281, isLocal: true, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!70, !74, !69, !69, !154}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !172, line: 113, type: !286, isLocal: true, isDefinition: true)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!154}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "bpf_tcp_raw_check_syncookie_ipv4", scope: !2, file: !172, line: 4571, type: !291, isLocal: true, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!70, !205, !231}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "bpf_tcp_raw_check_syncookie_ipv6", scope: !2, file: !172, line: 4592, type: !296, isLocal: true, isDefinition: true)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!70, !237, !231}
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 32, elements: !271)
!300 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nf_conn", file: !51, line: 138, size: 64, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !301, file: !51, line: 139, baseType: !304, size: 64)
!304 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_ct_opts___local", file: !3, line: 92, size: 96, elements: !306)
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "netns_id", scope: !305, file: !3, line: 93, baseType: !84, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !305, file: !3, line: 94, baseType: !84, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "l4proto", scope: !305, file: !3, line: 95, baseType: !76, size: 8, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !305, file: !3, line: 96, baseType: !76, size: 8, offset: 72)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !305, file: !3, line: 97, baseType: !312, size: 16, offset: 80)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !148)
!313 = !{i32 7, !"Dwarf Version", i32 5}
!314 = !{i32 2, !"Debug Info Version", i32 3}
!315 = !{i32 1, !"wchar_size", i32 4}
!316 = !{i32 7, !"frame-pointer", i32 2}
!317 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!318 = distinct !DISubprogram(name: "syncookie_xdp", scope: !3, file: !3, line: 784, type: !319, scopeLine: 785, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !321)
!319 = !DISubroutineType(types: !320)
!320 = !{!84, !183}
!321 = !{!322, !323, !324, !325, !343}
!322 = !DILocalVariable(name: "ctx", arg: 1, scope: !318, file: !3, line: 784, type: !183)
!323 = !DILocalVariable(name: "data_end", scope: !318, file: !3, line: 786, type: !69)
!324 = !DILocalVariable(name: "data", scope: !318, file: !3, line: 787, type: !69)
!325 = !DILocalVariable(name: "hdr", scope: !318, file: !3, line: 788, type: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "header_pointers", file: !3, line: 347, size: 320, elements: !327)
!327 = !{!328, !339, !340, !341, !342}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "eth", scope: !326, file: !3, line: 348, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !331, line: 168, size: 112, elements: !332)
!331 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!332 = !{!333, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !330, file: !331, line: 169, baseType: !334, size: 48)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 48, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 6)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !330, file: !331, line: 170, baseType: !334, size: 48, offset: 48)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !330, file: !331, line: 171, baseType: !118, size: 16, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !326, file: !3, line: 349, baseType: !205, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !326, file: !3, line: 350, baseType: !237, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !326, file: !3, line: 351, baseType: !231, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_len", scope: !326, file: !3, line: 352, baseType: !71, size: 16, offset: 256)
!343 = !DILocalVariable(name: "ret", scope: !318, file: !3, line: 789, type: !84)
!344 = !DILocation(line: 788, column: 25, scope: !318)
!345 = !DILocation(line: 0, scope: !318)
!346 = !DILocation(line: 786, column: 38, scope: !318)
!347 = !{!348, !349, i64 4}
!348 = !{!"xdp_md", !349, i64 0, !349, i64 4, !349, i64 8, !349, i64 12, !349, i64 16, !349, i64 20}
!349 = !{!"int", !350, i64 0}
!350 = !{!"omnipotent char", !351, i64 0}
!351 = !{!"Simple C/C++ TBAA"}
!352 = !DILocation(line: 786, column: 27, scope: !318)
!353 = !DILocation(line: 786, column: 19, scope: !318)
!354 = !DILocation(line: 787, column: 34, scope: !318)
!355 = !{!348, !349, i64 0}
!356 = !DILocation(line: 787, column: 23, scope: !318)
!357 = !DILocation(line: 787, column: 15, scope: !318)
!358 = !DILocalVariable(name: "ctx", arg: 1, scope: !359, file: !3, line: 716, type: !69)
!359 = distinct !DISubprogram(name: "syncookie_part1", scope: !3, file: !3, line: 716, type: !360, scopeLine: 718, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !363)
!360 = !DISubroutineType(types: !361)
!361 = !{!84, !69, !69, !69, !362, !97}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!363 = !{!358, !364, !365, !366, !367, !368}
!364 = !DILocalVariable(name: "data", arg: 2, scope: !359, file: !3, line: 716, type: !69)
!365 = !DILocalVariable(name: "data_end", arg: 3, scope: !359, file: !3, line: 716, type: !69)
!366 = !DILocalVariable(name: "hdr", arg: 4, scope: !359, file: !3, line: 717, type: !362)
!367 = !DILocalVariable(name: "xdp", arg: 5, scope: !359, file: !3, line: 717, type: !97)
!368 = !DILocalVariable(name: "ret", scope: !359, file: !3, line: 719, type: !84)
!369 = !DILocation(line: 0, scope: !359, inlinedAt: !370)
!370 = distinct !DILocation(line: 791, column: 8, scope: !318)
!371 = !DILocalVariable(name: "data", arg: 1, scope: !372, file: !3, line: 355, type: !69)
!372 = distinct !DISubprogram(name: "tcp_dissect", scope: !3, file: !3, line: 355, type: !373, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{!84, !69, !69, !362}
!375 = !{!371, !376, !377}
!376 = !DILocalVariable(name: "data_end", arg: 2, scope: !372, file: !3, line: 355, type: !69)
!377 = !DILocalVariable(name: "hdr", arg: 3, scope: !372, file: !3, line: 356, type: !362)
!378 = !DILocation(line: 0, scope: !372, inlinedAt: !379)
!379 = distinct !DILocation(line: 721, column: 8, scope: !359, inlinedAt: !370)
!380 = !DILocation(line: 359, column: 15, scope: !381, inlinedAt: !379)
!381 = distinct !DILexicalBlock(scope: !372, file: !3, line: 359, column: 6)
!382 = !DILocation(line: 359, column: 19, scope: !381, inlinedAt: !379)
!383 = !DILocation(line: 359, column: 6, scope: !372, inlinedAt: !379)
!384 = !DILocation(line: 362, column: 10, scope: !372, inlinedAt: !379)
!385 = !{!386, !387, i64 12}
!386 = !{!"ethhdr", !350, i64 0, !350, i64 6, !387, i64 12}
!387 = !{!"short", !350, i64 0}
!388 = !DILocation(line: 362, column: 2, scope: !372, inlinedAt: !379)
!389 = !DILocation(line: 366, column: 13, scope: !390, inlinedAt: !379)
!390 = distinct !DILexicalBlock(scope: !372, file: !3, line: 362, column: 40)
!391 = !DILocation(line: 367, column: 17, scope: !392, inlinedAt: !379)
!392 = distinct !DILexicalBlock(scope: !390, file: !3, line: 367, column: 7)
!393 = !DILocation(line: 367, column: 21, scope: !392, inlinedAt: !379)
!394 = !DILocation(line: 367, column: 7, scope: !390, inlinedAt: !379)
!395 = !DILocation(line: 369, column: 18, scope: !396, inlinedAt: !379)
!396 = distinct !DILexicalBlock(scope: !390, file: !3, line: 369, column: 7)
!397 = !DILocation(line: 369, column: 22, scope: !396, inlinedAt: !379)
!398 = !DILocation(line: 369, column: 26, scope: !396, inlinedAt: !379)
!399 = !DILocation(line: 369, column: 7, scope: !390, inlinedAt: !379)
!400 = !DILocation(line: 374, column: 18, scope: !401, inlinedAt: !379)
!401 = distinct !DILexicalBlock(scope: !390, file: !3, line: 374, column: 7)
!402 = !{!403, !350, i64 9}
!403 = !{!"iphdr", !350, i64 0, !350, i64 0, !350, i64 1, !387, i64 2, !387, i64 4, !387, i64 6, !350, i64 8, !350, i64 9, !387, i64 10, !350, i64 12}
!404 = !DILocation(line: 374, column: 27, scope: !401, inlinedAt: !379)
!405 = !DILocation(line: 374, column: 7, scope: !390, inlinedAt: !379)
!406 = !DILocation(line: 377, column: 32, scope: !390, inlinedAt: !379)
!407 = !DILocation(line: 378, column: 3, scope: !390, inlinedAt: !379)
!408 = !DILocation(line: 382, column: 13, scope: !390, inlinedAt: !379)
!409 = !DILocation(line: 383, column: 17, scope: !410, inlinedAt: !379)
!410 = distinct !DILexicalBlock(scope: !390, file: !3, line: 383, column: 7)
!411 = !DILocation(line: 383, column: 21, scope: !410, inlinedAt: !379)
!412 = !DILocation(line: 383, column: 7, scope: !390, inlinedAt: !379)
!413 = !DILocation(line: 385, column: 18, scope: !414, inlinedAt: !379)
!414 = distinct !DILexicalBlock(scope: !390, file: !3, line: 385, column: 7)
!415 = !DILocation(line: 385, column: 26, scope: !414, inlinedAt: !379)
!416 = !DILocation(line: 385, column: 7, scope: !390, inlinedAt: !379)
!417 = !DILocation(line: 391, column: 18, scope: !418, inlinedAt: !379)
!418 = distinct !DILexicalBlock(scope: !390, file: !3, line: 391, column: 7)
!419 = !{!420, !350, i64 6}
!420 = !{!"ipv6hdr", !350, i64 0, !350, i64 0, !350, i64 1, !387, i64 4, !350, i64 6, !350, i64 7, !350, i64 8}
!421 = !DILocation(line: 391, column: 26, scope: !418, inlinedAt: !379)
!422 = !DILocation(line: 391, column: 7, scope: !390, inlinedAt: !379)
!423 = !DILocation(line: 0, scope: !390, inlinedAt: !379)
!424 = !DILocation(line: 401, column: 15, scope: !425, inlinedAt: !379)
!425 = distinct !DILexicalBlock(scope: !372, file: !3, line: 401, column: 6)
!426 = !DILocation(line: 401, column: 19, scope: !425, inlinedAt: !379)
!427 = !DILocation(line: 401, column: 6, scope: !372, inlinedAt: !379)
!428 = !DILocation(line: 403, column: 27, scope: !372, inlinedAt: !379)
!429 = !DILocation(line: 403, column: 32, scope: !372, inlinedAt: !379)
!430 = !DILocation(line: 404, column: 19, scope: !431, inlinedAt: !379)
!431 = distinct !DILexicalBlock(scope: !372, file: !3, line: 404, column: 6)
!432 = !DILocalVariable(name: "ctx", arg: 1, scope: !433, file: !3, line: 410, type: !69)
!433 = distinct !DISubprogram(name: "tcp_lookup", scope: !3, file: !3, line: 410, type: !434, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!84, !69, !362, !97}
!436 = !{!432, !437, !438, !439, !440, !460, !462, !463}
!437 = !DILocalVariable(name: "hdr", arg: 2, scope: !433, file: !3, line: 410, type: !362)
!438 = !DILocalVariable(name: "xdp", arg: 3, scope: !433, file: !3, line: 410, type: !97)
!439 = !DILocalVariable(name: "ct_lookup_opts", scope: !433, file: !3, line: 412, type: !305)
!440 = !DILocalVariable(name: "tup", scope: !433, file: !3, line: 416, type: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock_tuple", file: !12, line: 4335, size: 288, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !12, line: 4336, baseType: !444, size: 288)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !12, line: 4336, size: 288, elements: !445)
!445 = !{!446, !453}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !444, file: !12, line: 4342, baseType: !447, size: 96)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !12, line: 4337, size: 96, elements: !448)
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !447, file: !12, line: 4338, baseType: !93, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !447, file: !12, line: 4339, baseType: !93, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !447, file: !12, line: 4340, baseType: !118, size: 16, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !447, file: !12, line: 4341, baseType: !118, size: 16, offset: 80)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !444, file: !12, line: 4348, baseType: !454, size: 288)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !12, line: 4343, size: 288, elements: !455)
!455 = !{!456, !457, !458, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !454, file: !12, line: 4344, baseType: !270, size: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !454, file: !12, line: 4345, baseType: !270, size: 128, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !454, file: !12, line: 4346, baseType: !118, size: 16, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !454, file: !12, line: 4347, baseType: !118, size: 16, offset: 272)
!460 = !DILocalVariable(name: "ct", scope: !433, file: !3, line: 417, type: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!462 = !DILocalVariable(name: "tup_size", scope: !433, file: !3, line: 418, type: !74)
!463 = !DILocalVariable(name: "status", scope: !464, file: !3, line: 447, type: !304)
!464 = distinct !DILexicalBlock(scope: !465, file: !3, line: 446, column: 10)
!465 = distinct !DILexicalBlock(scope: !433, file: !3, line: 446, column: 6)
!466 = !DILocation(line: 0, scope: !433, inlinedAt: !467)
!467 = distinct !DILocation(line: 725, column: 8, scope: !359, inlinedAt: !370)
!468 = !DILocation(line: 412, column: 2, scope: !433, inlinedAt: !467)
!469 = !DILocation(line: 412, column: 29, scope: !433, inlinedAt: !467)
!470 = !DILocation(line: 416, column: 2, scope: !433, inlinedAt: !467)
!471 = !DILocation(line: 416, column: 24, scope: !433, inlinedAt: !467)
!472 = !DILocation(line: 420, column: 6, scope: !473, inlinedAt: !467)
!473 = distinct !DILexicalBlock(scope: !433, file: !3, line: 420, column: 6)
!474 = !DILocation(line: 420, column: 6, scope: !433, inlinedAt: !467)
!475 = !DILocation(line: 424, column: 19, scope: !476, inlinedAt: !467)
!476 = distinct !DILexicalBlock(scope: !477, file: !3, line: 424, column: 7)
!477 = distinct !DILexicalBlock(scope: !473, file: !3, line: 420, column: 17)
!478 = !{!403, !387, i64 6}
!479 = !DILocation(line: 424, column: 28, scope: !476, inlinedAt: !467)
!480 = !DILocation(line: 424, column: 68, scope: !476, inlinedAt: !467)
!481 = !DILocation(line: 424, column: 7, scope: !477, inlinedAt: !467)
!482 = !DILocation(line: 427, column: 31, scope: !477, inlinedAt: !467)
!483 = !{!350, !350, i64 0}
!484 = !DILocation(line: 427, column: 7, scope: !477, inlinedAt: !467)
!485 = !DILocation(line: 427, column: 12, scope: !477, inlinedAt: !467)
!486 = !DILocation(line: 427, column: 18, scope: !477, inlinedAt: !467)
!487 = !DILocation(line: 428, column: 31, scope: !477, inlinedAt: !467)
!488 = !DILocation(line: 428, column: 12, scope: !477, inlinedAt: !467)
!489 = !DILocation(line: 428, column: 18, scope: !477, inlinedAt: !467)
!490 = !DILocation(line: 429, column: 30, scope: !477, inlinedAt: !467)
!491 = !{!492, !387, i64 0}
!492 = !{!"tcphdr", !387, i64 0, !387, i64 2, !349, i64 4, !349, i64 8, !387, i64 12, !387, i64 12, !387, i64 13, !387, i64 13, !387, i64 13, !387, i64 13, !387, i64 13, !387, i64 13, !387, i64 13, !387, i64 13, !387, i64 14, !387, i64 16, !387, i64 18}
!493 = !DILocation(line: 429, column: 12, scope: !477, inlinedAt: !467)
!494 = !DILocation(line: 429, column: 18, scope: !477, inlinedAt: !467)
!495 = !DILocation(line: 430, column: 30, scope: !477, inlinedAt: !467)
!496 = !{!492, !387, i64 2}
!497 = !DILocation(line: 430, column: 12, scope: !477, inlinedAt: !467)
!498 = !DILocation(line: 430, column: 18, scope: !477, inlinedAt: !467)
!499 = !DILocation(line: 432, column: 2, scope: !477, inlinedAt: !467)
!500 = !DILocation(line: 432, column: 13, scope: !501, inlinedAt: !467)
!501 = distinct !DILexicalBlock(scope: !473, file: !3, line: 432, column: 13)
!502 = !DILocation(line: 432, column: 13, scope: !473, inlinedAt: !467)
!503 = !DILocation(line: 433, column: 48, scope: !504, inlinedAt: !467)
!504 = distinct !DILexicalBlock(scope: !501, file: !3, line: 432, column: 24)
!505 = !DILocation(line: 433, column: 3, scope: !504, inlinedAt: !467)
!506 = !DILocation(line: 434, column: 3, scope: !504, inlinedAt: !467)
!507 = !DILocation(line: 434, column: 48, scope: !504, inlinedAt: !467)
!508 = !DILocation(line: 435, column: 30, scope: !504, inlinedAt: !467)
!509 = !DILocation(line: 435, column: 12, scope: !504, inlinedAt: !467)
!510 = !DILocation(line: 435, column: 18, scope: !504, inlinedAt: !467)
!511 = !DILocation(line: 436, column: 30, scope: !504, inlinedAt: !467)
!512 = !DILocation(line: 436, column: 12, scope: !504, inlinedAt: !467)
