; ModuleID = 'preserve_dscp_kern.c'
source_filename = "preserve_dscp_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { [9 x i32]*, i32*, i8*, [16384 x i32]* }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon.8 }
%union.anon.8 = type { %struct.anon.9 }
%struct.anon.9 = type { i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.4 }
%union.anon.4 = type { %struct.anon.5 }
%struct.anon.5 = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.6 }
%union.anon.6 = type { [4 x i32] }

@flow_dscps = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flow_dscps", scope: !2, file: !3, line: 17, type: !155, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !22, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "preserve_dscp_kern.c", directory: "/home/nir_ophir/code/bpf-examples/preserve-dscp", checksumkind: CSK_MD5, checksum: "1b528ab107863058b7df36fec9d2c031")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 397, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/nir_ophir/code/bpf-examples/preserve-dscp", checksumkind: CSK_MD5, checksum: "686704d11802f5f210143bc29244c61a")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "BPF_ANY", value: 0)
!10 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!11 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!12 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!13 = !{!14, !15, !16, !19, !20}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !18)
!17 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!18 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{!23, !0, !28, !133, !137, !145, !150}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 122, type: !25, isLocal: false, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 4)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "bpf_get_hash_recalc", scope: !2, file: !30, line: 923, type: !31, isLocal: true, isDefinition: true)
!30 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/nir_ophir/code/bpf-examples/preserve-dscp", checksumkind: CSK_MD5, checksum: "32b0945df61015e3dd6be9ac5ea42778")
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !7)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 4183, size: 1472, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !54, !55, !56, !57, !58, !59, !60, !61, !62, !64, !65, !66, !67, !68, !105, !107, !108, !109, !132}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !6, line: 4184, baseType: !34, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !36, file: !6, line: 4185, baseType: !34, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !36, file: !6, line: 4186, baseType: !34, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !36, file: !6, line: 4187, baseType: !34, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !36, file: !6, line: 4188, baseType: !34, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !36, file: !6, line: 4189, baseType: !34, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !36, file: !6, line: 4190, baseType: !34, size: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !36, file: !6, line: 4191, baseType: !34, size: 32, offset: 224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !36, file: !6, line: 4192, baseType: !34, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !36, file: !6, line: 4193, baseType: !34, size: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !36, file: !6, line: 4194, baseType: !34, size: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !36, file: !6, line: 4195, baseType: !34, size: 32, offset: 352)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !36, file: !6, line: 4196, baseType: !51, size: 160, offset: 384)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 5)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !36, file: !6, line: 4197, baseType: !34, size: 32, offset: 544)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !36, file: !6, line: 4198, baseType: !34, size: 32, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !6, line: 4199, baseType: !34, size: 32, offset: 608)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !36, file: !6, line: 4200, baseType: !34, size: 32, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !36, file: !6, line: 4201, baseType: !34, size: 32, offset: 672)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !36, file: !6, line: 4204, baseType: !34, size: 32, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !36, file: !6, line: 4205, baseType: !34, size: 32, offset: 736)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !36, file: !6, line: 4206, baseType: !34, size: 32, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !36, file: !6, line: 4207, baseType: !63, size: 128, offset: 800)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 128, elements: !26)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !36, file: !6, line: 4208, baseType: !63, size: 128, offset: 928)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !36, file: !6, line: 4209, baseType: !34, size: 32, offset: 1056)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !36, file: !6, line: 4210, baseType: !34, size: 32, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !36, file: !6, line: 4213, baseType: !34, size: 32, offset: 1120)
!68 = !DIDerivedType(tag: DW_TAG_member, scope: !36, file: !6, line: 4214, baseType: !69, size: 64, align: 64, offset: 1152)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !6, line: 4214, size: 64, align: 64, elements: !70)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !69, file: !6, line: 4214, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !6, line: 5041, size: 448, elements: !74)
!74 = !{!75, !76, !77, !78, !81, !82, !83, !84, !87, !88, !89, !103, !104}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !73, file: !6, line: 5042, baseType: !16, size: 16)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !73, file: !6, line: 5043, baseType: !16, size: 16, offset: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !73, file: !6, line: 5044, baseType: !16, size: 16, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !73, file: !6, line: 5045, baseType: !79, size: 8, offset: 48)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !80)
!80 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !73, file: !6, line: 5046, baseType: !79, size: 8, offset: 56)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !73, file: !6, line: 5047, baseType: !79, size: 8, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !73, file: !6, line: 5048, baseType: !79, size: 8, offset: 72)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !73, file: !6, line: 5049, baseType: !85, size: 16, offset: 80)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !86, line: 25, baseType: !16)
!86 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !73, file: !6, line: 5050, baseType: !85, size: 16, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !73, file: !6, line: 5051, baseType: !85, size: 16, offset: 112)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !6, line: 5052, baseType: !90, size: 256, offset: 128)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !6, line: 5052, size: 256, elements: !91)
!91 = !{!92, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, scope: !90, file: !6, line: 5053, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !6, line: 5053, size: 64, elements: !94)
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !93, file: !6, line: 5054, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !86, line: 27, baseType: !34)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !93, file: !6, line: 5055, baseType: !96, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, scope: !90, file: !6, line: 5057, baseType: !99, size: 256)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !6, line: 5057, size: 256, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !99, file: !6, line: 5058, baseType: !63, size: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !99, file: !6, line: 5059, baseType: !63, size: 128, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !6, line: 5062, baseType: !34, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !73, file: !6, line: 5063, baseType: !96, size: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !36, file: !6, line: 4215, baseType: !106, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !15)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !36, file: !6, line: 4216, baseType: !34, size: 32, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !36, file: !6, line: 4217, baseType: !34, size: 32, offset: 1312)
!109 = !DIDerivedType(tag: DW_TAG_member, scope: !36, file: !6, line: 4218, baseType: !110, size: 64, align: 64, offset: 1344)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !6, line: 4218, size: 64, align: 64, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !110, file: !6, line: 4218, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 4272, size: 640, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !114, file: !6, line: 4273, baseType: !34, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !114, file: !6, line: 4274, baseType: !34, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !6, line: 4275, baseType: !34, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !114, file: !6, line: 4276, baseType: !34, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !114, file: !6, line: 4277, baseType: !34, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !114, file: !6, line: 4278, baseType: !34, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !114, file: !6, line: 4280, baseType: !34, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !114, file: !6, line: 4281, baseType: !63, size: 128, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !114, file: !6, line: 4282, baseType: !34, size: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !114, file: !6, line: 4283, baseType: !34, size: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !114, file: !6, line: 4284, baseType: !34, size: 32, offset: 416)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !114, file: !6, line: 4285, baseType: !63, size: 128, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !6, line: 4286, baseType: !34, size: 32, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !114, file: !6, line: 4287, baseType: !130, size: 32, offset: 608)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !17, line: 26, baseType: !131)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !36, file: !6, line: 4219, baseType: !34, size: 32, offset: 1408)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "ip_only", scope: !2, file: !3, line: 19, type: !135, isLocal: true, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !30, line: 77, type: !139, isLocal: true, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !14, !143, !143, !106}
!142 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !30, line: 87, type: !147, isLocal: true, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!142, !14, !143}
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !30, line: 55, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!14, !14, !143}
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 12, size: 256, elements: !156)
!156 = !{!157, !162, !164, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !3, line: 13, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 288, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 9)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !155, file: !3, line: 14, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !155, file: !3, line: 15, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !155, file: !3, line: 16, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 524288, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 16384)
!171 = !{i32 7, !"Dwarf Version", i32 5}
!172 = !{i32 2, !"Debug Info Version", i32 3}
!173 = !{i32 1, !"wchar_size", i32 4}
!174 = !{i32 7, !"frame-pointer", i32 2}
!175 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!176 = distinct !DISubprogram(name: "read_dscp", scope: !3, file: !3, line: 95, type: !177, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{!131, !35}
!179 = !{!180, !181, !182}
!180 = !DILocalVariable(name: "skb", arg: 1, scope: !176, file: !3, line: 95, type: !35)
!181 = !DILocalVariable(name: "key", scope: !176, file: !3, line: 97, type: !34)
!182 = !DILocalVariable(name: "dscp", scope: !176, file: !3, line: 98, type: !79)
!183 = !DILocation(line: 0, scope: !176)
!184 = !DILocation(line: 97, column: 2, scope: !176)
!185 = !DILocation(line: 97, column: 14, scope: !176)
!186 = !DILocation(line: 97, column: 8, scope: !176)
!187 = !{!188, !188, i64 0}
!188 = !{!"int", !189, i64 0}
!189 = !{!"omnipotent char", !190, i64 0}
!190 = !{!"Simple C/C++ TBAA"}
!191 = !DILocation(line: 98, column: 2, scope: !176)
!192 = !DILocalVariable(name: "skb", arg: 1, scope: !193, file: !3, line: 21, type: !35)
!193 = distinct !DISubprogram(name: "get_dscp", scope: !3, file: !3, line: 21, type: !194, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !196)
!194 = !DISubroutineType(types: !195)
!195 = !{!79, !35}
!196 = !{!192, !197, !198, !199, !204, !247, !275, !286}
!197 = !DILocalVariable(name: "data_end", scope: !193, file: !3, line: 23, type: !14)
!198 = !DILocalVariable(name: "data", scope: !193, file: !3, line: 24, type: !14)
!199 = !DILocalVariable(name: "nh", scope: !193, file: !3, line: 25, type: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !201, line: 35, size: 64, elements: !202)
!201 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/nir_ophir/code/bpf-examples/preserve-dscp", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !200, file: !201, line: 36, baseType: !14, size: 64)
!204 = !DILocalVariable(name: "ipv6hdr", scope: !193, file: !3, line: 27, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !207, line: 118, size: 320, elements: !208)
!207 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "4f074a871dc410c98906d34687654389")
!208 = !{!209, !210, !211, !215, !216, !217, !218}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !206, file: !207, line: 120, baseType: !79, size: 4, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !206, file: !207, line: 121, baseType: !79, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !206, file: !207, line: 128, baseType: !212, size: 24, offset: 8)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 24, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !206, file: !207, line: 130, baseType: !85, size: 16, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !206, file: !207, line: 131, baseType: !79, size: 8, offset: 48)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !206, file: !207, line: 132, baseType: !79, size: 8, offset: 56)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !206, file: !207, line: 134, baseType: !219, size: 256, offset: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !207, line: 134, size: 256, elements: !220)
!220 = !{!221, !242}
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !207, line: 134, baseType: !222, size: 256)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !207, line: 134, size: 256, elements: !223)
!223 = !{!224, !241}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !222, file: !207, line: 134, baseType: !225, size: 128)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !226, line: 33, size: 128, elements: !227)
!226 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !225, file: !226, line: 40, baseType: !229, size: 128)
!229 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !226, line: 34, size: 128, elements: !230)
!230 = !{!231, !235, !239}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !229, file: !226, line: 35, baseType: !232, size: 128)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !229, file: !226, line: 37, baseType: !236, size: 128)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !229, file: !226, line: 38, baseType: !240, size: 128)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !26)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !222, file: !207, line: 134, baseType: !225, size: 128, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !219, file: !207, line: 134, baseType: !243, size: 256)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !207, line: 134, size: 256, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !243, file: !207, line: 134, baseType: !225, size: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !243, file: !207, line: 134, baseType: !225, size: 128, offset: 128)
!247 = !DILocalVariable(name: "iphdr", scope: !193, file: !3, line: 28, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !250, line: 87, size: 160, elements: !251)
!250 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !262}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !249, file: !250, line: 89, baseType: !79, size: 4, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !249, file: !250, line: 90, baseType: !79, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !249, file: !250, line: 97, baseType: !79, size: 8, offset: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !249, file: !250, line: 98, baseType: !85, size: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !249, file: !250, line: 99, baseType: !85, size: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !249, file: !250, line: 100, baseType: !85, size: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !249, file: !250, line: 101, baseType: !79, size: 8, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !249, file: !250, line: 102, baseType: !79, size: 8, offset: 72)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !249, file: !250, line: 103, baseType: !261, size: 16, offset: 80)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !86, line: 31, baseType: !16)
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !250, line: 104, baseType: !263, size: 64, offset: 96)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !250, line: 104, size: 64, elements: !264)
!264 = !{!265, !270}
!265 = !DIDerivedType(tag: DW_TAG_member, scope: !263, file: !250, line: 104, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !250, line: 104, size: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !266, file: !250, line: 104, baseType: !96, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !266, file: !250, line: 104, baseType: !96, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !263, file: !250, line: 104, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !250, line: 104, size: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !271, file: !250, line: 104, baseType: !96, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !271, file: !250, line: 104, baseType: !96, size: 32, offset: 32)
!275 = !DILocalVariable(name: "eth", scope: !193, file: !3, line: 29, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !278, line: 168, size: 112, elements: !279)
!278 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!279 = !{!280, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !277, file: !278, line: 169, baseType: !281, size: 48)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 48, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 6)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !277, file: !278, line: 170, baseType: !281, size: 48, offset: 48)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !277, file: !278, line: 171, baseType: !85, size: 16, offset: 96)
!286 = !DILocalVariable(name: "eth_type", scope: !193, file: !3, line: 30, type: !131)
!287 = !DILocation(line: 0, scope: !193, inlinedAt: !288)
!288 = distinct !DILocation(line: 100, column: 9, scope: !176)
!289 = !DILocation(line: 23, column: 52, scope: !193, inlinedAt: !288)
!290 = !{!291, !188, i64 80}
!291 = !{!"__sk_buff", !188, i64 0, !188, i64 4, !188, i64 8, !188, i64 12, !188, i64 16, !188, i64 20, !188, i64 24, !188, i64 28, !188, i64 32, !188, i64 36, !188, i64 40, !188, i64 44, !189, i64 48, !188, i64 68, !188, i64 72, !188, i64 76, !188, i64 80, !188, i64 84, !188, i64 88, !188, i64 92, !188, i64 96, !189, i64 100, !189, i64 116, !188, i64 132, !188, i64 136, !188, i64 140, !189, i64 144, !292, i64 152, !188, i64 160, !188, i64 164, !189, i64 168, !188, i64 176}
!292 = !{!"long long", !189, i64 0}
!293 = !DILocation(line: 23, column: 27, scope: !193, inlinedAt: !288)
!294 = !DILocation(line: 23, column: 19, scope: !193, inlinedAt: !288)
!295 = !DILocation(line: 24, column: 48, scope: !193, inlinedAt: !288)
!296 = !{!291, !188, i64 76}
!297 = !DILocation(line: 24, column: 23, scope: !193, inlinedAt: !288)
!298 = !DILocation(line: 24, column: 15, scope: !193, inlinedAt: !288)
!299 = !DILocation(line: 32, column: 7, scope: !300, inlinedAt: !288)
!300 = distinct !DILexicalBlock(scope: !193, file: !3, line: 32, column: 6)
!301 = !DILocation(line: 32, column: 6, scope: !193, inlinedAt: !288)
!302 = !DILocalVariable(name: "nh", arg: 1, scope: !303, file: !201, line: 131, type: !306)
!303 = distinct !DISubprogram(name: "parse_ethhdr", scope: !201, file: !201, line: 131, type: !304, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!304 = !DISubroutineType(types: !305)
!305 = !{!131, !306, !14, !307}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!308 = !{!302, !309, !310}
!309 = !DILocalVariable(name: "data_end", arg: 2, scope: !303, file: !201, line: 132, type: !14)
!310 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !303, file: !201, line: 133, type: !307)
!311 = !DILocation(line: 0, scope: !303, inlinedAt: !312)
!312 = distinct !DILocation(line: 34, column: 14, scope: !313, inlinedAt: !288)
!313 = distinct !DILexicalBlock(scope: !300, file: !3, line: 32, column: 16)
!314 = !DILocalVariable(name: "nh", arg: 1, scope: !315, file: !201, line: 86, type: !306)
!315 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !201, file: !201, line: 86, type: !316, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!316 = !DISubroutineType(types: !317)
!317 = !{!131, !306, !14, !307, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !201, line: 71, size: 32, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !319, file: !201, line: 72, baseType: !322, size: 32)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 2)
!325 = !{!314, !326, !327, !328, !329, !330, !331, !337, !338}
!326 = !DILocalVariable(name: "data_end", arg: 2, scope: !315, file: !201, line: 87, type: !14)
!327 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !315, file: !201, line: 88, type: !307)
!328 = !DILocalVariable(name: "vlans", arg: 4, scope: !315, file: !201, line: 89, type: !318)
!329 = !DILocalVariable(name: "eth", scope: !315, file: !201, line: 91, type: !276)
!330 = !DILocalVariable(name: "hdrsize", scope: !315, file: !201, line: 92, type: !131)
!331 = !DILocalVariable(name: "vlh", scope: !315, file: !201, line: 93, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !201, line: 44, size: 32, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !333, file: !201, line: 45, baseType: !85, size: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !333, file: !201, line: 46, baseType: !85, size: 16, offset: 16)
!337 = !DILocalVariable(name: "h_proto", scope: !315, file: !201, line: 94, type: !16)
!338 = !DILocalVariable(name: "i", scope: !315, file: !201, line: 95, type: !131)
!339 = !DILocation(line: 0, scope: !315, inlinedAt: !340)
!340 = distinct !DILocation(line: 136, column: 9, scope: !303, inlinedAt: !312)
!341 = !DILocation(line: 100, column: 14, scope: !342, inlinedAt: !340)
!342 = distinct !DILexicalBlock(scope: !315, file: !201, line: 100, column: 6)
!343 = !DILocation(line: 100, column: 24, scope: !342, inlinedAt: !340)
!344 = !DILocation(line: 100, column: 6, scope: !315, inlinedAt: !340)
!345 = !DILocation(line: 106, column: 17, scope: !315, inlinedAt: !340)
!346 = !{!347, !347, i64 0}
!347 = !{!"short", !189, i64 0}
!348 = !DILocalVariable(name: "h_proto", arg: 1, scope: !349, file: !201, line: 75, type: !16)
!349 = distinct !DISubprogram(name: "proto_is_vlan", scope: !201, file: !201, line: 75, type: !350, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{!131, !16}
!352 = !{!348}
!353 = !DILocation(line: 0, scope: !349, inlinedAt: !354)
!354 = distinct !DILocation(line: 113, column: 8, scope: !355, inlinedAt: !340)
!355 = distinct !DILexicalBlock(scope: !356, file: !201, line: 113, column: 7)
!356 = distinct !DILexicalBlock(scope: !357, file: !201, line: 112, column: 39)
!357 = distinct !DILexicalBlock(scope: !358, file: !201, line: 112, column: 2)
!358 = distinct !DILexicalBlock(scope: !315, file: !201, line: 112, column: 2)
!359 = !DILocation(line: 77, column: 20, scope: !349, inlinedAt: !354)
!360 = !DILocation(line: 77, column: 46, scope: !349, inlinedAt: !354)
!361 = !DILocation(line: 113, column: 8, scope: !355, inlinedAt: !340)
!362 = !DILocation(line: 113, column: 7, scope: !356, inlinedAt: !340)
!363 = !DILocation(line: 119, column: 18, scope: !356, inlinedAt: !340)
!364 = !DILocation(line: 35, column: 39, scope: !365, inlinedAt: !288)
!365 = distinct !DILexicalBlock(scope: !313, file: !3, line: 35, column: 7)
!366 = !DILocation(line: 25, column: 25, scope: !193, inlinedAt: !288)
!367 = !DILocalVariable(name: "nh", arg: 1, scope: !368, file: !201, line: 196, type: !306)
!368 = distinct !DISubprogram(name: "parse_iphdr", scope: !201, file: !201, line: 196, type: !369, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !372)
!369 = !DISubroutineType(types: !370)
!370 = !{!131, !306, !14, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!372 = !{!367, !373, !374, !375, !376}
!373 = !DILocalVariable(name: "data_end", arg: 2, scope: !368, file: !201, line: 197, type: !14)
!374 = !DILocalVariable(name: "iphdr", arg: 3, scope: !368, file: !201, line: 198, type: !371)
!375 = !DILocalVariable(name: "iph", scope: !368, file: !201, line: 200, type: !248)
!376 = !DILocalVariable(name: "hdrsize", scope: !368, file: !201, line: 201, type: !131)
!377 = !DILocation(line: 0, scope: !368, inlinedAt: !378)
!378 = distinct !DILocation(line: 39, column: 6, scope: !379, inlinedAt: !288)
!379 = distinct !DILexicalBlock(scope: !193, file: !3, line: 39, column: 6)
!380 = !DILocation(line: 203, column: 10, scope: !381, inlinedAt: !378)
!381 = distinct !DILexicalBlock(scope: !368, file: !201, line: 203, column: 6)
!382 = !DILocation(line: 203, column: 14, scope: !381, inlinedAt: !378)
!383 = !DILocation(line: 203, column: 6, scope: !368, inlinedAt: !378)
!384 = !DILocation(line: 206, column: 11, scope: !385, inlinedAt: !378)
!385 = distinct !DILexicalBlock(scope: !368, file: !201, line: 206, column: 6)
!386 = !DILocation(line: 206, column: 19, scope: !385, inlinedAt: !378)
!387 = !DILocation(line: 206, column: 6, scope: !368, inlinedAt: !378)
!388 = !DILocation(line: 209, column: 21, scope: !368, inlinedAt: !378)
!389 = !DILocation(line: 211, column: 13, scope: !390, inlinedAt: !378)
!390 = distinct !DILexicalBlock(scope: !368, file: !201, line: 211, column: 5)
!391 = !DILocation(line: 211, column: 5, scope: !368, inlinedAt: !378)
!392 = !DILocation(line: 215, column: 14, scope: !393, inlinedAt: !378)
!393 = distinct !DILexicalBlock(scope: !368, file: !201, line: 215, column: 6)
!394 = !DILocation(line: 215, column: 24, scope: !393, inlinedAt: !378)
!395 = !DILocation(line: 215, column: 6, scope: !368, inlinedAt: !378)
!396 = !DILocation(line: 221, column: 14, scope: !368, inlinedAt: !378)
!397 = !{!398, !189, i64 9}
!398 = !{!"iphdr", !189, i64 0, !189, i64 0, !189, i64 1, !347, i64 2, !347, i64 4, !347, i64 6, !189, i64 8, !189, i64 9, !347, i64 10, !189, i64 12}
!399 = !DILocation(line: 39, column: 41, scope: !379, inlinedAt: !288)
!400 = !DILocation(line: 39, column: 6, scope: !193, inlinedAt: !288)
!401 = !DILocation(line: 40, column: 17, scope: !379, inlinedAt: !288)
!402 = !{!398, !189, i64 1}
!403 = !DILocation(line: 40, column: 21, scope: !379, inlinedAt: !288)
!404 = !DILocation(line: 40, column: 3, scope: !379, inlinedAt: !288)
!405 = !DILocalVariable(name: "nh", arg: 1, scope: !406, file: !201, line: 174, type: !306)
!406 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !201, file: !201, line: 174, type: !407, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!407 = !DISubroutineType(types: !408)
!408 = !{!131, !306, !14, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!410 = !{!405, !411, !412, !413}
!411 = !DILocalVariable(name: "data_end", arg: 2, scope: !406, file: !201, line: 175, type: !14)
!412 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !406, file: !201, line: 176, type: !409)
!413 = !DILocalVariable(name: "ip6h", scope: !406, file: !201, line: 178, type: !205)
!414 = !DILocation(line: 0, scope: !406, inlinedAt: !415)
!415 = distinct !DILocation(line: 42, column: 11, scope: !416, inlinedAt: !288)
!416 = distinct !DILexicalBlock(scope: !379, file: !3, line: 42, column: 11)
!417 = !DILocation(line: 184, column: 11, scope: !418, inlinedAt: !415)
!418 = distinct !DILexicalBlock(scope: !406, file: !201, line: 184, column: 6)
!419 = !DILocation(line: 184, column: 15, scope: !418, inlinedAt: !415)
!420 = !DILocation(line: 184, column: 6, scope: !406, inlinedAt: !415)
!421 = !DILocation(line: 187, column: 12, scope: !422, inlinedAt: !415)
!422 = distinct !DILexicalBlock(scope: !406, file: !201, line: 187, column: 6)
!423 = !DILocation(line: 187, column: 20, scope: !422, inlinedAt: !415)
!424 = !DILocation(line: 187, column: 6, scope: !406, inlinedAt: !415)
!425 = !DILocation(line: 193, column: 44, scope: !406, inlinedAt: !415)
!426 = !{!427, !189, i64 6}
!427 = !{!"ipv6hdr", !189, i64 0, !189, i64 0, !189, i64 1, !347, i64 4, !189, i64 6, !189, i64 7, !189, i64 8}
!428 = !DILocalVariable(name: "nh", arg: 1, scope: !429, file: !201, line: 139, type: !306)
!429 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !201, file: !201, line: 139, type: !430, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{!131, !306, !14, !79}
!432 = !{!428, !433, !434, !435, !437}
!433 = !DILocalVariable(name: "data_end", arg: 2, scope: !429, file: !201, line: 140, type: !14)
!434 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !429, file: !201, line: 141, type: !79)
!435 = !DILocalVariable(name: "i", scope: !436, file: !201, line: 143, type: !131)
!436 = distinct !DILexicalBlock(scope: !429, file: !201, line: 143, column: 2)
!437 = !DILocalVariable(name: "hdr", scope: !438, file: !201, line: 144, type: !440)
!438 = distinct !DILexicalBlock(scope: !439, file: !201, line: 143, column: 47)
!439 = distinct !DILexicalBlock(scope: !436, file: !201, line: 143, column: 2)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !207, line: 63, size: 16, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !441, file: !207, line: 64, baseType: !79, size: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !441, file: !207, line: 65, baseType: !79, size: 8, offset: 8)
!445 = !DILocation(line: 0, scope: !429, inlinedAt: !446)
!446 = distinct !DILocation(line: 193, column: 9, scope: !406, inlinedAt: !415)
!447 = !DILocation(line: 0, scope: !436, inlinedAt: !446)
!448 = !DILocation(line: 0, scope: !438, inlinedAt: !446)
!449 = !DILocation(line: 146, column: 11, scope: !450, inlinedAt: !446)
!450 = distinct !DILexicalBlock(scope: !438, file: !201, line: 146, column: 7)
!451 = !DILocation(line: 146, column: 15, scope: !450, inlinedAt: !446)
!452 = !DILocation(line: 146, column: 7, scope: !438, inlinedAt: !446)
!453 = !DILocation(line: 149, column: 3, scope: !438, inlinedAt: !446)
!454 = !DILocation(line: 160, column: 4, scope: !455, inlinedAt: !446)
!455 = distinct !DILexicalBlock(scope: !438, file: !201, line: 149, column: 26)
!456 = !DILocation(line: 0, scope: !455, inlinedAt: !446)
!457 = !{!458, !189, i64 1}
!458 = !{!"ipv6_opt_hdr", !189, i64 0, !189, i64 1}
!459 = !{!458, !189, i64 0}
!460 = !DILocation(line: 156, column: 4, scope: !455, inlinedAt: !446)
!461 = !DILocation(line: 42, column: 49, scope: !416, inlinedAt: !288)
!462 = !DILocation(line: 42, column: 11, scope: !379, inlinedAt: !288)
!463 = !DILocation(line: 43, column: 10, scope: !416, inlinedAt: !288)
!464 = !DILocation(line: 43, column: 3, scope: !416, inlinedAt: !288)
!465 = !DILocation(line: 100, column: 7, scope: !176)
!466 = !{!189, !189, i64 0}
!467 = !DILocation(line: 101, column: 6, scope: !468)
!468 = distinct !DILexicalBlock(scope: !176, file: !3, line: 101, column: 6)
!469 = !DILocation(line: 101, column: 6, scope: !176)
!470 = !DILocation(line: 102, column: 3, scope: !468)
!471 = !DILocation(line: 104, column: 3, scope: !468)
!472 = !DILocation(line: 107, column: 1, scope: !176)
!473 = !DILocation(line: 106, column: 2, scope: !176)
!474 = distinct !DISubprogram(name: "write_dscp", scope: !3, file: !3, line: 110, type: !177, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !475)
!475 = !{!476, !477, !478}
!476 = !DILocalVariable(name: "skb", arg: 1, scope: !474, file: !3, line: 110, type: !35)
!477 = !DILocalVariable(name: "key", scope: !474, file: !3, line: 112, type: !34)
!478 = !DILocalVariable(name: "dscp", scope: !474, file: !3, line: 113, type: !165)
!479 = !DILocation(line: 0, scope: !474)
!480 = !DILocation(line: 112, column: 2, scope: !474)
!481 = !DILocation(line: 112, column: 19, scope: !474)
!482 = !{!291, !188, i64 68}
!483 = !DILocation(line: 112, column: 8, scope: !474)
!484 = !DILocation(line: 115, column: 9, scope: !474)
!485 = !DILocation(line: 116, column: 6, scope: !486)
!486 = distinct !DILexicalBlock(scope: !474, file: !3, line: 116, column: 6)
!487 = !DILocation(line: 116, column: 6, scope: !474)
!488 = !DILocation(line: 117, column: 17, scope: !486)
!489 = !DILocalVariable(name: "skb", arg: 1, scope: !490, file: !3, line: 72, type: !35)
!490 = distinct !DISubprogram(name: "set_dscp", scope: !3, file: !3, line: 72, type: !491, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !35, !79}
!493 = !{!489, !494, !495, !496, !497, !498, !499, !500, !501}
!494 = !DILocalVariable(name: "dscp", arg: 2, scope: !490, file: !3, line: 72, type: !79)
!495 = !DILocalVariable(name: "data_end", scope: !490, file: !3, line: 74, type: !14)
!496 = !DILocalVariable(name: "data", scope: !490, file: !3, line: 75, type: !14)
!497 = !DILocalVariable(name: "nh", scope: !490, file: !3, line: 76, type: !200)
!498 = !DILocalVariable(name: "ipv6hdr", scope: !490, file: !3, line: 78, type: !205)
!499 = !DILocalVariable(name: "iphdr", scope: !490, file: !3, line: 79, type: !248)
!500 = !DILocalVariable(name: "eth", scope: !490, file: !3, line: 80, type: !276)
