; ModuleID = 'lsm-nobpf-kern.c'
source_filename = "lsm-nobpf-kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%union.bpf_attr = type { %struct.anon.2 }
%struct.anon.2 = type { i32, i32, i64, i64, i32, i32, i64, i32, i32, [16 x i8], i32, i32, i32, i32, i64, i32, i32, i64, i32, i32, %union.anon.3 }
%union.anon.3 = type { i32 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@seen_pin = dso_local local_unnamed_addr global i32 0, align 4, !dbg !48
@llvm.compiler.used = appending global [2 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (i32 (i64*)* @sys_bpf_hook to i8*)], section "llvm.metadata"

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn
define dso_local i32 @sys_bpf_hook(i64* nocapture noundef readonly %0) #0 section "lsm/bpf" !dbg !60 {
  call void @llvm.dbg.value(metadata i64* %0, metadata !66, metadata !DIExpression()), !dbg !67
  %2 = load i64, i64* %0, align 8, !dbg !68, !tbaa !69
  %3 = trunc i64 %2 to i32, !dbg !68
  call void @llvm.dbg.value(metadata i64* undef, metadata !73, metadata !DIExpression()), !dbg !286
  call void @llvm.dbg.value(metadata i32 %3, metadata !283, metadata !DIExpression()), !dbg !286
  call void @llvm.dbg.value(metadata %union.bpf_attr* undef, metadata !284, metadata !DIExpression()), !dbg !286

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !47, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "lsm-nobpf-kern.c", directory: "/home/nir_ophir/code/bpf-examples/lsm-nobpf", checksumkind: CSK_MD5, checksum: "693fad56be0710d2a08424d63796d85b")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_cmd", file: !6, line: 91, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/nir_ophir/code/bpf-examples/lsm-nobpf", checksumkind: CSK_MD5, checksum: "686704d11802f5f210143bc29244c61a")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!9 = !DIEnumerator(name: "BPF_MAP_CREATE", value: 0)
!10 = !DIEnumerator(name: "BPF_MAP_LOOKUP_ELEM", value: 1)
!11 = !DIEnumerator(name: "BPF_MAP_UPDATE_ELEM", value: 2)
!12 = !DIEnumerator(name: "BPF_MAP_DELETE_ELEM", value: 3)
!13 = !DIEnumerator(name: "BPF_MAP_GET_NEXT_KEY", value: 4)
!14 = !DIEnumerator(name: "BPF_PROG_LOAD", value: 5)
!15 = !DIEnumerator(name: "BPF_OBJ_PIN", value: 6)
!16 = !DIEnumerator(name: "BPF_OBJ_GET", value: 7)
!17 = !DIEnumerator(name: "BPF_PROG_ATTACH", value: 8)
!18 = !DIEnumerator(name: "BPF_PROG_DETACH", value: 9)
!19 = !DIEnumerator(name: "BPF_PROG_TEST_RUN", value: 10)
!20 = !DIEnumerator(name: "BPF_PROG_GET_NEXT_ID", value: 11)
!21 = !DIEnumerator(name: "BPF_MAP_GET_NEXT_ID", value: 12)
!22 = !DIEnumerator(name: "BPF_PROG_GET_FD_BY_ID", value: 13)
!23 = !DIEnumerator(name: "BPF_MAP_GET_FD_BY_ID", value: 14)
!24 = !DIEnumerator(name: "BPF_OBJ_GET_INFO_BY_FD", value: 15)
!25 = !DIEnumerator(name: "BPF_PROG_QUERY", value: 16)
!26 = !DIEnumerator(name: "BPF_RAW_TRACEPOINT_OPEN", value: 17)
!27 = !DIEnumerator(name: "BPF_BTF_LOAD", value: 18)
!28 = !DIEnumerator(name: "BPF_BTF_GET_FD_BY_ID", value: 19)
!29 = !DIEnumerator(name: "BPF_TASK_FD_QUERY", value: 20)
!30 = !DIEnumerator(name: "BPF_MAP_LOOKUP_AND_DELETE_ELEM", value: 21)
!31 = !DIEnumerator(name: "BPF_MAP_FREEZE", value: 22)
!32 = !DIEnumerator(name: "BPF_BTF_GET_NEXT_ID", value: 23)
!33 = !DIEnumerator(name: "BPF_MAP_LOOKUP_BATCH", value: 24)
!34 = !DIEnumerator(name: "BPF_MAP_LOOKUP_AND_DELETE_BATCH", value: 25)
!35 = !DIEnumerator(name: "BPF_MAP_UPDATE_BATCH", value: 26)
!36 = !DIEnumerator(name: "BPF_MAP_DELETE_BATCH", value: 27)
!37 = !DIEnumerator(name: "BPF_LINK_CREATE", value: 28)
!38 = !DIEnumerator(name: "BPF_LINK_UPDATE", value: 29)
!39 = !DIEnumerator(name: "BPF_LINK_GET_FD_BY_ID", value: 30)
!40 = !DIEnumerator(name: "BPF_LINK_GET_NEXT_ID", value: 31)
!41 = !DIEnumerator(name: "BPF_ENABLE_STATS", value: 32)
!42 = !DIEnumerator(name: "BPF_ITER_CREATE", value: 33)
!43 = !DIEnumerator(name: "BPF_LINK_DETACH", value: 34)
!44 = !DIEnumerator(name: "BPF_PROG_BIND_MAP", value: 35)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !{!0, !48}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "seen_pin", scope: !2, file: !3, line: 10, type: !50, isLocal: false, isDefinition: true)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !53)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !{!54}
!54 = !DISubrange(count: 4)
!55 = !{i32 7, !"Dwarf Version", i32 5}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{i32 7, !"frame-pointer", i32 2}
!59 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!60 = distinct !DISubprogram(name: "sys_bpf_hook", scope: !3, file: !3, line: 13, type: !61, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !65)
!61 = !DISubroutineType(types: !62)
!62 = !{!50, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!65 = !{!66}
!66 = !DILocalVariable(name: "ctx", arg: 1, scope: !60, file: !3, line: 13, type: !63)
!67 = !DILocation(line: 0, scope: !60)
!68 = !DILocation(line: 13, column: 5, scope: !60)
!69 = !{!70, !70, i64 0}
!70 = !{!"long long", !71, i64 0}
!71 = !{!"omnipotent char", !72, i64 0}
!72 = !{!"Simple C/C++ TBAA"}
!73 = !DILocalVariable(name: "ctx", arg: 1, scope: !74, file: !3, line: 13, type: !63)
!74 = distinct !DISubprogram(name: "____sys_bpf_hook", scope: !3, file: !3, line: 13, type: !75, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !282)
!75 = !DISubroutineType(types: !76)
!76 = !{!50, !63, !50, !77, !7}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !6, line: 484, size: 960, align: 64, elements: !79)
!79 = !{!80, !101, !113, !124, !152, !158, !166, !183, !196, !202, !211, !216, !224, !236, !256, !263, !267, !271, !276}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 485, baseType: !81, size: 512)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 485, size: 512, elements: !82)
!82 = !{!83, !86, !87, !88, !89, !90, !91, !92, !96, !97, !98, !99, !100}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !81, file: !6, line: 486, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !85, line: 27, baseType: !7)
!85 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!86 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !81, file: !6, line: 487, baseType: !84, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !81, file: !6, line: 488, baseType: !84, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !81, file: !6, line: 489, baseType: !84, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !81, file: !6, line: 490, baseType: !84, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !81, file: !6, line: 493, baseType: !84, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !81, file: !6, line: 494, baseType: !84, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !81, file: !6, line: 497, baseType: !93, size: 128, offset: 224)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 16)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !81, file: !6, line: 498, baseType: !84, size: 32, offset: 352)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !81, file: !6, line: 499, baseType: !84, size: 32, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !81, file: !6, line: 500, baseType: !84, size: 32, offset: 416)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !81, file: !6, line: 501, baseType: !84, size: 32, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !81, file: !6, line: 502, baseType: !84, size: 32, offset: 480)
!101 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 508, baseType: !102, size: 256)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 508, size: 256, elements: !103)
!103 = !{!104, !105, !107, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !102, file: !6, line: 509, baseType: !84, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !102, file: !6, line: 510, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !85, line: 31, baseType: !64)
!107 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !6, line: 511, baseType: !108, size: 64, offset: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !6, line: 511, size: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !108, file: !6, line: 512, baseType: !106, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !108, file: !6, line: 513, baseType: !106, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !102, file: !6, line: 515, baseType: !106, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !78, file: !6, line: 533, baseType: !114, size: 448)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 518, size: 448, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !114, file: !6, line: 519, baseType: !106, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !114, file: !6, line: 522, baseType: !106, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !114, file: !6, line: 523, baseType: !106, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !114, file: !6, line: 524, baseType: !106, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !114, file: !6, line: 525, baseType: !84, size: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !114, file: !6, line: 530, baseType: !84, size: 32, offset: 288)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !114, file: !6, line: 531, baseType: !106, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !6, line: 532, baseType: !106, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 535, baseType: !125, size: 960)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 535, size: 960, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !125, file: !6, line: 536, baseType: !84, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !125, file: !6, line: 537, baseType: !84, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !125, file: !6, line: 538, baseType: !106, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !125, file: !6, line: 539, baseType: !106, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !125, file: !6, line: 540, baseType: !84, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !125, file: !6, line: 541, baseType: !84, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !125, file: !6, line: 542, baseType: !106, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !125, file: !6, line: 543, baseType: !84, size: 32, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !125, file: !6, line: 544, baseType: !84, size: 32, offset: 352)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !125, file: !6, line: 545, baseType: !93, size: 128, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !125, file: !6, line: 546, baseType: !84, size: 32, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !125, file: !6, line: 551, baseType: !84, size: 32, offset: 544)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !125, file: !6, line: 552, baseType: !84, size: 32, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !125, file: !6, line: 553, baseType: !84, size: 32, offset: 608)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !125, file: !6, line: 554, baseType: !106, size: 64, align: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !125, file: !6, line: 555, baseType: !84, size: 32, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !125, file: !6, line: 556, baseType: !84, size: 32, offset: 736)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !125, file: !6, line: 557, baseType: !106, size: 64, align: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_cnt", scope: !125, file: !6, line: 558, baseType: !84, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "attach_btf_id", scope: !125, file: !6, line: 559, baseType: !84, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !6, line: 560, baseType: !148, size: 32, offset: 896)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !6, line: 560, size: 32, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "attach_prog_fd", scope: !148, file: !6, line: 562, baseType: !84, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "attach_btf_obj_fd", scope: !148, file: !6, line: 564, baseType: !84, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 568, baseType: !153, size: 128)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 568, size: 128, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !153, file: !6, line: 569, baseType: !106, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_fd", scope: !153, file: !6, line: 570, baseType: !84, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "file_flags", scope: !153, file: !6, line: 571, baseType: !84, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 574, baseType: !159, size: 160)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 574, size: 160, elements: !160)
!160 = !{!161, !162, !163, !164, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "target_fd", scope: !159, file: !6, line: 575, baseType: !84, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "attach_bpf_fd", scope: !159, file: !6, line: 576, baseType: !84, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "attach_type", scope: !159, file: !6, line: 577, baseType: !84, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "attach_flags", scope: !159, file: !6, line: 578, baseType: !84, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "replace_bpf_fd", scope: !159, file: !6, line: 579, baseType: !84, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !78, file: !6, line: 606, baseType: !167, size: 576)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 585, size: 576, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prog_fd", scope: !167, file: !6, line: 586, baseType: !84, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !167, file: !6, line: 587, baseType: !84, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data_size_in", scope: !167, file: !6, line: 588, baseType: !84, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_size_out", scope: !167, file: !6, line: 589, baseType: !84, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data_in", scope: !167, file: !6, line: 593, baseType: !106, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data_out", scope: !167, file: !6, line: 594, baseType: !106, size: 64, align: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !167, file: !6, line: 595, baseType: !84, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !167, file: !6, line: 596, baseType: !84, size: 32, offset: 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size_in", scope: !167, file: !6, line: 597, baseType: !84, size: 32, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size_out", scope: !167, file: !6, line: 598, baseType: !84, size: 32, offset: 352)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_in", scope: !167, file: !6, line: 602, baseType: !106, size: 64, align: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_out", scope: !167, file: !6, line: 603, baseType: !106, size: 64, align: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !6, line: 604, baseType: !84, size: 32, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !167, file: !6, line: 605, baseType: !84, size: 32, offset: 544)
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 608, baseType: !184, size: 96)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 608, size: 96, elements: !185)
!185 = !{!186, !194, !195}
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !6, line: 609, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !184, file: !6, line: 609, size: 32, elements: !188)
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "start_id", scope: !187, file: !6, line: 610, baseType: !84, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prog_id", scope: !187, file: !6, line: 611, baseType: !84, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "map_id", scope: !187, file: !6, line: 612, baseType: !84, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "btf_id", scope: !187, file: !6, line: 613, baseType: !84, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "link_id", scope: !187, file: !6, line: 614, baseType: !84, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next_id", scope: !184, file: !6, line: 616, baseType: !84, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "open_flags", scope: !184, file: !6, line: 617, baseType: !84, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !78, file: !6, line: 624, baseType: !197, size: 128)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 620, size: 128, elements: !198)
!198 = !{!199, !200, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_fd", scope: !197, file: !6, line: 621, baseType: !84, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "info_len", scope: !197, file: !6, line: 622, baseType: !84, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !197, file: !6, line: 623, baseType: !106, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !78, file: !6, line: 633, baseType: !203, size: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 626, size: 256, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "target_fd", scope: !203, file: !6, line: 627, baseType: !84, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "attach_type", scope: !203, file: !6, line: 628, baseType: !84, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "query_flags", scope: !203, file: !6, line: 629, baseType: !84, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "attach_flags", scope: !203, file: !6, line: 630, baseType: !84, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ids", scope: !203, file: !6, line: 631, baseType: !106, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prog_cnt", scope: !203, file: !6, line: 632, baseType: !84, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "raw_tracepoint", scope: !78, file: !6, line: 638, baseType: !212, size: 128)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 635, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !6, line: 636, baseType: !106, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prog_fd", scope: !212, file: !6, line: 637, baseType: !84, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !6, line: 640, baseType: !217, size: 256)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 640, size: 256, elements: !218)
!218 = !{!219, !220, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !217, file: !6, line: 641, baseType: !106, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "btf_log_buf", scope: !217, file: !6, line: 642, baseType: !106, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "btf_size", scope: !217, file: !6, line: 643, baseType: !84, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "btf_log_size", scope: !217, file: !6, line: 644, baseType: !84, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "btf_log_level", scope: !217, file: !6, line: 645, baseType: !84, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "task_fd_query", scope: !78, file: !6, line: 662, baseType: !225, size: 384)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 648, size: 384, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !225, file: !6, line: 649, baseType: !84, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !225, file: !6, line: 650, baseType: !84, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !6, line: 651, baseType: !84, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !225, file: !6, line: 652, baseType: !84, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !225, file: !6, line: 653, baseType: !106, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prog_id", scope: !225, file: !6, line: 658, baseType: !84, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fd_type", scope: !225, file: !6, line: 659, baseType: !84, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "probe_offset", scope: !225, file: !6, line: 660, baseType: !106, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "probe_addr", scope: !225, file: !6, line: 661, baseType: !106, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "link_create", scope: !78, file: !6, line: 679, baseType: !237, size: 256)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 664, size: 256, elements: !238)
!238 = !{!239, !240, !245, !246, !247}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prog_fd", scope: !237, file: !6, line: 665, baseType: !84, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !6, line: 666, baseType: !241, size: 32, offset: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !6, line: 666, size: 32, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "target_fd", scope: !241, file: !6, line: 667, baseType: !84, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "target_ifindex", scope: !241, file: !6, line: 668, baseType: !84, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "attach_type", scope: !237, file: !6, line: 670, baseType: !84, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !237, file: !6, line: 671, baseType: !84, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !6, line: 672, baseType: !248, size: 128, offset: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !6, line: 672, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "target_btf_id", scope: !248, file: !6, line: 673, baseType: !84, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 674, baseType: !252, size: 128)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !6, line: 674, size: 128, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "iter_info", scope: !252, file: !6, line: 675, baseType: !106, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "iter_info_len", scope: !252, file: !6, line: 676, baseType: !84, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "link_update", scope: !78, file: !6, line: 689, baseType: !257, size: 128)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 681, size: 128, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "link_fd", scope: !257, file: !6, line: 682, baseType: !84, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "new_prog_fd", scope: !257, file: !6, line: 684, baseType: !84, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !6, line: 685, baseType: !84, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "old_prog_fd", scope: !257, file: !6, line: 688, baseType: !84, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "link_detach", scope: !78, file: !6, line: 693, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 691, size: 32, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "link_fd", scope: !264, file: !6, line: 692, baseType: !84, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "enable_stats", scope: !78, file: !6, line: 697, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 695, size: 32, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !6, line: 696, baseType: !84, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "iter_create", scope: !78, file: !6, line: 702, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 699, size: 64, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "link_fd", scope: !272, file: !6, line: 700, baseType: !84, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !272, file: !6, line: 701, baseType: !84, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prog_bind_map", scope: !78, file: !6, line: 708, baseType: !277, size: 96)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !6, line: 704, size: 96, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prog_fd", scope: !277, file: !6, line: 705, baseType: !84, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !277, file: !6, line: 706, baseType: !84, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !277, file: !6, line: 707, baseType: !84, size: 32, offset: 64)
!282 = !{!73, !283, !284, !285}
!283 = !DILocalVariable(name: "cmd", arg: 2, scope: !74, file: !3, line: 13, type: !50)
!284 = !DILocalVariable(name: "attr", arg: 3, scope: !74, file: !3, line: 13, type: !77)
!285 = !DILocalVariable(name: "size", arg: 4, scope: !74, file: !3, line: 13, type: !7)
!286 = !DILocation(line: 0, scope: !74, inlinedAt: !287)
!287 = distinct !DILocation(line: 13, column: 5, scope: !60)
!288 = !DILocation(line: 16, column: 10, scope: !289, inlinedAt: !287)
!289 = distinct !DILexicalBlock(scope: !74, file: !3, line: 16, column: 6)
!290 = !DILocation(line: 16, column: 25, scope: !289, inlinedAt: !287)
!291 = !DILocation(line: 17, column: 12, scope: !292, inlinedAt: !287)
!292 = distinct !DILexicalBlock(scope: !289, file: !3, line: 16, column: 39)
!293 = !{!294, !294, i64 0}
!294 = !{!"int", !71, i64 0}
!295 = !DILocation(line: 18, column: 3, scope: !292, inlinedAt: !287)
